{
    "id": "11779",
    "name": "Youjo Kodama",
    "url": "https://www.royalroad.com/fiction/11779/youjo-kodama",
    "cover_image": "data\\images\\11779_cover.jpg",
    "category": "Fan Fiction",
    "status": "INACTIVE",
    "tags": [
        "LitRPG",
        "Reincarnation",
        "Non-Human Lead",
        "Sci-fi",
        "Strong Lead",
        "Fantasy",
        "Female Lead",
        "Gender Bender"
    ],
    "description": "When your time has come, and you close your eyes for a final time, what will you leave behind? When Man has forsaken its once proud nature, what will it become? When forests turn into cities, will you still recognize your old home? When humanity unites, albeit in a strange manner, will you be proud? When your time has come, and you reopen your eyes, will you finally embrace the world anew?\n\nThe premise of this story is reincarnating as a Dryad in the future, I hope you will enjoy and comment or give feedback about the story.\n\nYoujo Kodama is my first story on Royalroadl. I draw heavy inspiration from series such as Ciaphas Cain from Warhammer 40K, Star Wars, Youjo Senki, and Overlord. This story combines elements from both Sci-fi and fantasy genres.\n\nYou will recognize some elements from those series as I will copy some lore or background elements as I craft them into my own story.\n\nThis story could be considered fanfiction but I will bring them together in a new direction.\n\nI hope you will join me on this fantastic adventure. Any comments and feedback are always appreciated.",
    "total_views": "211,011",
    "average_views": "8,440",
    "followers": "489",
    "favorites": "137",
    "ratings": "81",
    "page_views": "588",
    "overall_score": "",
    "style_score": "",
    "story_score": "",
    "grammar_score": "",
    "character_score": "",
    "reviews": [
        {
            "review_id": "712668",
            "title": "Time for exposition on top of exposition",
            "time": "09:26 6/6/2020",
            "content": "Time for exposition on top of exposition\nREVIEWED AT: Chapter 1\nBY Jean Fere\n09:26 6/6/2020\n\nThe writing is rather poor with far too much exposition. Ditched it at ch 3\n\n Report",
            "user_id": "162453",
            "chapter_id": "133817",
            "story_id": "11779",
            "score_id": "712668_score",
            "_id": 