{
    "id": "118244",
    "name": "Earth's Hidden Sovereign",
    "url": "https://www.royalroad.com/fiction/118244/earths-hidden-sovereign",
    "cover_image": "data\\images\\118244_cover.jpg",
    "category": "Original",
    "status": "HIATUS",
    "tags": [
        "Virtual Reality",
        "Urban Fantasy",
        "Kingdom Building",
        "Cultivation",
        "Psychological",
        "Action",
        "Adventure",
        "Fantasy",
        "Attractive Lead",
        "LitRPG",
        "Male Lead",
        "Martial Arts",
        "Multiple Lovers",
        "Secret Identity",
        "Soft Sci-fi",
        "Strategy",
        "Strong Lead",
        "Supernatural"
    ],
    "description": "When Gu Jun was twelve, he inscribed an ancient epitaph on a forgotten gravestone atop Temple Hill — in a language no one on Earth should know.\n\nNow eighteen, Gu Jun is preparing to begin his university life in Tianhai. To everyone around him, he’s just a quiet, unremarkable student. But beneath that façade lies a cosmic legacy — the inheritance of Emperor Qin, the last sovereign of our Universe, the Wild Universe.\n\nEarth, long sealed from the higher realms, is no longer safe. Ancient enemies stir beyond the veil of stars. Forbidden truths bleed into the world of mortals. The coming war won't just be fought with armies — it will be waged in silence, in shadows, and in secret.\n\nTo protect Earth and the Universe, Gu Jun must build what the world must never know: a hidden empire. Trained in cultivation. Forged in secrecy. Bound by destiny.\n\nAnd as the final battle looms, warriors must rise from the dark — or all of creation may fall.\n\nAuthor's Note:\nI’ve been a long-time fan of legendary writers like Er Gen, I Eat Tomatoes, and Mao Ni; their stories have inspired me for over a decade. In my own writing, I aim to follow in their footsteps.\n\nDon’t expect the protagonist to slaughter rivers of enemies in the first chapter. This isn’t a story built on cheap thrills. Instead, I focus on building a solid foundation, establishing the world, characters, and deeper plots. Once that’s in place, expect action, intrigue, betrayal, and tragedy to unfold.\n\n# If you enjoy:\n\n*Medium-Paced Stories with Long-Term Scheming,\n\n*A Bigger Picture,\n\n*Cultivation,\n\n*Way of the Emperor (Emperor is always right),\n\n*Some litRPG Elements,\n\n*Family, Sect, Secret, Darkness, Tragedy, Betrayal\n\n*Dao, Dao Heart, and Heavenly Dao\n\n*Light Romance (Harem? may be)\n\nI invite you to follow this journey.\n\n*I will release three chapters per week.\n\nHappy reading, and thank you for your support!",
    "total_views": "14,265",
    "average_views": "408",
    "followers": "37",
    "favorites": "8",
    "ratings": "10",
    "page_views": "173",
    "overall_score": "",
    "style_score": "",
    "story_score": "",
    "grammar_score": "",
    "character_score": "",
    "reviews": [
        {
            "review_id": "2645359",
            "title": "A Fantastic addition to the Xianxia genre",
            "time": "06:09 10/7/2025",
            "content": "A Fantastic addition to the Xianxia genre\nREVIEWED AT: 8. Senior Sister's Protection\nBY tvhead25\n06:09 10/7/2025\n\nI was presently surprised by how this story developed. It starts off with a bit of a slow burn but the high stakes and weight of what to come keeps you reading. The writing style draws you into their world and really makes you care for the characters.\n\nI'm not an expert in Xianxia, so I was curious if this would really peak my interest. However the prologue got me hooked and Gu Jun feels like a protagonist that's well grounded. Hearing Lin Mo's backstory was devastating and entreating. I'm loving this story so far and can't wait to see it to the end!\n\n Report",
            "user_id": "545209",
            "chapter_id": "2354183",
            "story_id": "118244",
            "score_id": "2645359_score",
            "_id": 