{
    "id": "21220",
    "title": "Mother of Learning",
    "fiction_url": "https://www.royalroad.com/fiction/21220/mother-of-learning",
    "cover_image_local": "data\\images\\21220_cover.jpg",
    "author": "nobody103",
    "category": "Original",
    "status": "COMPLETED",
    "tags": [
        "Time Loop",
        "Adventure",
        "Fantasy",
        "Mystery",
        "Magic"
    ],
    "description": "Zorian is a teenage mage of humble birth and slightly above-average skill, attending his third year of education at Cyoria's magical academy. He is a driven and irritable young man, consumed by a desire to ensure his own future and free himself of the influence of his family, whom he resents for favoring his brothers over him. Consequently, he has no time for pointless distractions or paying attention to other people's problems.\n\nAs it happens, time is something he is about to get plenty of. On the eve of the Cyoria's annual summer festival, he is killed and brought back to the beginning of the month, just before he was about to take a train to Cyoria. Suddenly trapped in a time loop with no clear end or exit, Zorian will have to look both within and without to unravel the mystery before him. And he does have to unravel it, for the time loop hadn't been made for his sake and dangers lurk everywhere...\n\nRepetition is the mother of learning, but Zorian will have to first make sure he survives to try again - in a world of magic, even a time traveler isn't safe from those who wish him ill.\n\n**********************************\n\nMother of Learning is now available for sale on Amazon. The story will remain available in full here on Royal Road and on Fictionpress, but if you're more interested to read the story as a Kindle Edition e-book you now have a way to do that.\n\nThe audiobooks can be found on this link here. The physical edition is available through a Kickstarter campaign, which can be found here.\n\nI will keep you all updated on that as things develop.\n\n**********************************\n\nIf anyone is interested, I have a story-related worldbuilding site that can be found here. I don't update it as often as I should, but there is a fair amount of content there already. It also contains a page with all the fanart, fan translations, audio books and the like - you can reach it directly by clicking this link.\n\nI have a patreon account for those kind people that want to give me money. It also contains info for those who want to donate via paypal.\n\nThe story was originally posted on fictionpress, back in 2011. When I reached chapter 91, I started uploading the story to RoyalRoad, one chapter per day. The Fictionpress version of the story can be reached by clicking on this link if somebody is interested, though at this point there is nothing there that isn't also on RoyalRoad.",
    "stats": {
        "score": {
            "overall_score": "",
            "style_score": "",
            "story_score": "",
            "grammar_score": "",
            "character_score": ""
        },
        "views": {
            "total_views": "24,711,189",
            "average_views": "226,708",
            "followers": "29,476",
            "favorites": "28,442",
            "ratings": "15,849",
            "page_views": "2,932"
        }
    },
    "metadata_hash": "5142128b817d26b4a7c1aa420345804395d524a7cf96607641a951d3ecb5b281",
    "created_at": "2025-11-29T19:22:55.823198",
    "updated_at": "2025-11-29T19:22:55.823198",
    "last_synced_at": null,
    "reviews": [],
    "chapters": [
        {
            "chapter_id": "301778",
            "url": "https://www.royalroad.com/fiction/21220/mother-of-learning/chapter/301778/1-good-morning-brother",
            "title": "1. Good Morning Brother",
            "content_text": "Chapter 001\nGood Morning Brother\n\nZorian’s eyes abruptly shot open as a sharp pain erupted from his stomach. His whole body convulsed, buckling against the object that fell on him, and suddenly he was wide awake, not a trace of drowsiness in his mind.\n\n“Good morning, brother!” an annoyingly cheerful voice sounded right on top of him. “Morning, morning, MORNING!!!”\n\nZorian glared at his little sister, but she just smiled back at him cheekily, still sprawled across his stomach. She was humming to herself in obvious satisfaction, kicking her feet playfully in the air as she studied the giant world map Zorian had tacked to the wall next to his bed. Or rather, pretended to study – Zorian could see her watching him intently out of the corner of her eyes for a reaction.\n\nThis was what he got for not arcane-locking the door and setting up a basic alarm perimeter around his bed.\n\n“Get off,” he told her in the calmest voice he could muster.\n\n“Mom said to wake you up,” she said matter-of-factly, not budging from her spot.\n\n“Not like this, she didn’t,” Zorian grumbled, swallowing his irritation and patiently waiting till she dropped her guard. Predictably, Kirielle grew visibly agitated after only a few moments of this pretend disinterest. Just before she could blow up, Zorian quickly grasped her legs and chest and flipped her over the edge of the bed. She fell to the floor with a thud and an indignant yelp, and Zorian quickly jumped to his feet to better respond to any violence she might decide to retaliate with. He glanced down on her and sniffed disdainfully. “I’ll be sure to remember this the next time I’m asked to wake you up.”\n\n“Fat chance of that,” she retorted defiantly. “You always sleep longer than I do.”\n\nZorian simply sighed in defeat. Damn the little imp, but she was right about that.\n\n“So…” she began excitedly, jumping to her feet, “are you excited?”\n\nZorian watched her for a moment as she bounced around his room like a monkey on caffeine. Sometimes he wished he had some of that boundless energy of hers. But only some.\n\n“About what?” Zorian asked innocently, feigning ignorance. He knew what she meant, of course, but constantly asking obvious questions was the fastest way of frustrating his little sister into dropping a conversation he’d rather not have.\n\n“Going back to academy!” she whined, clearly aware of what he was doing. He needed to learn some new tricks. “Learning magic. Can you show me some magic?”\n\nZorian let out a long-suffering sigh. Kirielle had always treated him as something of a playmate of hers, despite him doing his best not to encourage her, but usually she remained within certain unspoken boundaries. She was downright impossible this year, though, and Mother was wholly unsympathetic to his pleas to rein her in. All he did was read all day long, she said, so it wasn’t as if he was doing anything important… Thankfully the summer break was over and he could finally get away from them all.\n\n“Kiri, I have to pack. Why don’t you go pester Fortov for a change?”\n\nShe scowled at him unhappily for a second and then perked up, as if remembering something, and quickly ran out of the room. Zorian’s eyes widened when he realized what she was up to a second too late.\n\n“No!” he yelled as he ran after her, only to have the bathroom door slammed into his face. He pounded on the door in frustration. “Damn it, Kiri! You had all the time in the world to go to the bathroom before I woke up!”\n\n“Sucks to be you,” was her only answer.\n\nAfter hurling a few choice curses at the door, Zorian stomped off back to his room to get dressed. She would be inside for ages, he was sure, if only to spite him.\n\nQuickly changing out of his pajamas and putting on his glasses, Zorian took a moment to look around his room. He was pleased to note Kirielle hadn’t rummaged through his stuff before waking him up. She had a very fuzzy notion of (other people’s) privacy.\n\nIt didn’t take Zorian long to pack – he had never really unpacked, to be honest, and would have gone back to Cyoria a week ago if he thought Mother would have allowed it. He was just packing his school supplies when he realized with irritation that some of his textbooks were missing. He could try a locator spell, but he was pretty sure he knew where they had ended up – Kirielle had a habit of taking them to her room, no matter how many times Zorian told her to keep her sticky little fingers away from them. Working on a hunch, he double-checked his writing supplies and, sure enough, found they had been greatly depleted.\n\nIt always happened – every time he came home, Kirielle would raid his school supplies. Putting aside the ethical problems inherent in breaking into your brother’s room in order to steal his things, what on earth was she doing with all those pencils and erasers? This time he specifically bought extras with his sister in mind, but it still wasn’t enough - he couldn’t find a single eraser in his drawer, and he bought a whole packet of them before coming home. Why Kirielle couldn’t simply ask Mother to buy her some books and pens of her own was never really clear to Zorian. She was the youngest, and the only daughter, so Mother was always happy to spoil her - the dolls she talked Mother into buying her were five times more expensive than a couple of books and a stack of pencils.\n\nIn any case, while Zorian had no delusions about ever seeing his writing supplies again, he really needed those textbooks. With that in mind, he marched off to his sister’s room, ignoring the ‘Keep out!’ warning on the door, and quickly found his missing books in their usual location – cunningly hidden under the bed, behind several conveniently placed stuffed animals.\n\nHis packing done, he went downstairs to eat something and see what Mother wanted from him.\n\nThough his family thought he simply liked to sleep in, Zorian actually had a reason for being a late riser. It meant he could eat his food in peace, as everyone else had already had their breakfast by then. Few things annoyed him more than someone trying to strike up a conversation while he was eating, and that was precisely the time when the rest of his family was most talkative. Unfortunately, Mother wasn’t willing to wait for him today, and immediately descended upon him when she saw him coming down. He didn’t even finish his descent down the stairs and she had already found something about him she didn’t like.\n\n“You don’t really intend to go out looking like that, do you?” she asked.\n\n“What’s wrong with this?” asked Zorian. He was wearing a plain brown outfit, little different from the ones other boys wore when they were going into the city. It seemed just fine to him.\n\n“You can’t go out looking like that,” his mother said with a long-suffering sigh. “What do you think people will say when they see you wearing that?”\n\n“Nothing?” Zorian tried.\n\n“Zorian, don’t be so difficult,” she snapped at him. “Our family is one of the pillars of this town. We’re under scrutiny every time we leave the house. I know you don’t care about such things, but appearances are important to a lot of people. You need to realize you’re not an island, and you can’t decide things as if you were alone in the world. You are a member of this family, and your actions inevitably reflect on our reputation. I will not let you embarrass me by looking like a common factory worker. Go back to your room and put on some proper attire.”\n\nZorian restrained himself from rolling his eyes just long enough to turn his back on her. Maybe her guilt trip would have been more effective if this was the first time she tried it on him. Still, it wasn’t worth the argument, so he changed into a pricier set of clothes. It was totally excessive, considering he’d be spending the whole day in the train, but his mother nodded approvingly when she saw him coming down the stairs. She had him turn and pose like a show animal for a while before pronouncing him ‘fairly decent’. He went to the kitchen and, to his annoyance, Mother followed after him. No eating in peace today, it seemed.\n\nFather was thankfully on one of his 'business trips', so he wouldn't have to deal with him today.\n\nHe entered the kitchen and frowned when he saw a bowl of porridge already waiting for him on the table. Usually he made his own breakfast, and he liked it that way, but he knew his mother never accepted that. This was her idea of a peace gesture, which meant she was going to ask something of him he wouldn’t like.\n\n“I figured I’d prepare something for you today, and I know you’ve always liked porridge,” she said. Zorian refrained from mentioning he hadn’t liked it since he was about eight. “You slept longer than I thought you would, though. It's gone cold while I've waited for you.”\n\nZorian rolled his eyes and cast a slightly modified ‘heat water’ spell on the porridge, which was instantly returned to a pleasant temperature.\n\nHe ate his breakfast in silence while Mother talked to him at length about a crop-related dispute one of their suppliers was involved in, dancing around whatever topic she wanted to broach. He effortlessly tuned her out. It was practically a survival skill for every child in the Kazinski family, as both mother and father were prone to protracted lectures on every subject imaginable, but doubly so for Zorian, who was the black sheep of the family and thus subjected to such monologues more frequently than the rest. Thankfully, his mother thought nothing of his silence, because Zorian was always as silent as possible around his family – he had learned many years ago that this was the easiest way of getting along with them.\n\n“Mother,” he interrupted her, “I just woke up via Kiri jumping on me, I haven’t had a chance to go to the bathroom and now you’re pestering me while I’m eating. Either get to the point or wait a couple of minutes while I finish breakfast.”\n\n“She did it again?” his mother asked, amusement obvious in her voice.\n\nZorian rubbed his eyes, not saying anything, before surreptitiously pocketing an apple from the bowl on the table while his mother wasn’t looking. There were a lot of annoying things Kirielle did again and again, but complaining about it to Mother was a waste of time. No one in this family was on his side.\n\n“Oh, don’t be like that,” his mother said, noticing his less-than-pleased reaction. “She’s just bored and playing with you. You take things way too seriously, just like your father.”\n\n“I am nothing like my father!” Zorian insisted, raising his voice and glaring at her. This was why he hated eating with other people. He returned to his breakfast with renewed vigor, eager to finish this as soon as possible.\n\n“Of course you’re not,” Mother said airily, before suddenly switching the subject. “Actually, this reminds me of something. Your father and I are going to Koth to visit Daimen.”\n\nZorian bit the spoon in his mouth to prevent himself from making a snide comment. It was always Daimen this, Daimen that. There were days when Zorian wondered why his parents had three other children when they were clearly so enamored of their eldest son. Really, going to another continent just to visit him? What, were they going to die if they didn’t see him for a year?\n\n“What’s that got to do with me?” Zorian asked.\n\n“It will be an extended visit,” she said. “We’ll be there for about six months, most of it spent traveling from one place to another. You and Fortov will be at the academy, of course, but I’m worried about Kirielle. She’s only nine and I don’t feel comfortable bringing her along with us.”\n\nZorian paled, finally catching on to what she wanted of him. Hell. No.\n\n“Mother, I’m 15,” he protested.\n\n“So?” she asked. “Your father and I were already married when we were your age.”\n\n“Times change. Besides, I spend most of the day at the academy,” Zorian responded. “Why don’t you ask Fortov to take care of her? He’s a year older and he has his own apartment.”\n\n“Fortov is in his fourth year,” his mother said sternly. “He’s going to graduate this year so he has to focus on his grades.”\n\n\"You mean he said no,\" Zorian concluded out loud.\n\n“And besides…” she continued, ignoring his remark, “I’m sure you’re aware of how irresponsible Fortov can be at times. I don’t think he’s fit to raise a little girl.”\n\n“And whose fault is that?” Zorian grumbled quietly, loudly dropping his spoon and pushing the plate away from him. Maybe Fortov was irresponsible because he knew mother and father would simply dump his responsibilities onto Zorian if he just played dumb long enough, didn’t that ever occur to her? Why did it always fall to him to deal with the little imp? Well, he wasn’t going to get saddled with this! If Fortov was too good to take care of Kirielle, then so was Zorian!\n\nPlus, the little tattletale would undoubtedly report everything he did back to Mother without a second thought. The best thing about attending a school so far from home was that he could do whatever he wanted with his family being none the wiser, and there was no way he was going to give that up. Really, this was just a transparent ploy by his mother to spy on him, so she could lecture him some more about family pride and proper manners.\n\n“I don’t think I’m fit for that either,” continued Zorian a little louder. “You said only a few minutes ago that I’m an embarrassment to the family. We wouldn’t want to corrupt little Kiri with my uncaring attitude, now would we?”\n\n“I didn’t-“\n\n“No!” Zorian shouted.\n\n“Oh, have it your way,” she huffed in resignation. “But really, I wasn’t suggesting-“\n\n“What are you talking about?” Kirielle called out from behind him.\n\n“We were discussing what a rotten brat you are,” Zorian shot back immediately.\n\n“No you weren’t!”\n\nZorian just rolled his eyes and rose from his seat, intending to go to the bathroom, only to find an irate little sister blocking his path. There was a knock at the door.\n\n“I’ll get it!” said Zorian quickly, knowing that Mother would demand that one of them open the door and that Kirielle wouldn’t budge from her spot any time soon - she could be very stubborn when she wanted.\n\nThat was how Zorian found himself staring at a bespectacled woman dressed in expensive-looking khaki-colored clothes and cradling a thick book in her arm.\n\nThe woman gave him an appraising glance, adjusting her glasses. “Zorian Kazinski?”\n\n“Uh, yeah?” he said, unsure how to react to this development.\n\n“I am Ilsa Zileti, from Cyoria’s Royal Academy of Magical Arts. I’m here to discuss the results of your certification.”\n\nColor drained from Zorian’s face. They sent an actual mage to talk to him!? What did he do to warrant this!? Mother was going to skin him alive!\n\n“You aren’t in trouble, Mister Kazinski,” she said, smiling in amusement. “The Academy has a habit of sending a representative to third year students to discuss various matters of interest. I confess I should have visited you sooner, but I have been a tad busy this year. You have my apologies.”\n\nZorian stared at her for a few seconds.\n\n“May I come in?”\n\n“Huh? Oh!” said Zorian. “Forgive my manners, Miss Zileti. Come in, come in.”\n\n“Thank you,” she accepted politely, stepping into the house.\n\nAfter a quick introduction to his mother and sister, Ilsa asked him if he had somewhere they could discuss school matters privately. Mother quickly decided she had to go to town market and took Kirielle with her, leaving him alone in the house with the mage, who promptly scattered various papers across the kitchen desk.\n\n“So, Zorian,” she began. “You already know you passed the certification.”\n\n“Yes, I got the written notice,” Zorian said. “Cirin doesn’t have a mage tower, so I was going to pick up the badge when I got back to Cyoria.”\n\nIlsa simply handed him a sealed scroll. Zorian inspected the scroll for a few seconds and then tried to break the seal so he could read it. Unfortunately, the seal was quite tough to break. Unnaturally so, even.\n\nHe frowned. Ilsa wouldn’t have given him the scroll like this if she didn’t think he had the ability to open it. A test of some sort? He wasn’t anyone terribly special, so this would have to be something pretty easy. What skill did every recently-minted mage possess that would…\n\nOh. He almost rolled his eyes when he realized what this was all about. He channeled some mana into the seal and it promptly snapped itself in half, allowing Zorian to finally unroll the scroll. It was written in very neat calligraphy and appeared to be some kind of proof of his identity as a first circle mage. He glanced back at Ilsa, who nodded approvingly, confirming to Zorian that he had just passed a test of some sort.\n\n“You don’t really have to pick up your badge until you finish school,” she said. “The badge is pretty expensive and nobody is really going to bother you about it unless you plan to open a shop or otherwise sell your magical expertise. If they do bother you for whatever reason, just refer them to the academy and we’ll clear things up.”\n\nZorian shrugged. While he did intend to break away from his family, he’d prefer to wait until graduation, and that was two years away. He motioned on for her to continue.\n\n“Very well, then. The records say you lived in the academy housing for the past two years. I assume you intend to continue?”\n\nIf you encounter this story on Amazon, note that it's taken without permission from the author. Report it.\n\nZorian nodded and she reached into one of her pockets and handed him a rather strange key. Zorian knew how locks in general worked, and could even pick simpler ones with enough time, but he couldn’t figure out how this key was supposed to work – it had no ‘teeth’ to fit in with the tumblers inside the lock. On a hunch, he channeled some mana into it, and faint golden lines immediately lit across the surface of the metal. He looked at Ilsa in a silent question.\n\n“Housing for third years works differently than you are used to,” she told him. “As you’re likely aware, now that you are a certified first circle mage, the academy is authorized to teach you spells of the first circle and above. Since you’ll be handling sensitive material, greater security is required, so you’ll be moving into a different building. The lock on your door is keyed to your mana, so you’ll have to channel some of your personal mana into the key like you did just now before it will unlock.”\n\n“Ah,” said Zorian. Idly he spun the key in his hand, wondering how exactly they got a hold of his mana signature. Something to research later, he supposed.\n\n“Normally I would be explaining to you in detail what it means to be a third year student at Cyoria’s magical academy, but I hear you have a train leaving soon, so why don’t we jump straight to the main reason I’m here: your mentor and electives. You can ask me anything you wish to know afterwards.”\n\nZorian perked up on this, especially the mention of ‘mentor’. Each third year was given a mentor that they met with once a week, who was supposed to teach students in ways not possible in a standard class format, and otherwise help them reach their maximum potential. A choice of one’s mentor could make or break one’s magical career and Zorian knew he had to choose carefully. Fortunately, he had asked around among older students to find out which ones were good and which ones were bad, so he figured he would at least be able to get an above-average one.\n\n“So which mentors can I choose from?” Zorian asked.\n\n“Well, actually, I’m afraid you can’t,” Ilsa said apologetically. “Like I said, I was supposed to get to you sooner. Unfortunately, all but one of the mentors have filled their quota of students at this point.”\n\nZorian had a bad feeling about this… “And this mentor is?”\n\n“Xvim Chao.”\n\nZorian groaned, burying his face in his hands. Of all the teachers, Xvim was widely agreed upon as the worst mentor you could possibly get. It just had to be him, didn’t it?\n\n“It’s not that bad,” Ilsa assured him. “The rumors are mostly exaggerated, and mostly spread by students unwilling to do the kind of work Professor Xvim requires of his charges. I’m sure a talented, hard-working student such as yourself will have no problems with him.”\n\nZorian snorted. “I don’t suppose there is any chance to transfer to another mentor, is there?”\n\n“Not really. We’ve had a really good pass rate last year, and all of the mentors are swamped with students as it is. Professor Xvim is the least burdened of the available mentors.”\n\n“My, I wonder why,” Zorian mumbled. “Alright, fine. What about electives?”\n\nIlsa handed him another scroll, this one unsealed, containing a list of all elective classes offered by the academy. It was long. Very long. You could sign up for practically anything, even things that weren’t of strictly magical nature: things like advanced mathematics, classical literature, and architecture. It was to be expected, really, since Ikosian magical tradition had always been inextricably connected to other intellectual pursuits.\n\n“You can choose up to five, but no less than three electives this year. It would be a lot more convenient for us if you did it now, so that we can finalize the schedules over the weekend before the classes start. Don’t be too intimidated by the sheer size of the list. Even if you choose something that doesn’t appeal to you, you can switch to a different elective during the first month of school.”\n\nZorian frowned. There were a lot of electives and he wasn’t quite sure which ones he wanted to take. He'd already gotten shafted in the mentor department, so he really couldn’t afford to screw up here. This would take a while.\n\n“Please don’t take this the wrong way Miss Zileti, but would you mind if we take a short break before we go any further with this?”\n\n“Of course not,” she said. “Is something the matter?”\n\n“Not at all,” assured Zorian. “It’s just that I really need to go to the bathroom.”\n\nProbably not the best way to make a first impression. Kirielle was so going to pay for putting him in this position.\n\n- break -\n\nZorian trailed after his family in silence as they entered Cirin’s train station, ignoring Fortov’s exuberant greeting of some ‘friends’ of his. He scanned the crowd on the train station for any familiar faces but, predictably, came out empty. He didn’t really know all that many people in his home town, as his parents loved reminding him. He felt his mother’s gaze on him as he unsuccessfully searched for an empty bench, but refused to look back at her – she would take that as permission to initiate conversation, and he already knew what she would say.\n\n‘Why don’t you join Fortov and his friends, Zorian?’\n\nBecause they’re immature jackasses, just like Fortov, that’s why.\n\nHe sighed, looking at the empty train tracks with annoyance. The train was late. He didn’t mind waiting as such, but waiting in the crowds was pure torture. His family would never understand, but Zorian hated crowds. It wasn’t any tangible thing, really – it was more like large gatherings of people projected some kind of presence that weighed down on him constantly. Most of the time it was annoying, though it did have its uses – his parents stopped taking him to church when they realized that dragging him into a small hall packed with people resulted in vertigo and fainting in a matter of minutes. Fortunately, the train station wasn’t currently crowded enough to produce such intense effects, but Zorian knew prolonged exposure would take its toll. He hoped the train wouldn’t take too long, because he didn’t relish spending the rest of the day with a headache.\n\nFortov’s loud laughter broke him out of such gloomy musings. His older brother didn’t have such problems, that’s for sure. Like always, he was cheerful, sociable, and had a smile that could light up the world. The people he was surrounded with were clearly enthralled with him, and he stood out among them at first glance, despite having the same thin build that Zorian did. He just had that kind of presence around him. He was like Daimen in this way, only Daimen had actual skills to back up his charm.\n\nHe scoffed, shaking his head. Zorian didn’t know for sure how Fortov had been accepted into a supposedly elite institution like Cyoria’s magical academy, but he strongly suspected Father had greased a few palms to get Fortov in. It wasn’t that Fortov was stupid, so much as lazy and completely unable to focus on a task, no matter how critical. Not that most people knew that, of course – the boy was charming as hell, and very adept in sweeping his inadequacies under the metaphorical rug.\n\nHis father always joked that Fortov and Zorian each got a half of Daimen in them: Fortov got his charm, and Zorian his competence.\n\nZorian had never liked his father’s sense of humor.\n\nA whistle pierced the air, and the train entered the station with a high-pitched squeal of metal wheels braking against the tracks. The original trains were steam-powered machines that billowed smoke wherever they went and consumed unholy amounts of coal to keep going, but this one was powered by the newer techno-magic engines that consumed crystallized mana instead. Cleaner, cheaper, and required less maintenance. Zorian could actually feel the mana radiating off the train as he approached, though his ability to sense magic was too underdeveloped to tell him any details. He had always wanted to look around the engine room of one of these things but could never figure out a good way to approach the train operators.\n\nBut that was a thought for another time. He gave a brief goodbye to Mother and Kirielle and entered the train to find himself a seat. He intentionally chose an empty compartment, something that was surprisingly easy to find. Apparently, despite the gathered crowd, few of them would be taking this particular train.\n\nFive minutes later, the train gave another ear-splitting whistle and began its long journey towards Cyoria.\n\n- break -\n\nThere was a sharp crackling sound, following by the sound of a bell ringing.\n\n“Now stopping in Korsa,” a disembodied voice echoed. A crackling sound again. “I repeat, now stopping in Korsa. Thank you.”\n\nThe speakers crackled one last time before turning silent.\n\nZorian released a long sigh of irritation and opened his eyes. He hated trains. The boredom, the heat, and the rhythmic thumping sounds all conspired to make him sleepy, but every time he finally drifted off to sleep he was rudely awoken by the station announcer. That this was the very purpose of that announcer – to wake up passengers who would sleep through their destination – was not lost on Zorian, but it was no less annoying because of it.\n\nHe looked through the window, only to see a train station like any other. In fact, it was completely identical to the previous five, down to the blue outline on the big white tablet saying ‘Korsa’. Apparently the station builders were working off some kind of template these days. Looking at the station platform they were stopping at, he could see a large crowd of people waiting to get on the train. Korsa was a major trading hub, and a lot of newly minted merchant families lived here, sending their children to Cyoria’s prestigious academy to become mages and mingle among children of other influential people. Zorian found himself wishing that none of his fellow students join him in his compartment, but he knew it was an idle dream – there were too many of them and his compartment was completely empty aside from him. He did all he could to make himself comfortable in his seat and closed his eyes again.\n\nThe first person to join him in his compartment was a chubby, glasses-wearing girl in a green turtleneck. She gave him a cursory glance and started reading a book in silence. Zorian would have been ecstatic with such an agreeable traveling companion, but soon enough a group of four other girls came in and took the remaining four seats for themselves. The newcomers were very loud and prone to giggling fits, and Zorian was sorely tempted to get up and find himself a new compartment to occupy. He spent the rest of the trip alternating between looking through the window at the endless fields they were passing and exchanging annoyed glances with the green-turtleneck girl, who seemed similarly irritated by the other girls’ antics.\n\nHe knew they were getting close to Cyoria when he could see trees on the horizon. There was only one city on this route that was this close to the great northern forest, and the trains otherwise avoided getting close to so infamous a place. Zorian picked up his bag and went to stand by the exit. The idea was to be among the first to disembark, and thus avoid the usual crowding that always occurred once they got to Cyoria, but he was too late – there was already a crowd at the exit when he approached. He leaned on the nearby window and waited, listening to animated conversation between three first year students beside him, who were talking excitedly amongst themselves about how they were going to start learning magic and whatnot. Boy, were they going to be disappointed – the first year was all theory, meditation exercises, and learning how to access your mana consistently.\n\n“Hey, you! You’re one of the upperclassmen, aren’t you?”\n\nZorian looked at the girl talking to him and suppressed a groan of irritation. He so did not want to talk to these people. He had been in the train since early morning, Mother had given him a nasty lecture because he hadn't offered Ilsa something to drink while she was in the house, and he was in no mood for anything.\n\n“I suppose you could describe me as such,” he said cautiously.\n\n“Can you show us any magic?” she asked eagerly.\n\n“No,” said Zorian flatly. He wasn’t even lying. “The train is warded to disrupt mana shaping. They had problems with people starting fires and vandalizing compartments.”\n\n“Oh,” the girl said, clearly disappointed. She frowned, like trying to figure something out. “Mana shaping?” she asked cautiously.\n\nZorian raised an eyebrow. “You don’t know what mana is?” She was first year, yes, but that was elementary. Anyone who went through elementary school should know at least that much.\n\n“Magic?” she tried lamely.\n\n“Ugh,” grunted Zorian. “The teachers would so fail you for that. No, it’s not magic. It’s what powers magic - the energy, the power, that a mage shapes into a magical effect. You’ll learn more about it in lectures, I guess. Bottom point is: no mana, no magic. And I can’t use any mana at the moment.”\n\nThis was misleading, but whatever. There was no way he was explaining things to some random stranger, especially since she should already know this stuff.\n\n“Um, okay. Sorry to bother you then.”\n\nWith a lot of squealing and steam-letting, the train stopped at Cyoria’s train station, and Zorian disembarked as fast as he could, pushing past the awed first-years staring at the sight before them.\n\nCyoria’s train station was huge, a fact made obvious by the fact that it was enclosed, making it look more like a giant tunnel. Actually, the station as a whole was even larger, because there were four more ‘tunnels’ like this one, plus all the support facilities. There was nothing like it anywhere in the world, and virtually everyone was stupefied the first time they saw it. Zorian was too, when he first disembarked here. The feeling of disorientation was amplified by the sheer number of people that went through this terminal, whether they were passengers going in and out of Cyoria, workers inspecting the train and unloading luggage, newsboys shouting headlines, or homeless people begging for some change. As far as he knew, this massive flow of people never really ceased, even at night, and this was a particularly busy day.\n\nHe looked at the giant clock hanging from the ceiling and, finding out he had plenty of time, bought himself some bread from the nearby bakery and then set course for Cyoria’s central plaza, intending to eat his newly acquired food while sitting on the edge of the fountain there. It was a nice place to relax.\n\nCyoria was a curious city. It was one of the most developed and largest cities in the world, which was at first glance strange, as Cyoria was dangerously close to monster-infested wilderness and wasn’t in a favorable trade location. What really catapulted it to prominence was the massive circular hole on the west side of the city – probably the most obvious Dungeon entrance ever and the only Rank 9 mana well known to exist. The absolutely massive quantities of mana gushing out from the underworld had made the spot an irresistible magnet for mages. The presence of such a huge number of mages made Cyoria unlike any other city on the continent, both in the culture of the people living there and, more obviously, in the architecture of the city itself. A lot of things that would be too impractical to build elsewhere were routinely done here, and it made for an inspiring sight if you could find a good spot to watch the city from.\n\nHe froze in his tracks when he noticed a swarm of rats staring at him from the bottom of the stairway he was about to descend. Their behavior was strange enough, but his heartbeat really sped up when he took notice of their heads. Was that… were their brains exposed!? He swallowed heavily and took a step back, slowly retreating from the stairwell before turning around and fleeing in a full sprint. He wasn’t sure what they were, but those were definitely not normal rats.\n\nHe supposed he shouldn’t be so shocked, though – a place like Cyoria attracted more than mages – magical creatures of all breeds found such places just as irresistible. He was just glad the rats didn’t pursue him, because he had nothing in the way of combat spells. The only spell he knew that could be used in a situation like this was the ‘spook animals’ spell, and he had no idea how effective that would have been against such clearly magical creatures.\n\nSomewhat shaken but still determined to get to the fountain, he tried to circle the rat gathering by going through the nearby park, but luck just wasn’t on his side today. He promptly ran into a little girl crying her eyes out on the bridge he had to cross, and it took him five minutes just to get her to calm down enough to find out what happened. He supposed he could have just pushed past her and left her there to cry, but not even he was that cold-hearted.\n\n“T-the b-bike!” she blurted out finally, hiccupping heavily. “It f-fell in!” she wailed.\n\nZorian blinked, trying to interpret what she was trying to tell him. Apparently realizing she wasn’t making any sense, the girl pointed towards the creek running underneath the bridge. Zorian looked over the edge of the bridge and, sure enough, there was a children’s bicycle half-submerged in the muddy waters.\n\n“Huh,” Zorian said. “Wonder how that happened?”\n\n“It fell in!” the girl repeated, looking as if she was going to cry again.\n\n“All right, all right, no need for waterworks, I’ll get it out okay?” Zorian said, eying the bicycle speculatively.\n\n“You’ll get dirty,” she warned quietly. Zorian could tell from her tone of voice that she hoped he would get it out anyway.\n\n“Don’t worry, I have no intention of wading through that mud,” Zorian said. “Watch.”\n\nHe made a few gestures and cast a ‘levitate object’ spell, causing the bike to jerkily rise out of the water and into the air. The bike was a lot heavier than the objects he usually practiced with, and he had to levitate the bike a lot higher than he was used to, but it was nothing outside his capabilities. He snatched the bike by its seat when it was close enough and placed it on the bridge.\n\n“There,” Zorian said. “It’s all muddy and wet but I can’t help you there. Don’t know any cleaning spells.”\n\n“O-Okay,” she nodded slowly, clutching her bicycle like it was going to fly out of her hand the moment she let go.\n\nHe bid her goodbye and left, deciding his relaxing time at the fountain just wasn’t meant to be. The weather seemed to be worsening pretty quickly too – dark clouds were brewing ominously across the horizon, heralding rain. He decided to simply join the diffuse line of students trudging towards the academy and be done with it.\n\nIt was a long way from the train station to the academy, since the station was on the outskirts of the city and the academy was right next to the Hole. Depending on how physically fit you were, and how much luggage you had to drag around, you could get there in an hour or two. Zorian wasn’t particularly fit, what with his skinny physique and shut-in ways, but he had purposely packed light in anticipation of this journey. He joined the procession of students that was still streaming from the train station in the direction of the academy, ignoring the occasional first year struggling with excessive baggage. He empathized with them because his asshole brothers didn’t warn him to keep the luggage at a minimum either and he was like them the first time he arrived at the train station, but there was nothing he could do to help them.\n\nThe threat of rain and bad luck aside, he felt invigorated as he drew closer to academy grounds. He was drawing on the ambient mana suffusing the area around the Hole, replenishing the mana reserves he spent levitating that girl’s bicycle. Mage academies are almost always built on top of mana wells for the express purpose of exploiting this effect – an area with such high ambient mana levels is a perfect place for inexperienced mages to practice their spellcasting. Anytime they run out of mana they can supplement their natural mana regeneration by replenishing their mana reserves from their very surroundings.\n\nZorian took out the apple he still carried in his pocket and levitated it over his palm. It wasn’t really a spell, so much as raw mana manipulation – a mana shaping exercise that was supposed to help mages improve their ability to control and direct magical energies. It looked like such a simple thing, but it took Zorian two years before he mastered it fully. Sometimes he wondered if his family was right and he really was too focused on his studies. He knew for a fact that most of his classmates had much more tenuous control over their magic, and it didn’t appear to be inhibiting them too much.\n\nHe dismissed the mana construct holding the apple in the air and let it fall down on his palm. He wished he had some kind of rain protection spell – the first drops of rain were already starting to fall. That, or an umbrella. Either would work just fine, except an umbrella didn’t require several years of training to use.\n\n“Magic can be such a rip-off at times,” said Zorian gloomily.\n\nHe took a deep breath and started running.\n\n- break -\n\n“Huh. So there is a rain protection spell,” mumbled Zorian as he watched raindrops splattering upon an invisible barrier in front of him. He extended his hand over the edge of the barrier, and it passed unimpeded. He withdrew his suddenly rather wet hand into the safety of the barrier and followed the boundary as far as his eyes could see. From what he could tell, the barrier encircled the entire academy compound (no small feat, as academy grounds were quite extensive) in a protective bubble that stopped the rain – and only rain - from penetrating it. Apparently the academy upgraded its wards again, because they didn’t have this feature the last time it was raining.\n\nShrugging, he turned around and continued towards the administration building of the academy. It was too bad the barrier didn’t also dry you out when you passed it, because he was soaking wet. Thankfully, his bag was waterproof, so his clothes and textbooks weren’t in any danger of getting ruined. Slowing down to a leisurely stroll, he studied the collection of buildings that made up the academy. The wards weren’t the only thing that was upgraded; the whole place looked… prettified, for a lack of a better term. Every building was freshly painted, the old brick road was replaced by a much more colorful one, the flower patches were in full bloom, and the small fountain that hadn’t worked for years was suddenly functional.\n\n“Wonder what that’s all about,” he mumbled.\n\nAfter a few minutes of contemplation, he decided he didn’t care much. He would find out sooner or later, if it was of any importance.\n\nThe administration building was, predictably, mostly empty of students. Most of them took shelter from the rain instead of pressing on like Zorian, and those that didn’t often didn’t live on academy grounds and thus had no reason to come here today. That was perfect as far as Zorian was concerned, as it meant he could be done here quickly.\n\n‘Quickly’ turned out to be a relative term – it took two hours of wrangling with the girl working at the administration desk before he had taken care of all the necessary paperwork. He asked about his class schedule, but was told it wasn’t finalized yet and that he would have to wait until Monday morning. Come to think of it, Ilsa had mentioned the same thing. Before he left, the girl gave him a book of rules with which third-year students were expected to familiarize themselves before sending him on his way. Zorian idly flipped through the rule book while he searched for room 115, before putting it into one of the more obscure compartments in his backpack, never to be looked at again.\n\nAcademy-provided housing was pretty terrible, and Zorian had had very unpleasant experiences with it, but it was free and apartment space was severely overpriced in Cyoria. Even children of nobles often lived on academy grounds rather than in their own apartments, so who was he to complain? Besides, living so close to the lecture hall cut down on the travel time each morning and put him close to the biggest library in the city, so there were definitely good sides to it.\n\nAn hour later, he smiled to himself as he entered a fairly spacious room. He was even more pleased when he realized he had his own bathroom. With a shower stall, no less! It was a welcome change from having to share a cramped little room with an inconsiderate roommate and sharing a single communal bathroom with the whole floor. As far as furniture went, the room had a bed, a closet, a set of drawers, a work desk, and a chair. Everything Zorian needed, really.\n\nDropping his luggage on the floor, Zorian changed out of his wet clothes before collapsing on the bed with relief. He had two whole days before the classes started, so he decided to postpone unpacking until tomorrow. Instead he remained motionless on the bed, wondering for a moment why he couldn’t hear the raindrops hitting the glass plane of the window next to his bed, before remembering the rain barrier.\n\n“I’ve got to learn how to cast that,” he mumbled.\n\nHis spell collection was extremely limited at the moment, consisting of about 20 simple spells, but he had plans to rectify that this year. As a certified first circle mage, he had access to parts of the academy library he didn’t before, and he planned on raiding them for spells contained within. Besides, this year’s classes were supposed to be much more focused on practical spellcasting now that they’d proven themselves capable, so he should be learning plenty of interesting things in class too.\n\nTired from the long journey, Zorian closed his eyes, intending to take a short nap. He wouldn’t wake up until tomorrow morning.",
            "content_hash": "0f08882c8fbee399175cbe72c2444d4888616268dc5dd0d7e5af6c615cd99262",
            "content_length": 43277,
            "created_at": "2025-11-29T19:35:33.382214",
            "updated_at": "2025-11-29T19:35:33.382214",
            "last_synced_at": null,
            "comments": [
                {
                    "comment_id": "1897189",
                    "username": "Fourthwall",
                    "comment_text": "Huh, MoL on RR?",
                    "timestamp": "2018-10-28T21:35:24.0000000+00:00",
                    "replies": [
                        {
                            "comment_id": "2858329",
                            "username": "DonkeyKong",
                            "comment_text": "Just read the final chapter 106. Damn what an amazing ride it was.",
                            "timestamp": "2020-02-02T23:26:17.0000000+00:00",
                            "replies": [
                                {
                                    "comment_id": "2889389",
                                    "username": "justAnotherSimp",
                                    "comment_text": "Re-reading this after the epilogue",
                                    "timestamp": "2020-02-14T18:04:08.0000000+00:00",
                                    "replies": []
                                },
                                {
                                    "comment_id": "3664478",
                                    "username": "deMICASAPARAELMUNDO",
                                    "comment_text": "",
                                    "timestamp": "2020-10-15T22:36:56.0000000+00:00",
                                    "replies": []
                                },
                                {
                                    "comment_id": "4581844",
                                    "username": "Zaerquin",
                                    "comment_text": "Once more unto the breach",
                                    "timestamp": "2021-05-15T03:00:47.0000000+00:00",
                                    "replies": []
                                },
                                {
                                    "comment_id": "5591399",
                                    "username": "[Deleted]",
                                    "comment_text": "[Account Deleted]",
                                    "timestamp": "2021-12-20T01:21:42.0000000+00:00",
                                    "replies": []
                                },
                                {
                                    "comment_id": "5789863",
                                    "username": "DMS",
                                    "comment_text": "Re-reading for the third time!!!",
                                    "timestamp": "2022-01-29T22:52:51.0000000+00:00",
                                    "replies": []
                                },
                                {
                                    "comment_id": "8699339",
                                    "username": "W Anchor",
                                    "comment_text": "It really was",
                                    "timestamp": "2023-05-18T16:58:30.0000000+00:00",
                                    "replies": []
                                },
                                {
                                    "comment_id": "9751340",
                                    "username": "Luke Scheffe",
                                    "comment_text": "Finally time for my third reread.",
                                    "timestamp": "2023-09-18T22:45:46.0000000+00:00",
                                    "replies": []
                                },
                                {
                                    "comment_id": "12351764",
                                    "username": "TimeEmperor82",
                                    "comment_text": "Fourth for me!",
                                    "timestamp": "2024-06-18T18:31:42.0000000+00:00",
                                    "replies": []
                                },
                                {
                                    "comment_id": "13422795",
                                    "username": "SupremeDao",
                                    "comment_text": "first for me, I came because everyone is praising it",
                                    "timestamp": "2024-09-29T01:01:29.0000000+00:00",
                                    "replies": []
                                },
                                {
                                    "comment_id": "13436466",
                                    "username": "TimeEmperor82",
                                    "comment_text": "nice",
                                    "timestamp": "2024-09-30T15:04:58.0000000+00:00",
                                    "replies": []
                                },
                                {
                                    "comment_id": "13639165",
                                    "username": "Thecafterx1204",
                                    "comment_text": "Rookie numbers 5th time",
                                    "timestamp": "2024-10-19T17:13:17.0000000+00:00",
                                    "replies": []
                                },
                                {
                                    "comment_id": "13668684",
                                    "username": "TimeEmperor82",
                                    "comment_text": "Only 5 . . . I've read it about 794, 454, 914, 023, 004 times!",
                                    "timestamp": "2024-10-22T14:10:51.0000000+00:00",
                                    "replies": []
                                },
                                {
                                    "comment_id": "13798049",
                                    "username": "Cheslyn ofori",
                                    "comment_text": "Same here",
                                    "timestamp": "2024-11-03T08:13:32.0000000+00:00",
                                    "replies": []
                                },
                                {
                                    "comment_id": "14293304",
                                    "username": "pudovkin",
                                    "comment_text": "veli nice",
                                    "timestamp": "2024-12-18T20:42:29.0000000+00:00",
                                    "replies": []
                                },
                                {
                                    "comment_id": "17098764",
                                    "username": "Nots_Lights",
                                    "comment_text": "I’m new :)",
                                    "timestamp": "2025-08-10T21:06:44.0000000+00:00",
                                    "replies": []
                                },
                                {
                                    "comment_id": "17398516",
                                    "username": "bokeuowow",
                                    "comment_text": "Same here",
                                    "timestamp": "2025-09-02T06:42:08.0000000+00:00",
                                    "replies": []
                                },
                                {
                                    "comment_id": "18308533",
                                    "username": "LumberTheJack",
                                    "comment_text": "I am on chapter 0 havent even started",
                                    "timestamp": "2025-11-09T23:30:14.0000000+00:00",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "comment_id": "2889389",
                            "username": "justAnotherSimp",
                            "comment_text": "Re-reading this after the epilogue",
                            "timestamp": "2020-02-14T18:04:08.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "3664478",
                            "username": "deMICASAPARAELMUNDO",
                            "comment_text": "",
                            "timestamp": "2020-10-15T22:36:56.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "4581844",
                            "username": "Zaerquin",
                            "comment_text": "Once more unto the breach",
                            "timestamp": "2021-05-15T03:00:47.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "5591399",
                            "username": "[Deleted]",
                            "comment_text": "[Account Deleted]",
                            "timestamp": "2021-12-20T01:21:42.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "5789863",
                            "username": "DMS",
                            "comment_text": "Re-reading for the third time!!!",
                            "timestamp": "2022-01-29T22:52:51.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "8699339",
                            "username": "W Anchor",
                            "comment_text": "It really was",
                            "timestamp": "2023-05-18T16:58:30.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "9751340",
                            "username": "Luke Scheffe",
                            "comment_text": "Finally time for my third reread.",
                            "timestamp": "2023-09-18T22:45:46.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "12351764",
                            "username": "TimeEmperor82",
                            "comment_text": "Fourth for me!",
                            "timestamp": "2024-06-18T18:31:42.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "13422795",
                            "username": "SupremeDao",
                            "comment_text": "first for me, I came because everyone is praising it",
                            "timestamp": "2024-09-29T01:01:29.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "13436466",
                            "username": "TimeEmperor82",
                            "comment_text": "nice",
                            "timestamp": "2024-09-30T15:04:58.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "13639165",
                            "username": "Thecafterx1204",
                            "comment_text": "Rookie numbers 5th time",
                            "timestamp": "2024-10-19T17:13:17.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "13668684",
                            "username": "TimeEmperor82",
                            "comment_text": "Only 5 . . . I've read it about 794, 454, 914, 023, 004 times!",
                            "timestamp": "2024-10-22T14:10:51.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "13798049",
                            "username": "Cheslyn ofori",
                            "comment_text": "Same here",
                            "timestamp": "2024-11-03T08:13:32.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "14293304",
                            "username": "pudovkin",
                            "comment_text": "veli nice",
                            "timestamp": "2024-12-18T20:42:29.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "17098764",
                            "username": "Nots_Lights",
                            "comment_text": "I’m new :)",
                            "timestamp": "2025-08-10T21:06:44.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "17398516",
                            "username": "bokeuowow",
                            "comment_text": "Same here",
                            "timestamp": "2025-09-02T06:42:08.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "18308533",
                            "username": "LumberTheJack",
                            "comment_text": "I am on chapter 0 havent even started",
                            "timestamp": "2025-11-09T23:30:14.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "3269514",
                            "username": "Endless_calm",
                            "comment_text": "Rereading this.",
                            "timestamp": "2020-06-10T14:32:38.0000000+00:00",
                            "replies": [
                                {
                                    "comment_id": "5501746",
                                    "username": "K5P26",
                                    "comment_text": "Me too buddy",
                                    "timestamp": "2021-11-30T13:44:35.0000000+00:00",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "comment_id": "5501746",
                            "username": "K5P26",
                            "comment_text": "Me too buddy",
                            "timestamp": "2021-11-30T13:44:35.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "3914645",
                            "username": "StormWhiteHd",
                            "comment_text": "Back here for my 4th re read",
                            "timestamp": "2020-12-24T19:14:00.0000000+00:00",
                            "replies": [
                                {
                                    "comment_id": "3997635",
                                    "username": "TEJ",
                                    "comment_text": "Just starting my third reread! Good to see the story is still getting the attention it deserves.",
                                    "timestamp": "2021-01-16T02:09:04.0000000+00:00",
                                    "replies": []
                                },
                                {
                                    "comment_id": "4159205",
                                    "username": "Random Passerby",
                                    "comment_text": "2nd run let's go! It helps when you don't remember anything.",
                                    "timestamp": "2021-02-20T05:42:48.0000000+00:00",
                                    "replies": []
                                },
                                {
                                    "comment_id": "4320568",
                                    "username": "DMS",
                                    "comment_text": "Second read time! Yay!",
                                    "timestamp": "2021-03-26T03:57:05.0000000+00:00",
                                    "replies": []
                                },
                                {
                                    "comment_id": "5783140",
                                    "username": "Yenolam",
                                    "comment_text": "On my 4th reread.",
                                    "timestamp": "2022-01-28T12:15:18.0000000+00:00",
                                    "replies": []
                                },
                                {
                                    "comment_id": "6859475",
                                    "username": "Gary123",
                                    "comment_text": "3rd",
                                    "timestamp": "2022-08-20T22:05:42.0000000+00:00",
                                    "replies": []
                                },
                                {
                                    "comment_id": "6878246",
                                    "username": "OVDC",
                                    "comment_text": "Since no one has done it yet-FIRST LEECH!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
                                    "timestamp": "2022-08-24T03:49:07.0000000+00:00",
                                    "replies": []
                                },
                                {
                                    "comment_id": "15006371",
                                    "username": "TheDerpyDude",
                                    "comment_text": "This is my first time reading MoL and the first thing I'm reading on RR too lul. I haven't read much in quite a while and it feels kinda slow so far, but I have the impression that this story could be worth the journey 👀 :3",
                                    "timestamp": "2025-02-22T07:55:13.0000000+00:00",
                                    "replies": []
                                },
                                {
                                    "comment_id": "15007520",
                                    "username": "TEJ",
                                    "comment_text": "Oh, it certainly is! It's just establishing the start of the time loop, the pace does pick up.",
                                    "timestamp": "2025-02-22T11:15:23.0000000+00:00",
                                    "replies": []
                                },
                                {
                                    "comment_id": "15010771",
                                    "username": "TheDerpyDude",
                                    "comment_text": "Oh okay, that's good to know. I think someone even described the pace as at some point picking up and being like a ladder that shoots up straight into space lol",
                                    "timestamp": "2025-02-22T19:15:16.0000000+00:00",
                                    "replies": []
                                },
                                {
                                    "comment_id": "18429714",
                                    "username": "TEJ",
                                    "comment_text": "Just starting my...5th full reread? 6th? It's been quite a few. :D\n\nI hope you enjoyed reading it a few months ago?",
                                    "timestamp": "2025-11-18T15:34:45.0000000+00:00",
                                    "replies": []
                                },
                                {
                                    "comment_id": "18434822",
                                    "username": "TheDerpyDude",
                                    "comment_text": "Ah yeah quite a few rereads indeed heh. I wasn't super invested in it ig but i did read through it all and it gave me a way to pass the time so that wasn't bad ig :3",
                                    "timestamp": "2025-11-18T21:49:28.0000000+00:00",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "comment_id": "3997635",
                            "username": "TEJ",
                            "comment_text": "Just starting my third reread! Good to see the story is still getting the attention it deserves.",
                            "timestamp": "2021-01-16T02:09:04.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "4159205",
                            "username": "Random Passerby",
                            "comment_text": "2nd run let's go! It helps when you don't remember anything.",
                            "timestamp": "2021-02-20T05:42:48.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "4320568",
                            "username": "DMS",
                            "comment_text": "Second read time! Yay!",
                            "timestamp": "2021-03-26T03:57:05.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "5783140",
                            "username": "Yenolam",
                            "comment_text": "On my 4th reread.",
                            "timestamp": "2022-01-28T12:15:18.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "6859475",
                            "username": "Gary123",
                            "comment_text": "3rd",
                            "timestamp": "2022-08-20T22:05:42.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "6878246",
                            "username": "OVDC",
                            "comment_text": "Since no one has done it yet-FIRST LEECH!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!",
                            "timestamp": "2022-08-24T03:49:07.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "15006371",
                            "username": "TheDerpyDude",
                            "comment_text": "This is my first time reading MoL and the first thing I'm reading on RR too lul. I haven't read much in quite a while and it feels kinda slow so far, but I have the impression that this story could be worth the journey 👀 :3",
                            "timestamp": "2025-02-22T07:55:13.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "15007520",
                            "username": "TEJ",
                            "comment_text": "Oh, it certainly is! It's just establishing the start of the time loop, the pace does pick up.",
                            "timestamp": "2025-02-22T11:15:23.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "15010771",
                            "username": "TheDerpyDude",
                            "comment_text": "Oh okay, that's good to know. I think someone even described the pace as at some point picking up and being like a ladder that shoots up straight into space lol",
                            "timestamp": "2025-02-22T19:15:16.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "18429714",
                            "username": "TEJ",
                            "comment_text": "Just starting my...5th full reread? 6th? It's been quite a few. :D\n\nI hope you enjoyed reading it a few months ago?",
                            "timestamp": "2025-11-18T15:34:45.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "18434822",
                            "username": "TheDerpyDude",
                            "comment_text": "Ah yeah quite a few rereads indeed heh. I wasn't super invested in it ig but i did read through it all and it gave me a way to pass the time so that wasn't bad ig :3",
                            "timestamp": "2025-11-18T21:49:28.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "8433692",
                            "username": "Moonlit Dragon",
                            "comment_text": "First.",
                            "timestamp": "2023-04-16T09:20:33.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "8970828",
                            "username": "ChasedDraco",
                            "comment_text": "Reading for the first ever time!",
                            "timestamp": "2023-06-19T03:56:54.0000000+00:00",
                            "replies": [
                                {
                                    "comment_id": "9310589",
                                    "username": "Shuuragksh",
                                    "comment_text": "I'm reading it the second time now and there are a ton of little hints and scenes that I ignored and / or didn't understand. So many foreshadowing gems.",
                                    "timestamp": "2023-07-28T20:29:21.0000000+00:00",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "comment_id": "9310589",
                            "username": "Shuuragksh",
                            "comment_text": "I'm reading it the second time now and there are a ton of little hints and scenes that I ignored and / or didn't understand. So many foreshadowing gems.",
                            "timestamp": "2023-07-28T20:29:21.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "12117095",
                            "username": "Aashray Juneja",
                            "comment_text": "I'm rereading and just noticed that there were mage and mana ranks. Did I miss it throughout the story or was the idea of ranks just dropped?",
                            "timestamp": "2024-05-27T09:51:43.0000000+00:00",
                            "replies": [
                                {
                                    "comment_id": "15479462",
                                    "username": "mysterioustale",
                                    "comment_text": "saame saame",
                                    "timestamp": "2025-04-03T06:24:15.0000000+00:00",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "comment_id": "15479462",
                            "username": "mysterioustale",
                            "comment_text": "saame saame",
                            "timestamp": "2025-04-03T06:24:15.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "12176933",
                            "username": "hidden.artist",
                            "comment_text": "This is the first web novel I’m reading after coming on this website ,and after reading a bit I thought ‘why are the chapters so long ,this will take me years to finish ,and my web novel is like 5 pages a chapter ,damn this is embarrassing, actually how long should a chapter be? And also @forthwall I did not understand your comment",
                            "timestamp": "2024-06-01T16:20:23.0000000+00:00",
                            "replies": [
                                {
                                    "comment_id": "14429681",
                                    "username": "Maedreas",
                                    "comment_text": "This isn't your usual internet novel\n\nThe chpater length is similar to hard cover books, quality too\n\nRereading again, this is always such a treat\n\nHope you enjoyed it too",
                                    "timestamp": "2025-01-01T23:59:09.0000000+00:00",
                                    "replies": []
                                },
                                {
                                    "comment_id": "14694292",
                                    "username": "hidden.artist",
                                    "comment_text": "K thanks",
                                    "timestamp": "2025-01-25T20:11:42.0000000+00:00",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "comment_id": "14429681",
                            "username": "Maedreas",
                            "comment_text": "This isn't your usual internet novel\n\nThe chpater length is similar to hard cover books, quality too\n\nRereading again, this is always such a treat\n\nHope you enjoyed it too",
                            "timestamp": "2025-01-01T23:59:09.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "14694292",
                            "username": "hidden.artist",
                            "comment_text": "K thanks",
                            "timestamp": "2025-01-25T20:11:42.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "16241409",
                            "username": "Sanexus",
                            "comment_text": "We’re back! Re-re-re-reading again YeeeeeY!\nPs: little shoutout to ‘the years of Apocalypse’ because I’m back here from reading that Loop story! Haha",
                            "timestamp": "2025-06-04T14:19:56.0000000+00:00",
                            "replies": []
                        }
                    ]
                },
                {
                    "comment_id": "1897192",
                    "username": "Staff02",
                    "comment_text": "Note from the staff: We've confirmed that this is the actual author.",
                    "timestamp": "2018-10-28T21:35:57.0000000+00:00",
                    "replies": [
                        {
                            "comment_id": "1897193",
                            "username": "Adurna",
                            "comment_text": "Thanks! Was just about to ask!",
                            "timestamp": "2018-10-28T21:38:24.0000000+00:00",
                            "replies": [
                                {
                                    "comment_id": "1897195",
                                    "username": "ForrestStaley",
                                    "comment_text": "That was my first thought as well.",
                                    "timestamp": "2018-10-28T21:39:03.0000000+00:00",
                                    "replies": []
                                },
                                {
                                    "comment_id": "1897196",
                                    "username": "Augustus",
                                    "comment_text": "Indeed I was worried as well.",
                                    "timestamp": "2018-10-28T21:40:42.0000000+00:00",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "comment_id": "1897195",
                            "username": "ForrestStaley",
                            "comment_text": "That was my first thought as well.",
                            "timestamp": "2018-10-28T21:39:03.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "1897196",
                            "username": "Augustus",
                            "comment_text": "Indeed I was worried as well.",
                            "timestamp": "2018-10-28T21:40:42.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "10697028",
                            "username": "Jolly Tack",
                            "comment_text": "That's good to know!",
                            "timestamp": "2024-01-06T07:54:04.0000000+00:00",
                            "replies": []
                        }
                    ]
                },
                {
                    "comment_id": "1897202",
                    "username": "Mirrored",
                    "comment_text": "Honestly, I always thought it was weird how MoL was only on Fictionpress. I'm glad the author is making his work more available. Though at his point it seems like he should self publish on Amazon. I'd guess his story is already 90% done.",
                    "timestamp": "2018-10-28T21:47:38.0000000+00:00",
                    "replies": [
                        {
                            "comment_id": "1897282",
                            "username": "nobody103",
                            "comment_text": "I'm delaying actual publishing until the story is completely done. After that, I will look into it.",
                            "timestamp": "2018-10-28T22:56:20.0000000+00:00",
                            "replies": [
                                {
                                    "comment_id": "1908251",
                                    "username": "jonf",
                                    "comment_text": "Will it get taken down after you publish it?",
                                    "timestamp": "2018-11-04T17:18:15.0000000+00:00",
                                    "replies": []
                                },
                                {
                                    "comment_id": "1908300",
                                    "username": "nobody103",
                                    "comment_text": "No.",
                                    "timestamp": "2018-11-04T17:50:53.0000000+00:00",
                                    "replies": []
                                },
                                {
                                    "comment_id": "1943095",
                                    "username": "Jacksaun",
                                    "comment_text": "Yeeeeeesshhggggggghhhshehvgsgg THANKKKK YOUUUU",
                                    "timestamp": "2018-11-26T17:48:25.0000000+00:00",
                                    "replies": []
                                },
                                {
                                    "comment_id": "1988714",
                                    "username": "Arad",
                                    "comment_text": "That makes me want to buy it more.",
                                    "timestamp": "2018-12-22T09:43:46.0000000+00:00",
                                    "replies": []
                                },
                                {
                                    "comment_id": "2347261",
                                    "username": "WisdomKing",
                                    "comment_text": "YEEEESSSSSSSSSSSSSSSSSSSSSS!!! YOU THE MVP !!, but seriously, thank you",
                                    "timestamp": "2019-06-28T17:54:33.0000000+00:00",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "comment_id": "1908251",
                            "username": "jonf",
                            "comment_text": "Will it get taken down after you publish it?",
                            "timestamp": "2018-11-04T17:18:15.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "1908300",
                            "username": "nobody103",
                            "comment_text": "No.",
                            "timestamp": "2018-11-04T17:50:53.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "1943095",
                            "username": "Jacksaun",
                            "comment_text": "Yeeeeeesshhggggggghhhshehvgsgg THANKKKK YOUUUU",
                            "timestamp": "2018-11-26T17:48:25.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "1988714",
                            "username": "Arad",
                            "comment_text": "That makes me want to buy it more.",
                            "timestamp": "2018-12-22T09:43:46.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "2347261",
                            "username": "WisdomKing",
                            "comment_text": "YEEEESSSSSSSSSSSSSSSSSSSSSS!!! YOU THE MVP !!, but seriously, thank you",
                            "timestamp": "2019-06-28T17:54:33.0000000+00:00",
                            "replies": []
                        }
                    ]
                },
                {
                    "comment_id": "1897232",
                    "username": "j0nn0",
                    "comment_text": "Wait, wut? WHAT?\n\nHoly shit! Welcome to RR. Read yours on that other site, but didn't frequent it. Been meaning to catch up for over a year now. Will be sure to binge read between college work. Keep up the good work and I'm sure you'll blast to trending and top rated in no time.",
                    "timestamp": "2018-10-28T22:10:39.0000000+00:00",
                    "replies": [
                        {
                            "comment_id": "1897291",
                            "username": "nobody103",
                            "comment_text": "Thanks. I'm going to be posting chapter a day until I run out, or at least I intend so, so you should have a regular trickle of chapters to (re)read.",
                            "timestamp": "2018-10-28T23:01:27.0000000+00:00",
                            "replies": []
                        }
                    ]
                },
                {
                    "comment_id": "1897234",
                    "username": "MidnightJayguar",
                    "comment_text": "What's this doing here? nobody103 you dog welcome to RR hope you enjoy your stay.",
                    "timestamp": "2018-10-28T22:11:03.0000000+00:00",
                    "replies": [
                        {
                            "comment_id": "1897288",
                            "username": "nobody103",
                            "comment_text": "I'll be fine, I'm sure. At least until I run out of chapters and people have to wait for a month until they get a new one.  Thanks for the support.",
                            "timestamp": "2018-10-28T22:59:45.0000000+00:00",
                            "replies": []
                        }
                    ]
                },
                {
                    "comment_id": "1897248",
                    "username": "kanadaj",
                    "comment_text": "Welcome to RR, I've heard your story mentioned quite a bit on the chat",
                    "timestamp": "2018-10-28T22:22:35.0000000+00:00",
                    "replies": [
                        {
                            "comment_id": "1897285",
                            "username": "nobody103",
                            "comment_text": "Glad to be here. It was less of a hassle to post the chapters than I thought it would be.",
                            "timestamp": "2018-10-28T22:58:21.0000000+00:00",
                            "replies": [
                                {
                                    "comment_id": "1897516",
                                    "username": "kanadaj",
                                    "comment_text": "We do our best\n\nOn that note, you might want to see if you can get a cover art - at least a temporary one - sorted for your story, considering you became the #1 story on the site within 3 hours of posting your story...\n\n@All artists, if you are a fan of this story, consider this a challenge?",
                                    "timestamp": "2018-10-29T01:55:51.0000000+00:00",
                                    "replies": []
                                },
                                {
                                    "comment_id": "1897920",
                                    "username": "Godslay3r",
                                    "comment_text": "Ionsheep  https://lonsheep.tumblr.com/ made a pretty good looking cover, albeit not 200x300\n\nhttps://66.media.tumblr.com/ec0816aadd7c8606a35a4ab7ebfcd579/tumblr_oe3ckuW5PH1v87lx8o1_1280.jpg",
                                    "timestamp": "2018-10-29T07:39:09.0000000+00:00",
                                    "replies": []
                                },
                                {
                                    "comment_id": "1898145",
                                    "username": "kanadaj",
                                    "comment_text": "That's tricky to resize without stretching badly. Might be better to ask the artist for a 400x600 version",
                                    "timestamp": "2018-10-29T11:54:26.0000000+00:00",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "comment_id": "1897516",
                            "username": "kanadaj",
                            "comment_text": "We do our best\n\nOn that note, you might want to see if you can get a cover art - at least a temporary one - sorted for your story, considering you became the #1 story on the site within 3 hours of posting your story...\n\n@All artists, if you are a fan of this story, consider this a challenge?",
                            "timestamp": "2018-10-29T01:55:51.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "1897920",
                            "username": "Godslay3r",
                            "comment_text": "Ionsheep  https://lonsheep.tumblr.com/ made a pretty good looking cover, albeit not 200x300\n\nhttps://66.media.tumblr.com/ec0816aadd7c8606a35a4ab7ebfcd579/tumblr_oe3ckuW5PH1v87lx8o1_1280.jpg",
                            "timestamp": "2018-10-29T07:39:09.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "1898145",
                            "username": "kanadaj",
                            "comment_text": "That's tricky to resize without stretching badly. Might be better to ask the artist for a 400x600 version",
                            "timestamp": "2018-10-29T11:54:26.0000000+00:00",
                            "replies": []
                        }
                    ]
                },
                {
                    "comment_id": "1897254",
                    "username": "Inslayer",
                    "comment_text": "Holy crap!\n\nIs this a sign I should finally reread?\n\nThere are 60 more chapters since the time I last read your story :p",
                    "timestamp": "2018-10-28T22:27:34.0000000+00:00",
                    "replies": [
                        {
                            "comment_id": "1897897",
                            "username": "humblepeasant",
                            "comment_text": "You haven't reread it yet? dude.......",
                            "timestamp": "2018-10-29T06:55:24.0000000+00:00",
                            "replies": [
                                {
                                    "comment_id": "2190315",
                                    "username": "Inslayer",
                                    "comment_text": "No, I have... I'm waiting for the next chapter like the rest of you guys.",
                                    "timestamp": "2019-04-11T04:03:04.0000000+00:00",
                                    "replies": []
                                },
                                {
                                    "comment_id": "2190523",
                                    "username": "Inslayer",
                                    "comment_text": "You have to reread in order to rewait, so yeah, no.",
                                    "timestamp": "2019-04-11T07:19:28.0000000+00:00",
                                    "replies": []
                                },
                                {
                                    "comment_id": "2190647",
                                    "username": "humblepeasant",
                                    "comment_text": "for immersion, you need to reread this story at the start of every month....",
                                    "timestamp": "2019-04-11T09:28:51.0000000+00:00",
                                    "replies": []
                                },
                                {
                                    "comment_id": "2190652",
                                    "username": "Inslayer",
                                    "comment_text": "Lol, please try to find one such person.",
                                    "timestamp": "2019-04-11T09:34:37.0000000+00:00",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "comment_id": "2190315",
                            "username": "Inslayer",
                            "comment_text": "No, I have... I'm waiting for the next chapter like the rest of you guys.",
                            "timestamp": "2019-04-11T04:03:04.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "2190523",
                            "username": "Inslayer",
                            "comment_text": "You have to reread in order to rewait, so yeah, no.",
                            "timestamp": "2019-04-11T07:19:28.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "2190647",
                            "username": "humblepeasant",
                            "comment_text": "for immersion, you need to reread this story at the start of every month....",
                            "timestamp": "2019-04-11T09:28:51.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "2190652",
                            "username": "Inslayer",
                            "comment_text": "Lol, please try to find one such person.",
                            "timestamp": "2019-04-11T09:34:37.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "1897923",
                            "username": "VertSang1",
                            "comment_text": "you crazy??? damn, i'm envious.",
                            "timestamp": "2018-10-29T07:41:52.0000000+00:00",
                            "replies": [
                                {
                                    "comment_id": "1898062",
                                    "username": "Inslayer",
                                    "comment_text": "Heh, things happened and I forgot about it. I did introduce my brother to the story though, and he read far ahead from me, so that's something if it counts.",
                                    "timestamp": "2018-10-29T10:21:20.0000000+00:00",
                                    "replies": []
                                },
                                {
                                    "comment_id": "1925916",
                                    "username": "MeisterJohnny",
                                    "comment_text": "And I haven't read beyond Chapter 1 yet, muhahahahaha. I look forward to finally read it",
                                    "timestamp": "2018-11-15T10:32:20.0000000+00:00",
                                    "replies": []
                                },
                                {
                                    "comment_id": "1926030",
                                    "username": "Inslayer",
                                    "comment_text": "Υοu really should.\n\nIt's definitely a crazy crazy roller-coaster :p",
                                    "timestamp": "2018-11-15T13:01:33.0000000+00:00",
                                    "replies": []
                                },
                                {
                                    "comment_id": "1951416",
                                    "username": "VertSang1",
                                    "comment_text": "crazy crazy crazy crazy crazy, there is not enough crazy in that sentence!\n\nthis novel is an hell of a ride and is one of the best free novel you can find on the web. Actually, i expect this to be published and put in library soon after the end because the quality is not far from well known autors and the story itself hold a candle to anything you can find in fantasy, even the best.",
                                    "timestamp": "2018-12-01T05:10:14.0000000+00:00",
                                    "replies": []
                                },
                                {
                                    "comment_id": "4392022",
                                    "username": "idaalexander",
                                    "comment_text": "Can't wait!! 😍",
                                    "timestamp": "2021-04-08T21:03:07.0000000+00:00",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "comment_id": "1898062",
                            "username": "Inslayer",
                            "comment_text": "Heh, things happened and I forgot about it. I did introduce my brother to the story though, and he read far ahead from me, so that's something if it counts.",
                            "timestamp": "2018-10-29T10:21:20.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "1925916",
                            "username": "MeisterJohnny",
                            "comment_text": "And I haven't read beyond Chapter 1 yet, muhahahahaha. I look forward to finally read it",
                            "timestamp": "2018-11-15T10:32:20.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "1926030",
                            "username": "Inslayer",
                            "comment_text": "Υοu really should.\n\nIt's definitely a crazy crazy roller-coaster :p",
                            "timestamp": "2018-11-15T13:01:33.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "1951416",
                            "username": "VertSang1",
                            "comment_text": "crazy crazy crazy crazy crazy, there is not enough crazy in that sentence!\n\nthis novel is an hell of a ride and is one of the best free novel you can find on the web. Actually, i expect this to be published and put in library soon after the end because the quality is not far from well known autors and the story itself hold a candle to anything you can find in fantasy, even the best.",
                            "timestamp": "2018-12-01T05:10:14.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "4392022",
                            "username": "idaalexander",
                            "comment_text": "Can't wait!! 😍",
                            "timestamp": "2021-04-08T21:03:07.0000000+00:00",
                            "replies": []
                        }
                    ]
                },
                {
                    "comment_id": "1897262",
                    "username": "Skoonting",
                    "comment_text": "Hold the fucking phone, MoL on royalroadl? Good shit, hopefully a bunch of new readers get to read it",
                    "timestamp": "2018-10-28T22:34:39.0000000+00:00",
                    "replies": [
                        {
                            "comment_id": "1898790",
                            "username": "Venior",
                            "comment_text": "As someone who has never heard of MoL, I've added this to my bookmarks to read soon.\n\nThe fans' love and interest has really excited me, so I should join the cult soon enough.",
                            "timestamp": "2018-10-29T19:59:16.0000000+00:00",
                            "replies": [
                                {
                                    "comment_id": "1898883",
                                    "username": "Stormblessed",
                                    "comment_text": "Neither have I, but when I saw it in the #1 position and the crazy score it has, I was like \"MUST READ!\".",
                                    "timestamp": "2018-10-29T21:10:13.0000000+00:00",
                                    "replies": []
                                },
                                {
                                    "comment_id": "1974277",
                                    "username": "Luke Scheffe",
                                    "comment_text": "I hadn't heard of it, and I tried to hold off, but I couldn't resist any longer. Curse me! I'll have to wait for 2 more months for the remaining chapters.",
                                    "timestamp": "2018-12-13T22:30:03.0000000+00:00",
                                    "replies": []
                                },
                                {
                                    "comment_id": "1974470",
                                    "username": "Skoonting",
                                    "comment_text": "You just reading on RR? Because it's way ahead on fictionpress, so if you want more, you should read it there",
                                    "timestamp": "2018-12-14T00:31:48.0000000+00:00",
                                    "replies": []
                                },
                                {
                                    "comment_id": "1974688",
                                    "username": "Luke Scheffe",
                                    "comment_text": "doing this on a school-issued computer, and it seems to think that it needs to block the site. (technically, it doesn't send me to the blocked page, it just sends me to the error page saying \"the connection's been reset\") I really hate just how much I'm probably missing out on due to the school's paranoia",
                                    "timestamp": "2018-12-14T03:33:26.0000000+00:00",
                                    "replies": []
                                },
                                {
                                    "comment_id": "1975558",
                                    "username": "Stormblessed",
                                    "comment_text": "I fell to the temptation and went to read everything at fictionpress xd",
                                    "timestamp": "2018-12-14T17:14:18.0000000+00:00",
                                    "replies": []
                                },
                                {
                                    "comment_id": "3259733",
                                    "username": "Purple Perplexing Pineapples",
                                    "comment_text": "Pro tip- put the url into google translate, unless your school blocks google it cant block anything",
                                    "timestamp": "2020-06-07T08:37:12.0000000+00:00",
                                    "replies": []
                                },
                                {
                                    "comment_id": "4155888",
                                    "username": "Koinah",
                                    "comment_text": "Wow thanks for the info! Gonna do just that!",
                                    "timestamp": "2021-02-19T16:13:42.0000000+00:00",
                                    "replies": []
                                },
                                {
                                    "comment_id": "6878237",
                                    "username": "OVDC",
                                    "comment_text": "School computers suck",
                                    "timestamp": "2022-08-24T03:45:25.0000000+00:00",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "comment_id": "1898883",
                            "username": "Stormblessed",
                            "comment_text": "Neither have I, but when I saw it in the #1 position and the crazy score it has, I was like \"MUST READ!\".",
                            "timestamp": "2018-10-29T21:10:13.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "1974277",
                            "username": "Luke Scheffe",
                            "comment_text": "I hadn't heard of it, and I tried to hold off, but I couldn't resist any longer. Curse me! I'll have to wait for 2 more months for the remaining chapters.",
                            "timestamp": "2018-12-13T22:30:03.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "1974470",
                            "username": "Skoonting",
                            "comment_text": "You just reading on RR? Because it's way ahead on fictionpress, so if you want more, you should read it there",
                            "timestamp": "2018-12-14T00:31:48.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "1974688",
                            "username": "Luke Scheffe",
                            "comment_text": "doing this on a school-issued computer, and it seems to think that it needs to block the site. (technically, it doesn't send me to the blocked page, it just sends me to the error page saying \"the connection's been reset\") I really hate just how much I'm probably missing out on due to the school's paranoia",
                            "timestamp": "2018-12-14T03:33:26.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "1975558",
                            "username": "Stormblessed",
                            "comment_text": "I fell to the temptation and went to read everything at fictionpress xd",
                            "timestamp": "2018-12-14T17:14:18.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "3259733",
                            "username": "Purple Perplexing Pineapples",
                            "comment_text": "Pro tip- put the url into google translate, unless your school blocks google it cant block anything",
                            "timestamp": "2020-06-07T08:37:12.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "4155888",
                            "username": "Koinah",
                            "comment_text": "Wow thanks for the info! Gonna do just that!",
                            "timestamp": "2021-02-19T16:13:42.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "6878237",
                            "username": "OVDC",
                            "comment_text": "School computers suck",
                            "timestamp": "2022-08-24T03:45:25.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "2018749",
                            "username": "DragonJr",
                            "comment_text": "Is anyone else bothered by the fact we don't know how most of the characters look like? I mean the facial feature specifically.",
                            "timestamp": "2019-01-07T16:38:46.0000000+00:00",
                            "replies": [
                                {
                                    "comment_id": "7203127",
                                    "username": "OVDC",
                                    "comment_text": "@DragonJr,\n\nNo. I've read multiple good books like that.",
                                    "timestamp": "2022-10-18T18:59:59.0000000+00:00",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "comment_id": "7203127",
                            "username": "OVDC",
                            "comment_text": "@DragonJr,\n\nNo. I've read multiple good books like that.",
                            "timestamp": "2022-10-18T18:59:59.0000000+00:00",
                            "replies": []
                        }
                    ]
                },
                {
                    "comment_id": "1897277",
                    "username": "Qanelin",
                    "comment_text": "Welcome always loved your story",
                    "timestamp": "2018-10-28T22:48:07.0000000+00:00",
                    "replies": [
                        {
                            "comment_id": "1897283",
                            "username": "nobody103",
                            "comment_text": "Thanks!",
                            "timestamp": "2018-10-28T22:57:17.0000000+00:00",
                            "replies": []
                        }
                    ]
                },
                {
                    "comment_id": "1897298",
                    "username": "KNMNL",
                    "comment_text": "While it likely won't stay there, MoL has already hit the #1 spot on the best rated list!. (Potentially Temporary) Congrats!\n\nEdit: Well, I stand corrected. MoL is still standing strong atop the best rated list. I've been a patreon supporter for years and I knew this story was great, but I was surprised at the instant reception here at RRL. Congrats again!",
                    "timestamp": "2018-10-28T23:08:50.0000000+00:00",
                    "replies": [
                        {
                            "comment_id": "5697354",
                            "username": "Wreaver",
                            "comment_text": "And it still stands years later.",
                            "timestamp": "2022-01-12T14:22:24.0000000+00:00",
                            "replies": [
                                {
                                    "comment_id": "8502104",
                                    "username": "Combat Librarian",
                                    "comment_text": "Still at the top! Time for a reread. I do love a good time-loop, and this has to be the best I have seen.",
                                    "timestamp": "2023-04-24T23:07:40.0000000+00:00",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "comment_id": "8502104",
                            "username": "Combat Librarian",
                            "comment_text": "Still at the top! Time for a reread. I do love a good time-loop, and this has to be the best I have seen.",
                            "timestamp": "2023-04-24T23:07:40.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "16356410",
                            "username": "Anish V",
                            "comment_text": "Still here at the top even 6 years later!",
                            "timestamp": "2025-06-13T21:19:44.0000000+00:00",
                            "replies": [
                                {
                                    "comment_id": "16564101",
                                    "username": "LazyEldritchHorror'sRizz",
                                    "comment_text": "I'm starting this rn, anyone got any tips in case it gets a bit boring for me?",
                                    "timestamp": "2025-06-30T23:00:13.0000000+00:00",
                                    "replies": []
                                },
                                {
                                    "comment_id": "16564189",
                                    "username": "Anish V",
                                    "comment_text": "I’m not sure what to tell you other than it might get a bit boring at the beginning but will most definitely pay off if you stick with it. Sorry if that was really generic and not that helpful.",
                                    "timestamp": "2025-06-30T23:08:06.0000000+00:00",
                                    "replies": []
                                },
                                {
                                    "comment_id": "16564813",
                                    "username": "LazyEldritchHorror'sRizz",
                                    "comment_text": "I'm at chapter 5 rn and it's actually pretty interesting so I'm excited to see how it turns out.",
                                    "timestamp": "2025-07-01T00:11:04.0000000+00:00",
                                    "replies": []
                                },
                                {
                                    "comment_id": "16564835",
                                    "username": "Anish V",
                                    "comment_text": "Hope you have a great time reading!",
                                    "timestamp": "2025-07-01T00:13:43.0000000+00:00",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "comment_id": "16564101",
                            "username": "LazyEldritchHorror'sRizz",
                            "comment_text": "I'm starting this rn, anyone got any tips in case it gets a bit boring for me?",
                            "timestamp": "2025-06-30T23:00:13.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "16564189",
                            "username": "Anish V",
                            "comment_text": "I’m not sure what to tell you other than it might get a bit boring at the beginning but will most definitely pay off if you stick with it. Sorry if that was really generic and not that helpful.",
                            "timestamp": "2025-06-30T23:08:06.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "16564813",
                            "username": "LazyEldritchHorror'sRizz",
                            "comment_text": "I'm at chapter 5 rn and it's actually pretty interesting so I'm excited to see how it turns out.",
                            "timestamp": "2025-07-01T00:11:04.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "16564835",
                            "username": "Anish V",
                            "comment_text": "Hope you have a great time reading!",
                            "timestamp": "2025-07-01T00:13:43.0000000+00:00",
                            "replies": []
                        }
                    ]
                },
                {
                    "comment_id": "1897300",
                    "username": "DarkD",
                    "comment_text": "How the heck did this shoot up the rankings so fast? I understand that this is an amazingly popular novel and all, but most people on this site have long since read it.",
                    "timestamp": "2018-10-28T23:09:38.0000000+00:00",
                    "replies": [
                        {
                            "comment_id": "1897383",
                            "username": "j0nn0",
                            "comment_text": "Fanbase insta rating, reviewing, following, faving, reading again, etc. He's got a large fanbase. One hour in and he's got 30+ follows, favs, and a sizable number of ratings and reviews. Most fics don't get that til a month into their postings, and that's for the better works on RR.",
                            "timestamp": "2018-10-29T00:09:17.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "1917883",
                            "username": "aedes",
                            "comment_text": "Was wondering that myself. I don't read other sites so much but I'm glad this one is here and personally think it's very good. Having read mostly all the 1st and 2nd page top rank active stories I believe this one deserves the spot at least in the top 5.",
                            "timestamp": "2018-11-10T13:49:07.0000000+00:00",
                            "replies": []
                        }
                    ]
                },
                {
                    "comment_id": "1897305",
                    "username": "Ansraer",
                    "comment_text": "Welcome to RR!",
                    "timestamp": "2018-10-28T23:13:30.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "1897893",
                    "username": "humblepeasant",
                    "comment_text": "Yep, now that MoL is here, im going to reread it for the 8th time...",
                    "timestamp": "2018-10-29T06:51:09.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "1897925",
                    "username": "VertSang1",
                    "comment_text": "that feel weird to see this story here xD hope new readers will read this pearl. if there is a story deserving the top 1, this is it",
                    "timestamp": "2018-10-29T07:43:24.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "1898059",
                    "username": "SlimeAction",
                    "comment_text": "Wow.... I remember this. I just not remember where I read it so I never get to follow it again. Thanks for bringging it here.",
                    "timestamp": "2018-10-29T10:18:29.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "1898205",
                    "username": "kal26",
                    "comment_text": "Author, mol is one of the few well articulated stories in web. Happy to have you here. Now we can interact with you.",
                    "timestamp": "2018-10-29T12:46:08.0000000+00:00",
                    "replies": [
                        {
                            "comment_id": "1898505",
                            "username": "nobody103",
                            "comment_text": "Well, you could have always interacted with me. But I get what you mean. Fictionpress never really implemented a good comment system.",
                            "timestamp": "2018-10-29T16:35:12.0000000+00:00",
                            "replies": []
                        }
                    ]
                },
                {
                    "comment_id": "1898447",
                    "username": "CrimsonEclipse18",
                    "comment_text": "Is this really the real author of the Mother of Learning? Like the real, actual, legit author? Nice. Is the actual series over already? Been quite a while since I’ve read it, probably at around chapter 40 or so when I took a break.",
                    "timestamp": "2018-10-29T16:06:56.0000000+00:00",
                    "replies": [
                        {
                            "comment_id": "1898501",
                            "username": "nobody103",
                            "comment_text": "There is still 10-ish or so chapters left before the story ends. But there is already 91 chapters done, so the existing stuff should keep people busy for a while.",
                            "timestamp": "2018-10-29T16:33:02.0000000+00:00",
                            "replies": [
                                {
                                    "comment_id": "1899007",
                                    "username": "CrimsonEclipse18",
                                    "comment_text": "Awesome! Just asking, which chapter was it again when Zorian visited his older brother?",
                                    "timestamp": "2018-10-29T22:51:02.0000000+00:00",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "comment_id": "1899007",
                            "username": "CrimsonEclipse18",
                            "comment_text": "Awesome! Just asking, which chapter was it again when Zorian visited his older brother?",
                            "timestamp": "2018-10-29T22:51:02.0000000+00:00",
                            "replies": []
                        }
                    ]
                },
                {
                    "comment_id": "1898905",
                    "username": "dephyn",
                    "comment_text": "Oh wow, look at the reviews, they said it is a story with clear rules and boundaries. I love it already, i'll start enjoying it.",
                    "timestamp": "2018-10-29T21:26:27.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "1899228",
                    "username": "VeryPeeved",
                    "comment_text": "getting kind of a GrimGrimoire feel from this.",
                    "timestamp": "2018-10-30T02:47:48.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "1899645",
                    "username": "Sydorow",
                    "comment_text": "Woah where did this come from, this story just destroyed the top rankings in one day lmao",
                    "timestamp": "2018-10-30T10:03:38.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "1900034",
                    "username": "Hapki",
                    "comment_text": "A gem among gems. I've never thanked you on Fictionpress since I don't have an account there. But really, thank you dear Author for writing this story.",
                    "timestamp": "2018-10-30T15:47:16.0000000+00:00",
                    "replies": [
                        {
                            "comment_id": "1900408",
                            "username": "nobody103",
                            "comment_text": "No need to thank me for that. I'm happy that something I initially thought would be just a personal vanity project ended up being so popular. It means my taste in stories isn't as shit as I thought it was.",
                            "timestamp": "2018-10-30T21:04:21.0000000+00:00",
                            "replies": [
                                {
                                    "comment_id": "1905572",
                                    "username": "KTnTX",
                                    "comment_text": "I just finished chapter 91 over on fiction press. I loved it. If you publish this on Amazon I will definitely buy it",
                                    "timestamp": "2018-11-03T01:28:35.0000000+00:00",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "comment_id": "1905572",
                            "username": "KTnTX",
                            "comment_text": "I just finished chapter 91 over on fiction press. I loved it. If you publish this on Amazon I will definitely buy it",
                            "timestamp": "2018-11-03T01:28:35.0000000+00:00",
                            "replies": []
                        }
                    ]
                },
                {
                    "comment_id": "1900055",
                    "username": "angarag",
                    "comment_text": "I read like first 20 chapters of MoL on Fiction press and still hadn't caught up chapters after that. last I saw, it had like 90 chapters already. and the chapters are not mediocre sized mind you. I will definitely follow it here. And I believe it will be received well here. At least better than fiction press i think. Afterall there are more readers here than there. or at least it seemed that way to me. Welcome, and welcome.",
                    "timestamp": "2018-10-30T16:02:41.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "1900247",
                    "username": "Endless_calm",
                    "comment_text": "Ok guys, shut-in mode for the next two days.",
                    "timestamp": "2018-10-30T18:55:25.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "1900428",
                    "username": "pedrinho03",
                    "comment_text": "I stopped at chapter 49. Huge and awesome chapters hahaha perhaps I can finish them now? lol",
                    "timestamp": "2018-10-30T21:23:08.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "1901517",
                    "username": "kal26",
                    "comment_text": "Why is there a penguin on the cover art? Any hidden meaning?",
                    "timestamp": "2018-10-31T13:48:35.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "1902811",
                    "username": "Zombie Unicorne",
                    "comment_text": "Ugh. Another unsociable, awkward, introverted, alienated main character in a magical school story for the thousandth time..\n\nI don't really see the big deal or how this opening chapter would ever hook a reader.",
                    "timestamp": "2018-11-01T06:09:53.0000000+00:00",
                    "replies": [
                        {
                            "comment_id": "1906702",
                            "username": "KNMNL",
                            "comment_text": "In general, I agree with you. The angsty, misunderstood teen is boring and overdone. The magical school setting is beyond cliche. However, this story is different. It is the exception that proves the rule.\n\nIn this story, the MC is an unpleasant, whiny teen not because the author wants an excuse to hand out OP gifts and powers, but to set up for the character growth of the protagonist. Instead of the school setting being an example of lazy worldbuilding, it is a small slice of a fully fleshed out world. Yes, the opening chapter doesn't set up a big whammy hook. Rather, it contains an absolute armoury of chekov's guns that are fully taken advantage of by the author.\n\nI fully sympathize with your distaste. I also stop reading stories within one to two chapters if they are cliche-ridden and dull. Yet, I still think that you should give this story a chance. Read the first five chapters. At that point, if you still don't care for it, fair enough. However, I think it's more likely that you will be kicking yourself for potentially missing out on a great story.",
                            "timestamp": "2018-11-03T19:11:30.0000000+00:00",
                            "replies": [
                                {
                                    "comment_id": "1906731",
                                    "username": "Zombie Unicorne",
                                    "comment_text": "Yeah, a whinny, introverted, unsociable loser given a chance to improve themselves(or to fanally find a place and purpose to actually belong) through some plot device or Mcguffin. Seen that, done that.\n\nPlease give me a spoiler or something to disprove what I just said because I wanna give this a chance but if it turns out that he's the usual loser given a chance and purpose and all that wishfullment bullshit then I'm out.\n\nI've read 5 more chapter so far but if this the best this story can do then I'm out.\n\nAt least tell me Zach becomes the MC, he's far more intresting because he is charismatic and sociable despite starting out as incompetent.",
                                    "timestamp": "2018-11-03T19:27:52.0000000+00:00",
                                    "replies": []
                                },
                                {
                                    "comment_id": "1906749",
                                    "username": "KNMNL",
                                    "comment_text": "I can say that Zach becomes a co-protagonist and that there is no wish fulfillment/mcguffin other than the time loop itself.\n\nYou gave it a chance, and you don't like it. Like I said, fair enough. I know from experience that some stories don't click with me and it will be the same with you. Thanks for giving it a shot.",
                                    "timestamp": "2018-11-03T19:40:34.0000000+00:00",
                                    "replies": []
                                },
                                {
                                    "comment_id": "1906771",
                                    "username": "Zombie Unicorne",
                                    "comment_text": "Then the time-loop is the plot device and Mcguffin, otherwise, Zorian would have remained in mediocrity without it. A shame.\n\nAlso a shame that Zach became a second fiddle to that uncharismatic loner.\n\nThx anyway.",
                                    "timestamp": "2018-11-03T19:55:35.0000000+00:00",
                                    "replies": []
                                },
                                {
                                    "comment_id": "1907420",
                                    "username": "Zombie Unicorne",
                                    "comment_text": "Then thats worse! As we all know the loser loner protagonist always comes on top when paired against a far more charismatic chad adversary( which the plot always demands for them to look bad.)\n\nThis is a great shame really, more so than before.",
                                    "timestamp": "2018-11-04T05:11:14.0000000+00:00",
                                    "replies": []
                                },
                                {
                                    "comment_id": "1907438",
                                    "username": "obran",
                                    "comment_text": "Put it this way. Do you like ground hog day. If you like how Bill Murray is an unlikeable shit at the start, but grows as a person as the movie progresses, despite the fact that it is a cliche, you probably will like MoL. If you don’t you won’t.",
                                    "timestamp": "2018-11-04T05:24:56.0000000+00:00",
                                    "replies": []
                                },
                                {
                                    "comment_id": "1907478",
                                    "username": "Zombie Unicorne",
                                    "comment_text": "I like edge of tommorow and groundhog day and not for the reason you've implied.\n\nBoth characters from EoT and GD, were scum, one was a coward(who convinces others to fight his war for him) and the other a asshole(who sees everyone lesser than him) respectively but they were not like Zorian who is a loner, introverted, unsociable, struggling loser, in fact they're the opposite. They were already successful and capable even before they were subjected to thier time-loop, unlike Zorian who is wholey reliant to his time-loop to help him get out of his mediocrity.\n\nI can handle asshole characters growing as better people but I can't stand loser protagonist becoming more than they were, zero to hero, utako loser to a respectable indivivdual(or OP god like susual). Thats just the worse and such cliche should just fizzle out of existences and they are fucking everywhere!\n\nAlso, a big fan of your work! I left that reveiw called \"Finally\" on your Twiced Lived story, mainly to pissed those anime wishfullment and projecting seeker from infecting your grimdark world.",
                                    "timestamp": "2018-11-04T06:15:33.0000000+00:00",
                                    "replies": []
                                },
                                {
                                    "comment_id": "1907541",
                                    "username": "Zombie Unicorne",
                                    "comment_text": "Interesting....but doesn't change the fact that Zorian needed a plot device/Mcguffin to finally bring him out of his self loathing mediocrity and shell.\n\nThat plotline isn't wholey unique, and like I said it's fucking everywhere! Groundhog Day is really a bad analogy becuase that wasn't really what I had trouble with(character development through time-loop), what I had trouble with is that MoL immulates the worse of the anime self wishfullment cliche( I've already gone into depth with that one).\n\nThx for confirming that at least with Zorian and his circumstances.\n\nHow did my Fianlly review made you jump in the discussion?",
                                    "timestamp": "2018-11-04T07:21:42.0000000+00:00",
                                    "replies": []
                                },
                                {
                                    "comment_id": "1907558",
                                    "username": "obran",
                                    "comment_text": "Just recognized your name. I read MoL last week and loved it and was hoping to spread some enthusiasm.",
                                    "timestamp": "2018-11-04T07:34:22.0000000+00:00",
                                    "replies": []
                                },
                                {
                                    "comment_id": "1911653",
                                    "username": "Snorca",
                                    "comment_text": "I can understand your concern about the wish fulfillment being the crux of what leads to character growth, but honestly I don't see Zorian's growth to be caused by the time loop. He used the time loop to improve his skills and make various self improvements without any heed to his personality.\n\nHis lack of sociability was due to his perceived self image that would have improved with time regardless of the time loop or not. It is practically the number one reason of anti-social behaviour. What the time loop gave him was the time needed to build a new perspective without the passage of time affecting the world. Again, he doesn't use the time loop FOR this purpose, it's just an inherent perk of the time loop; similar to how Zach ended up learning more about his own family situation that he too would have found out over time but was given a head start on the research.\n\nI too dislike the many wish fulfillment reincarnation second chance novels that we are getting bombarded with recently, but I can assure you that this isn't one of them. Zorian always felt like his actions were justified initially, but the incredible amount of time he spends forces him to mature and expand his perspective in what feels like an instant to those around him. This leads him to be more sociable and charismatic. He in no way outshines Zach and they are each their own characters with their own flaws and strengths. That's another thing to love about this novel, everyone has a clear limit on what they can and cannot do. I really do hope you continue more, at least until Zach rejoins the story. That's when I felt like a crack addict.",
                                    "timestamp": "2018-11-06T16:20:51.0000000+00:00",
                                    "replies": []
                                },
                                {
                                    "comment_id": "3222570",
                                    "username": "MrPicklesAndTea",
                                    "comment_text": "Comments like these is why I finished this book and never looked back looked back a thousand times thinking \"The first chapters absolutely suck to read, but they are awesome.\"",
                                    "timestamp": "2020-05-26T02:39:11.0000000+00:00",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "comment_id": "1906731",
                            "username": "Zombie Unicorne",
                            "comment_text": "Yeah, a whinny, introverted, unsociable loser given a chance to improve themselves(or to fanally find a place and purpose to actually belong) through some plot device or Mcguffin. Seen that, done that.\n\nPlease give me a spoiler or something to disprove what I just said because I wanna give this a chance but if it turns out that he's the usual loser given a chance and purpose and all that wishfullment bullshit then I'm out.\n\nI've read 5 more chapter so far but if this the best this story can do then I'm out.\n\nAt least tell me Zach becomes the MC, he's far more intresting because he is charismatic and sociable despite starting out as incompetent.",
                            "timestamp": "2018-11-03T19:27:52.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "1906749",
                            "username": "KNMNL",
                            "comment_text": "I can say that Zach becomes a co-protagonist and that there is no wish fulfillment/mcguffin other than the time loop itself.\n\nYou gave it a chance, and you don't like it. Like I said, fair enough. I know from experience that some stories don't click with me and it will be the same with you. Thanks for giving it a shot.",
                            "timestamp": "2018-11-03T19:40:34.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "1906771",
                            "username": "Zombie Unicorne",
                            "comment_text": "Then the time-loop is the plot device and Mcguffin, otherwise, Zorian would have remained in mediocrity without it. A shame.\n\nAlso a shame that Zach became a second fiddle to that uncharismatic loner.\n\nThx anyway.",
                            "timestamp": "2018-11-03T19:55:35.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "1907420",
                            "username": "Zombie Unicorne",
                            "comment_text": "Then thats worse! As we all know the loser loner protagonist always comes on top when paired against a far more charismatic chad adversary( which the plot always demands for them to look bad.)\n\nThis is a great shame really, more so than before.",
                            "timestamp": "2018-11-04T05:11:14.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "1907438",
                            "username": "obran",
                            "comment_text": "Put it this way. Do you like ground hog day. If you like how Bill Murray is an unlikeable shit at the start, but grows as a person as the movie progresses, despite the fact that it is a cliche, you probably will like MoL. If you don’t you won’t.",
                            "timestamp": "2018-11-04T05:24:56.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "1907478",
                            "username": "Zombie Unicorne",
                            "comment_text": "I like edge of tommorow and groundhog day and not for the reason you've implied.\n\nBoth characters from EoT and GD, were scum, one was a coward(who convinces others to fight his war for him) and the other a asshole(who sees everyone lesser than him) respectively but they were not like Zorian who is a loner, introverted, unsociable, struggling loser, in fact they're the opposite. They were already successful and capable even before they were subjected to thier time-loop, unlike Zorian who is wholey reliant to his time-loop to help him get out of his mediocrity.\n\nI can handle asshole characters growing as better people but I can't stand loser protagonist becoming more than they were, zero to hero, utako loser to a respectable indivivdual(or OP god like susual). Thats just the worse and such cliche should just fizzle out of existences and they are fucking everywhere!\n\nAlso, a big fan of your work! I left that reveiw called \"Finally\" on your Twiced Lived story, mainly to pissed those anime wishfullment and projecting seeker from infecting your grimdark world.",
                            "timestamp": "2018-11-04T06:15:33.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "1907541",
                            "username": "Zombie Unicorne",
                            "comment_text": "Interesting....but doesn't change the fact that Zorian needed a plot device/Mcguffin to finally bring him out of his self loathing mediocrity and shell.\n\nThat plotline isn't wholey unique, and like I said it's fucking everywhere! Groundhog Day is really a bad analogy becuase that wasn't really what I had trouble with(character development through time-loop), what I had trouble with is that MoL immulates the worse of the anime self wishfullment cliche( I've already gone into depth with that one).\n\nThx for confirming that at least with Zorian and his circumstances.\n\nHow did my Fianlly review made you jump in the discussion?",
                            "timestamp": "2018-11-04T07:21:42.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "1907558",
                            "username": "obran",
                            "comment_text": "Just recognized your name. I read MoL last week and loved it and was hoping to spread some enthusiasm.",
                            "timestamp": "2018-11-04T07:34:22.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "1911653",
                            "username": "Snorca",
                            "comment_text": "I can understand your concern about the wish fulfillment being the crux of what leads to character growth, but honestly I don't see Zorian's growth to be caused by the time loop. He used the time loop to improve his skills and make various self improvements without any heed to his personality.\n\nHis lack of sociability was due to his perceived self image that would have improved with time regardless of the time loop or not. It is practically the number one reason of anti-social behaviour. What the time loop gave him was the time needed to build a new perspective without the passage of time affecting the world. Again, he doesn't use the time loop FOR this purpose, it's just an inherent perk of the time loop; similar to how Zach ended up learning more about his own family situation that he too would have found out over time but was given a head start on the research.\n\nI too dislike the many wish fulfillment reincarnation second chance novels that we are getting bombarded with recently, but I can assure you that this isn't one of them. Zorian always felt like his actions were justified initially, but the incredible amount of time he spends forces him to mature and expand his perspective in what feels like an instant to those around him. This leads him to be more sociable and charismatic. He in no way outshines Zach and they are each their own characters with their own flaws and strengths. That's another thing to love about this novel, everyone has a clear limit on what they can and cannot do. I really do hope you continue more, at least until Zach rejoins the story. That's when I felt like a crack addict.",
                            "timestamp": "2018-11-06T16:20:51.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "3222570",
                            "username": "MrPicklesAndTea",
                            "comment_text": "Comments like these is why I finished this book and never looked back looked back a thousand times thinking \"The first chapters absolutely suck to read, but they are awesome.\"",
                            "timestamp": "2020-05-26T02:39:11.0000000+00:00",
                            "replies": []
                        }
                    ]
                },
                {
                    "comment_id": "1908019",
                    "username": "Chiisutofupuru",
                    "comment_text": "Good morning, brother!\n(Never gets old)\n\nI've been a big fan for years and love how you can make a simple spell, like magic missle, a complicated one.\nWhere do you research all this magic to dive into detail like that? *Curious*\n\n~Very much looking forward to a physical book one day~\n\nHaving read the comments of this chapter, it seems you're under a year to finishing it! \\o/\nDo you plan on writng another fiction?",
                    "timestamp": "2018-11-04T14:53:06.0000000+00:00",
                    "replies": [
                        {
                            "comment_id": "1908315",
                            "username": "nobody103",
                            "comment_text": "I just read various fantasy forums, subreddits, and sites. You often find pretty interesting discussions by searching through places like these. Unfortunately, I don't think there is a single place or thread I could point you at, since places where such discusions occur with any regularities are basically non-existant. Anyway, I often save these snippets of discussion when I stumble upon them and then later go through these documents when looking for inspiration. I do this for just about anything that interests me, not just magic. Interesting fantasy monsters and species, worldbuilding projects, etc.\n\nI'll definitely keep writing, it's just a question of what. I have lots of ideas, more than I could actually write up in a lifetime - the main issue is figuring out which ones I have the ability to actually execute in practice, and whether the final product would actually be interesting to anyone.",
                            "timestamp": "2018-11-04T17:59:56.0000000+00:00",
                            "replies": []
                        }
                    ]
                },
                {
                    "comment_id": "1909134",
                    "username": "slatsau",
                    "comment_text": "Love this story so much. Time for a re-read.  (And damn Ch 91 Cliff Hanger!)",
                    "timestamp": "2018-11-05T05:14:00.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "1913930",
                    "username": "Vadelent",
                    "comment_text": "Ahhh, an introvert after my own heart. I like this already.\n\nEven better, it seems the author has either actually done some research into introverts or is one themselves because a lot of the way this kid thinks and acts strikes quite close to home. This little fact alone makes the mc more favorable for me not just because I can sympathize but because he’s not like quite a few other protagonists on this site. By which I mean they’re angsty loners for no good reason or reasons that are shown and then quickly swept under the metaphorical rug.",
                    "timestamp": "2018-11-08T01:02:04.0000000+00:00",
                    "replies": [
                        {
                            "comment_id": "1974307",
                            "username": "Luke Scheffe",
                            "comment_text": "that was my exact thoughts. I almost felt like I had been cloned and put in a story.",
                            "timestamp": "2018-12-13T22:41:38.0000000+00:00",
                            "replies": []
                        }
                    ]
                },
                {
                    "comment_id": "1915543",
                    "username": "Darth_Waffle",
                    "comment_text": "Alright! Great excuse to reread and pick this back up. I'm pretty sure I left off somewhere around chater 70.",
                    "timestamp": "2018-11-08T23:46:15.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "1916640",
                    "username": "A T",
                    "comment_text": "Im loving this story so far! Thanks for the chapter!",
                    "timestamp": "2018-11-09T17:00:38.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "1918246",
                    "username": "soulerlunar",
                    "comment_text": "@nobody103 Are you ever going to publish a physical copy of the book? Because it's probably one of my favorite fantasy stories and I would love to be able to read it in physical form.",
                    "timestamp": "2018-11-10T19:55:01.0000000+00:00",
                    "replies": [
                        {
                            "comment_id": "1918538",
                            "username": "nobody103",
                            "comment_text": "I will look into the possibility once I actually finish the story. I will definitely try, but since it's a massive time sink and potentially very exasperating I don't want to start dealing with it until the story is over.",
                            "timestamp": "2018-11-11T01:10:30.0000000+00:00",
                            "replies": [
                                {
                                    "comment_id": "1984152",
                                    "username": "jacobpaige",
                                    "comment_text": "Well, you could try getting a publisher. Your reputation is likely strong enough that it should be significantly easier than normal, and then they could handle the majority of the non-writing work.",
                                    "timestamp": "2018-12-19T14:53:43.0000000+00:00",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "comment_id": "1984152",
                            "username": "jacobpaige",
                            "comment_text": "Well, you could try getting a publisher. Your reputation is likely strong enough that it should be significantly easier than normal, and then they could handle the majority of the non-writing work.",
                            "timestamp": "2018-12-19T14:53:43.0000000+00:00",
                            "replies": []
                        }
                    ]
                },
                {
                    "comment_id": "1925214",
                    "username": "Killashard",
                    "comment_text": "Thanks for the chapter!",
                    "timestamp": "2018-11-14T21:50:58.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "1943096",
                    "username": "Jacksaun",
                    "comment_text": "Gotta say, might be my teenage angst, but I completely agree with 99% of Zorians thoughts XD. Kirito IS an annoying brat. And the mom makes me angry too XD",
                    "timestamp": "2018-11-26T17:49:35.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "2018744",
                    "username": "DragonJr",
                    "comment_text": "Is anyone else bothered by the fact we don't know how most of the characters look like?",
                    "timestamp": "2019-01-07T16:36:02.0000000+00:00",
                    "replies": [
                        {
                            "comment_id": "3222578",
                            "username": "MrPicklesAndTea",
                            "comment_text": "Personally, I develop a mental image in my head, then end up seeing fanart which ruined my image of that character.",
                            "timestamp": "2020-05-26T02:41:09.0000000+00:00",
                            "replies": []
                        }
                    ]
                },
                {
                    "comment_id": "2028670",
                    "username": "Zemophobia",
                    "comment_text": "Damn, I read this story a loooooong time ago on a different site and then stopped reading because there were no updates.",
                    "timestamp": "2019-01-13T00:06:22.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "2029218",
                    "username": "ILoveAnime",
                    "comment_text": "Damn, you captured essence of angst teenager finely",
                    "timestamp": "2019-01-13T08:34:26.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "2031345",
                    "username": "IsUnavailable",
                    "comment_text": "Thank you for the chapter.",
                    "timestamp": "2019-01-14T14:50:53.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "2046332",
                    "username": "SuperLeno",
                    "comment_text": "I can't help but notice that every character apart from the mc so far has been a girl, seems a little strange. His sister, mother, the academy lady, the girls on the train, the turtle neck girl, the magic girl, then the bike girl. Oh wait, his brother.. I take that all back, but it does still seem a little weird.",
                    "timestamp": "2019-01-22T08:33:26.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "2047482",
                    "username": "alfin",
                    "comment_text": "Here's a typo:\n\n\"He effortlessly tuned out her out.\"",
                    "timestamp": "2019-01-22T23:15:49.0000000+00:00",
                    "replies": [
                        {
                            "comment_id": "2048289",
                            "username": "nobody103",
                            "comment_text": "Fixed. Funny that a typo survived in first chapter up until now, though. That chapter has been gone through dozens of times by now, all by different people.",
                            "timestamp": "2019-01-23T10:43:45.0000000+00:00",
                            "replies": []
                        }
                    ]
                },
                {
                    "comment_id": "2068610",
                    "username": "the philosopher king",
                    "comment_text": "Thanks for writing this chapter. I found some interesting and useful thoughts from reading it.\n\n“Sucks to be you,” was her only answer.\n\nShe must really dislike him! First, he scolded himself for forgetting to create spell defenses to prevent others from entering and for alarming him. This was a good sign that implied his normal routine included setting defenses for himself because of her. Second, she thinks of several ways to keep frustrating him. Her decision to enter and block the bathroom door, then saying the above, it makes me wonder if she thinks she is better than him, or she thinks that he is better than her but wants him to feel lower in the heirarchy. Despite how insignificant the wake-up scene appears to be for future scenes with no clear consequences that I could tell other than speaking with family about the incident, it does a good job establishing the relationship between Kirielle and Zorian, and your word choice was excellent too.",
                    "timestamp": "2019-02-04T09:23:24.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "2069461",
                    "username": "Domini",
                    "comment_text": "Thanks for the chapter.",
                    "timestamp": "2019-02-04T21:53:17.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "2102600",
                    "username": "Sourcream24",
                    "comment_text": "It gives a harry potter vibe with a sister con complex\n\nHate the sister cons",
                    "timestamp": "2019-02-23T15:33:05.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "2110020",
                    "username": "balik2131",
                    "comment_text": "THANKX",
                    "timestamp": "2019-02-27T11:22:57.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "2116829",
                    "username": "kakakaka",
                    "comment_text": "If it's me I'm gonna leave that family.",
                    "timestamp": "2019-03-03T06:42:33.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "2139498",
                    "username": "IqmaL",
                    "comment_text": "Hey I want to make a light novel and I was wondering for a chapter how much page do I need?",
                    "timestamp": "2019-03-15T05:24:30.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "2181480",
                    "username": "PureYoungNobel",
                    "comment_text": "Like this very much👍👍👍",
                    "timestamp": "2019-04-06T02:52:04.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "2412056",
                    "username": "Luckyfuzzball17",
                    "comment_text": "This actually looks really good! However, iv'e only read the first chapter",
                    "timestamp": "2019-07-28T06:52:16.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "2426859",
                    "username": "Hoebagger",
                    "comment_text": "MC is such a jerk to his family. They may be annoying but they’re just trying to love him and be a part of his life.\n\nI look forward to seeing him mature.",
                    "timestamp": "2019-08-02T03:16:03.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "2436892",
                    "username": "the one true cat king",
                    "comment_text": "thanks for the chapter",
                    "timestamp": "2019-08-06T16:23:48.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "2436904",
                    "username": "matt holloway",
                    "comment_text": "Just from reading this first chapter I believe it has helped me with my writing already. I cant say I'll be able to read the whole thing, but I will continue to read as much as I can. Thank you for sharing this story.",
                    "timestamp": "2019-08-06T16:28:01.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "2480956",
                    "username": "FOULdragon",
                    "comment_text": "Hey! He's like Francis, from left 4 dead! He hates things to!",
                    "timestamp": "2019-08-26T02:53:26.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "2487810",
                    "username": "Yokashi",
                    "comment_text": "The sister remains me of my little brother. Always annoying and spoiled, his name is Fire too (In Turkish). I had a dream of a giant red hand in a red fog telling me to name him like this, guess that was demon making his second body for the fall of dead. Maybe he created something, which is even worse then himself. I don't know he is evil and wicked. Smashing a TV with his toys, making my eye bleed because he throwed a toy at me, spreading lego all over the floor so I can't get into my room while he plays switch on MY TV. Locking the door when I'm in so I need to ask him to get out :/",
                    "timestamp": "2019-08-29T09:55:28.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "2530827",
                    "username": "Mister Bill",
                    "comment_text": "Wow. That’s an insanely long first chapter. Kudos.",
                    "timestamp": "2019-09-18T03:38:12.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "2535192",
                    "username": "Macros208",
                    "comment_text": "Ugh hopefully this gets better. Someone recommended this to me so there is hope.",
                    "timestamp": "2019-09-19T22:13:38.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "2554663",
                    "username": "13lack12ose",
                    "comment_text": "Thanks for the chapter! :)",
                    "timestamp": "2019-09-28T00:04:28.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "2558363",
                    "username": "NeoMare",
                    "comment_text": "Interesting beginning",
                    "timestamp": "2019-09-29T20:31:43.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "2576069",
                    "username": "LandUpGaming",
                    "comment_text": "\" “Damn it, Kiri! You had all the time in the world to go to the bathroom before I woke up!”\n\n“Sucks to be you,” was her only answer.\"\n\nAs someone who has a planned time to take a shower every day, and siblings who don't care, I FEEL that.",
                    "timestamp": "2019-10-07T10:50:08.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "2608297",
                    "username": "Figments",
                    "comment_text": "Nice, appreciate the work.",
                    "timestamp": "2019-10-20T05:24:04.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "2664245",
                    "username": "afkcuzbookcool",
                    "comment_text": "Thanks for the chapter.",
                    "timestamp": "2019-11-14T11:50:12.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "2711755",
                    "username": "CarrollCWilson",
                    "comment_text": "Thank you, such a great one chapter !!!!!",
                    "timestamp": "2019-12-05T09:29:38.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "2744532",
                    "username": "DonkeyKong",
                    "comment_text": "Thank you for the Banana chapter.",
                    "timestamp": "2019-12-19T01:25:06.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "2763668",
                    "username": "Aleesia",
                    "comment_text": "Thanks for the story! I never knew you were on royal road as well!",
                    "timestamp": "2019-12-28T14:58:46.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "2863561",
                    "username": "Zarkow",
                    "comment_text": "Thanks for the chapter!",
                    "timestamp": "2020-02-04T23:04:51.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "2876779",
                    "username": "tarakis",
                    "comment_text": "Thanks for the chapter.\n\n:D CHEERS ©",
                    "timestamp": "2020-02-09T22:57:43.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "2896434",
                    "username": "PurpleGloom",
                    "comment_text": "Thanks for the chapter",
                    "timestamp": "2020-02-17T16:47:44.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "2925734",
                    "username": "xchronicles",
                    "comment_text": "Thank you author for bringing it here in RRL. I’ve always heard the praises for this book. Could finally start the journey now that it’s finished",
                    "timestamp": "2020-02-29T03:01:32.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "2943976",
                    "username": "hakatri gin",
                    "comment_text": "Good MC description, his personality is greatly influenced by his age but it also has tinges of truth about his standing on his family, he is passionate about studies and maybe too much but he knows it, a moody teenager who tries hard and likes to self victimize only a little, i like it",
                    "timestamp": "2020-03-07T04:36:15.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "3034410",
                    "username": "ERawls",
                    "comment_text": "Like the intro, waking up to a little sister jumping on you, lol.",
                    "timestamp": "2020-03-31T22:32:36.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "3130477",
                    "username": "Paing",
                    "comment_text": "Thanks for the chapter",
                    "timestamp": "2020-04-29T16:11:41.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "3131717",
                    "username": "[Deleted]",
                    "comment_text": "[Account Deleted]",
                    "timestamp": "2020-04-30T00:26:19.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "3168630",
                    "username": "Mohib Haider97",
                    "comment_text": "He is writting in pragraph thats why it is looking to big otherwise it only 600 words",
                    "timestamp": "2020-05-09T11:43:40.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "3227098",
                    "username": "dommoroz",
                    "comment_text": "I started a reread of this story and it's so fun to notice the things that are going to turn out relevant later. Though I still doubt I noticed them all).\n\nI have a couple of questions about what happened in this chapter.\n\nFirst, I wonder why Zorian was surprised by the teacher's visit. Doesn't he have two older brothers who attended the same academy? They should have gotten a similar visit before their third year and Zorian would have probably witnessed that.\n\nSecond, that walk from the train station to the academy. Does it mean that the city doesn't have any public transport? It seems strange that every student has to take an hour-long track hauling their luggage through the streets. Can't they take a cab or a carriage or whatever?\n\nThat said, I'm so eager for this reread))).",
                    "timestamp": "2020-05-27T18:00:23.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "3240098",
                    "username": "ZapDaddy",
                    "comment_text": "ҬҤДИԞ ЧФЏ ҒФЯ ҐҢԐ ҪҤДPГЭЯ ДЙD ҒФЯ ЧФЏЯ ԐҒӺФЯҐ, ҐӉЄҰ ШЭЯЭ ԠЏҪӉ ԐЍJФЧЄD.",
                    "timestamp": "2020-06-01T06:05:22.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "3259735",
                    "username": "Purple Perplexing Pineapples",
                    "comment_text": "What does that rain barrier do? If it doesn't destroy the rain in some way, it would basically become a waterfall if it covers the whole building (as it seems to be stated)",
                    "timestamp": "2020-06-07T08:39:18.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "3310900",
                    "username": "Green Meteor",
                    "comment_text": "Just found out about this story. I rarely find a protagonist so relatable, let's see where this goes 🌈",
                    "timestamp": "2020-06-22T21:33:36.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "3328123",
                    "username": "KevinADavis",
                    "comment_text": "Enjoying the character interaction.",
                    "timestamp": "2020-06-28T07:05:34.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "3429899",
                    "username": "MyRiad moon",
                    "comment_text": "Here to re-read",
                    "timestamp": "2020-08-01T01:26:52.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "3515144",
                    "username": "ethan walton",
                    "comment_text": "can i get some reputation",
                    "timestamp": "2020-08-29T03:01:51.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "3518499",
                    "username": "Dark Zenith",
                    "comment_text": "Don't really read stuff on this site, but seeing as there's no comments section where I was reading it before... Here I am xD",
                    "timestamp": "2020-08-30T06:29:23.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "3635632",
                    "username": "Isa Lumitus",
                    "comment_text": "Rereading this after completion, it's amazing how much Zorian grew as a person. It also probably says bad things about me that I find the little ball of resentment he is at the beginning to be very identifiable.",
                    "timestamp": "2020-10-06T18:40:21.0000000+00:00",
                    "replies": [
                        {
                            "comment_id": "7371942",
                            "username": "Celes",
                            "comment_text": "Don't worry, we all do. That's what makes us love this story. Noone here is as noble as some other characters! That's why we only watch through Zorian's eyes, as they're our eyes :D",
                            "timestamp": "2022-11-15T19:05:29.0000000+00:00",
                            "replies": []
                        }
                    ]
                },
                {
                    "comment_id": "3651053",
                    "username": "ducksoup",
                    "comment_text": "Well done lad, seems I have a wonderful read ahead",
                    "timestamp": "2020-10-11T17:48:02.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "3655821",
                    "username": "pewpewcachoo",
                    "comment_text": "Thanks for the chapter.",
                    "timestamp": "2020-10-13T05:12:39.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "3741897",
                    "username": "[Deleted]",
                    "comment_text": "[Account Deleted]",
                    "timestamp": "2020-11-07T07:30:44.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "3761766",
                    "username": "Ianaeyore",
                    "comment_text": "And so the journey begins.",
                    "timestamp": "2020-11-12T17:54:07.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "3798328",
                    "username": "Alpha Dreamer",
                    "comment_text": "Reading it for the second time, a lot of things make more sense now",
                    "timestamp": "2020-11-22T03:16:45.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "3812824",
                    "username": "Jesp",
                    "comment_text": "Thanks for the chapter! ^_^",
                    "timestamp": "2020-11-25T21:45:48.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "3829474",
                    "username": "WhiteBirdy",
                    "comment_text": "One of the greatest stories available for free online. I'm glad it's getting noticed by more people now",
                    "timestamp": "2020-11-30T14:15:19.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "3931236",
                    "username": "Sereminar",
                    "comment_text": "Dang, mc is such a jerk, hopefully he grows up :/",
                    "timestamp": "2020-12-30T02:58:32.0000000+00:00",
                    "replies": [
                        {
                            "comment_id": "4085029",
                            "username": "Ashcheul",
                            "comment_text": "Not a jerk, just unsociable. These kinds of people behave pretty well if you don't demand attention from them or drag them ouf of comfort zone.",
                            "timestamp": "2021-02-04T11:27:48.0000000+00:00",
                            "replies": []
                        }
                    ]
                },
                {
                    "comment_id": "3932460",
                    "username": "Errant-Knight",
                    "comment_text": "Hmmm. MC seems pretty annoying and self-centered.....so basically a teenager. Look forward to seeing him develop out of this phase",
                    "timestamp": "2020-12-30T14:57:35.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "3999168",
                    "username": "Xoular_Uaiaam",
                    "comment_text": "Re-reading again 3rd time truly best gem",
                    "timestamp": "2021-01-16T14:45:07.0000000+00:00",
                    "replies": [
                        {
                            "comment_id": "4085031",
                            "username": "Ashcheul",
                            "comment_text": "So this is your third loop? (  ^         ^      )",
                            "timestamp": "2021-02-04T11:28:19.0000000+00:00",
                            "replies": []
                        }
                    ]
                },
                {
                    "comment_id": "4085022",
                    "username": "Ashcheul",
                    "comment_text": "If you read as far as first half of this chapter, this story starts to feel interesting. It evoke and atmosphere of cozy Easter Europe country, I think. Characters are pretty believable, too.",
                    "timestamp": "2021-02-04T11:25:25.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "4159686",
                    "username": "The Mimic slayer",
                    "comment_text": "Thanks for ch",
                    "timestamp": "2021-02-20T09:13:17.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "4192890",
                    "username": "QuantumWorld",
                    "comment_text": "Thanks for the Chapter!",
                    "timestamp": "2021-02-27T08:37:15.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "4388368",
                    "username": "Luke Scheffe",
                    "comment_text": "Thanks for the chapter!!!",
                    "timestamp": "2021-04-08T04:27:04.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "4449209",
                    "username": "Yotro",
                    "comment_text": "hi",
                    "timestamp": "2021-04-19T06:43:23.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "4465841",
                    "username": "Web_Angel",
                    "comment_text": "Thanks for the chapter!",
                    "timestamp": "2021-04-22T04:37:33.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "4465911",
                    "username": "Web_Angel",
                    "comment_text": "Finally, it took me 3 attempts, spread over a couple of months, but I finally finished the first chapter! A rough start, but if the reviews are to be believed one that will pay off.",
                    "timestamp": "2021-04-22T04:59:41.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "4543990",
                    "username": "HeartPiercingSpear",
                    "comment_text": "",
                    "timestamp": "2021-05-07T08:37:13.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "4591644",
                    "username": "MUMUMUATAMU",
                    "comment_text": "Thanks for the chapter😊",
                    "timestamp": "2021-05-17T09:58:31.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "4600086",
                    "username": "GeburaKafka",
                    "comment_text": "Read the whole story, bout to read it again.",
                    "timestamp": "2021-05-19T05:37:36.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "4606649",
                    "username": "Yuuenchi",
                    "comment_text": "Well this is my first venture into MoL, so let's see where we go!",
                    "timestamp": "2021-05-20T18:01:33.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "4642265",
                    "username": "444.EXE",
                    "comment_text": "Thanks for the chapter.",
                    "timestamp": "2021-05-28T20:01:10.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "4937198",
                    "username": "FWAH",
                    "comment_text": "Thanks for the chapter!",
                    "timestamp": "2021-07-30T10:51:06.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "4962084",
                    "username": "Richard Keenan",
                    "comment_text": "Okay have to give a read!",
                    "timestamp": "2021-08-04T21:58:31.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "4976545",
                    "username": "Sanexus",
                    "comment_text": "Reading it for the second time!",
                    "timestamp": "2021-08-08T06:25:08.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "5041748",
                    "username": "TrixDTrixD",
                    "comment_text": "Hola",
                    "timestamp": "2021-08-23T02:23:02.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "5052983",
                    "username": "evdomo",
                    "comment_text": "amazi gn",
                    "timestamp": "2021-08-25T16:24:38.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "5086209",
                    "username": "Richard Keenan",
                    "comment_text": "Going to be cool to see where this goes!",
                    "timestamp": "2021-09-01T21:57:59.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "5119690",
                    "username": "king-grey",
                    "comment_text": "let's goooo!\n\nI'm reading this with a sixth month intervals to renew my memory,this is the fourth time I'm reading this,and I'm never getting tired of it.😊 there is a wisdom from what kim dokja said about reading books multiple times: \"each time you read a new session, try to understand someone other than main characters or inserting yourself in their position and you tend to discover something new hidden in the story\"",
                    "timestamp": "2021-09-09T06:41:22.0000000+00:00",
                    "replies": [
                        {
                            "comment_id": "7371931",
                            "username": "Celes",
                            "comment_text": "Wow! As you're quite well read, what would you recommend as other beloved books?\n\nOmniscient Reader was very hard to digest. But I love the protagonists of both. Paranoid mage and double blind have both similar protagonists to ORV and MoL, but OPness and hustling warped the stories over time, respectively. Funny how the most ludicrous plot is bearable, when characters are great.",
                            "timestamp": "2022-11-15T19:02:55.0000000+00:00",
                            "replies": [
                                {
                                    "comment_id": "7574197",
                                    "username": "king-grey",
                                    "comment_text": "personally, i recommended \"lord of the mysteries\". if you like the Old Ones from ORV, then meet the Great Blind Idiot being that gave birth to it. it has amazing detailed power system that splits the 22 major arcana of tarot cards into such a unique \"class\" each. something that you can compare to the likes of nen from hunter x hunter (haven't read much of brandon Sanderson's book, but people kept saying their intricacies are pretty similar).\n\nthe novel start with the premise of \"what if\" the equivalent of the cosmic horror, the Great Nuclear Daemon has awoken from its slumber a long time ago and it's consequences for the humanities overall. it has SCP esque organizations, set up in the beginning of industrial revolution in Victorian era, pirates that has one piece ranking (they copied from a transmigrator). I'm just gonna drop the synopsis here :\n\nWith the rising tide of steam power and machinery, who can come close to being a Beyonder? Shrouded in the fog of history and darkness, who or what is the lurking evil that murmurs into our ears?\n\nWaking up to be faced with a string of mysteries, Zhou Mingrui finds himself reincarnated as Klein Moretti in an alternate Victorian era world where he sees a world filled with machinery, cannons, dreadnoughts, airships, difference machines, as well as Potions, Divination, Hexes, Tarot Cards, Sealed Artifacts…\n\nThe Light continues to shine but mystery has never gone far. Follow Klein as he finds himself entangled with the Churches of the world—both orthodox and unorthodox—while he slowly develops newfound powers thanks to the Beyonder potions.\n\nLike the corresponding tarot card, The Fool, which is numbered 0—a number of unlimited potential—this is the legend of “The Fool”.",
                                    "timestamp": "2022-12-17T14:25:58.0000000+00:00",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "comment_id": "7574197",
                            "username": "king-grey",
                            "comment_text": "personally, i recommended \"lord of the mysteries\". if you like the Old Ones from ORV, then meet the Great Blind Idiot being that gave birth to it. it has amazing detailed power system that splits the 22 major arcana of tarot cards into such a unique \"class\" each. something that you can compare to the likes of nen from hunter x hunter (haven't read much of brandon Sanderson's book, but people kept saying their intricacies are pretty similar).\n\nthe novel start with the premise of \"what if\" the equivalent of the cosmic horror, the Great Nuclear Daemon has awoken from its slumber a long time ago and it's consequences for the humanities overall. it has SCP esque organizations, set up in the beginning of industrial revolution in Victorian era, pirates that has one piece ranking (they copied from a transmigrator). I'm just gonna drop the synopsis here :\n\nWith the rising tide of steam power and machinery, who can come close to being a Beyonder? Shrouded in the fog of history and darkness, who or what is the lurking evil that murmurs into our ears?\n\nWaking up to be faced with a string of mysteries, Zhou Mingrui finds himself reincarnated as Klein Moretti in an alternate Victorian era world where he sees a world filled with machinery, cannons, dreadnoughts, airships, difference machines, as well as Potions, Divination, Hexes, Tarot Cards, Sealed Artifacts…\n\nThe Light continues to shine but mystery has never gone far. Follow Klein as he finds himself entangled with the Churches of the world—both orthodox and unorthodox—while he slowly develops newfound powers thanks to the Beyonder potions.\n\nLike the corresponding tarot card, The Fool, which is numbered 0—a number of unlimited potential—this is the legend of “The Fool”.",
                            "timestamp": "2022-12-17T14:25:58.0000000+00:00",
                            "replies": []
                        }
                    ]
                },
                {
                    "comment_id": "5144156",
                    "username": "Pakko",
                    "comment_text": "Nice chapter!",
                    "timestamp": "2021-09-14T21:07:55.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "5150201",
                    "username": "tk.gal",
                    "comment_text": "Nice from the get-go",
                    "timestamp": "2021-09-16T04:19:48.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "5189048",
                    "username": "Varazzeno",
                    "comment_text": "I'm thinking of doing a third read-through...\n\nJust want a cozy story that I know I will enjoy.",
                    "timestamp": "2021-09-24T16:16:11.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "5202074",
                    "username": "Green Meteor",
                    "comment_text": "Re reading this, the students getting free individual rooms is more fantastical than magic",
                    "timestamp": "2021-09-27T22:05:35.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "5286596",
                    "username": "Moon-Ashura",
                    "comment_text": "Thanks for the chapter.",
                    "timestamp": "2021-10-16T13:07:08.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "5319501",
                    "username": "[Deleted]",
                    "comment_text": "[Account Deleted]",
                    "timestamp": "2021-10-23T18:26:41.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "5320816",
                    "username": "Malady",
                    "comment_text": "Author... You still here? Uh... Could you tag this story with Loop? The tag for time loops?",
                    "timestamp": "2021-10-24T03:03:00.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "5320859",
                    "username": "Ianaeyore",
                    "comment_text": "Thanks for the chapter !",
                    "timestamp": "2021-10-24T03:30:13.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "5348557",
                    "username": "[Deleted]",
                    "comment_text": "[Account Deleted]",
                    "timestamp": "2021-10-30T07:59:29.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "5385214",
                    "username": "Fleau",
                    "comment_text": "Thank you for the chapter.",
                    "timestamp": "2021-11-07T00:05:48.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "5431597",
                    "username": "GhostlyLight",
                    "comment_text": "Re-reading this gem, and holy hell is it different when you know the little things in here :) Honestly a great story.\n\nAuthor uses foreshadowing so well.",
                    "timestamp": "2021-11-16T10:52:12.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "5511847",
                    "username": "Porkstew",
                    "comment_text": "20 spells huh? you can already load of shenanigans with that much i'm sure.\n\nstory seems nice, glad there is already load to read.",
                    "timestamp": "2021-12-02T12:15:16.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "5541863",
                    "username": "Test Account 1",
                    "comment_text": "Test comment. This was really nice.",
                    "timestamp": "2021-12-08T16:47:54.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "5638358",
                    "username": "Cody37",
                    "comment_text": "Not bad from what read but I'll be honest I gave up as was too long/big a chapter, and didn't have time to read all so maybe try again later.",
                    "timestamp": "2021-12-31T05:01:40.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "5645482",
                    "username": "[Deleted]",
                    "comment_text": "[Account Deleted]",
                    "timestamp": "2022-01-01T23:17:56.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "5674440",
                    "username": "Crown Royal",
                    "comment_text": "Read most of this a while ago on the other site this was posted on, but it wasn't finished and I kinda forgot about it. It was a pretty sweet story, so now I can read the whole thing here.\n\nI forgot how much of a conceited douche the MC was at the start lmao. He really becomes a better, more well rounded person as time goes on. The main character really gets some good character development in this story, as well as becoming a badass.  Maybe conceited isn't quite the right description, although he does seem to have some of that.  It's also things like, how he sees other people.  He's honestly a bit of a misanthrope at the start lol.  The way he perceives others and how he chooses to interact with them is pretty different at the start compared to later.",
                    "timestamp": "2022-01-07T23:31:39.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "5697663",
                    "username": "danmateo",
                    "comment_text": "Amazing",
                    "timestamp": "2022-01-12T15:54:11.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "5742792",
                    "username": "Rumcan",
                    "comment_text": "So the rain barrier is gona be some sort of time dilation field to the past I guess... MC is very unlikeable at this point.",
                    "timestamp": "2022-01-20T21:18:01.0000000+00:00",
                    "replies": [
                        {
                            "comment_id": "7371898",
                            "username": "Celes",
                            "comment_text": "You tried :-)\n\n+ rep.",
                            "timestamp": "2022-11-15T18:56:46.0000000+00:00",
                            "replies": []
                        }
                    ]
                },
                {
                    "comment_id": "5861368",
                    "username": "Harry_Poppins",
                    "comment_text": "Hiii",
                    "timestamp": "2022-02-13T05:25:59.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "5935869",
                    "username": "SoulSlayer010",
                    "comment_text": "Thx",
                    "timestamp": "2022-02-26T10:30:33.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "5938078",
                    "username": "fever1102",
                    "comment_text": "I like the setting so far.",
                    "timestamp": "2022-02-26T20:57:49.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "6001201",
                    "username": "readingWizling",
                    "comment_text": "Upon starting this re-read, only now do I realise just how different & immature Zorian is at the beginning. It really makes you appreciate the progression",
                    "timestamp": "2022-03-11T11:48:24.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "6042327",
                    "username": "Crea S Ward",
                    "comment_text": "Sounds like an interesting story - I'm excited now :)",
                    "timestamp": "2022-03-20T10:30:07.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "6200585",
                    "username": "Cauteatuh",
                    "comment_text": "The start of the story is a little bit slow...\n\nBut I am a person of having enough patient... mhuahahaha",
                    "timestamp": "2022-04-21T05:27:09.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "6212989",
                    "username": "[Deleted]",
                    "comment_text": "[Account Deleted]",
                    "timestamp": "2022-04-23T11:28:03.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "6254512",
                    "username": "The Nobody",
                    "comment_text": "Thanks for the chapter!",
                    "timestamp": "2022-05-01T20:57:14.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "6337233",
                    "username": "Shankz",
                    "comment_text": "lets see whats this about",
                    "timestamp": "2022-05-17T22:59:56.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "6370708",
                    "username": "Ianaeyore",
                    "comment_text": "Thanks for the chapter",
                    "timestamp": "2022-05-24T14:19:00.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "6451752",
                    "username": "Beverlyy",
                    "comment_text": "thanks for the chapter",
                    "timestamp": "2022-06-08T16:37:40.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "6599069",
                    "username": "User8662",
                    "comment_text": "Thanks for the chapter",
                    "timestamp": "2022-07-05T15:03:36.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "6633464",
                    "username": "Bookmuncher",
                    "comment_text": "Thanks for the chapter",
                    "timestamp": "2022-07-11T20:42:14.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "6662086",
                    "username": "Carnalis",
                    "comment_text": "Going in for my first time, wish me luck.",
                    "timestamp": "2022-07-16T23:48:58.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "6767192",
                    "username": "Haremking001",
                    "comment_text": "Weren't cleaning spells the first thing that you learn to practice magic?!",
                    "timestamp": "2022-08-05T06:23:16.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "6773687",
                    "username": "CedeTheBees",
                    "comment_text": "Finally starting this! Definitely enjoying it so far. Zorian is the biggest mood.",
                    "timestamp": "2022-08-06T07:13:39.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "6846344",
                    "username": "Impswitch",
                    "comment_text": "Great start!",
                    "timestamp": "2022-08-18T18:48:16.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "6959074",
                    "username": "GAME KNIGHT",
                    "comment_text": "Hi",
                    "timestamp": "2022-09-07T06:20:43.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "7185774",
                    "username": "TheMadProfessor",
                    "comment_text": "I really enjoyed reading this first chapter. The opening sentence was a really great example of how to show and not tell, which a real welcoming sight to see.\n\nThe only things I saw on my part, and this is more of a style thing than a hardset rule, was:\n1. Possibly using italics for when a character is thinking. More of a visual cue that this isn't prose or dialogue.\n\n2. Writing out a number instead of using the number itself.\n\n3. For your scene breaks, I was suggested to use \" *** \". For my part it has a nicer visual to it, more than anything else.\n\nThat being said, this is in more of the \"nit-pick\" realm of critiques, since I liked how the rest of the writing flowed.",
                    "timestamp": "2022-10-15T16:14:13.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "7278247",
                    "username": "Mason Erwin",
                    "comment_text": "Rereading this great work I aspire to write as well as this story.",
                    "timestamp": "2022-10-31T21:33:26.0000000+00:00",
                    "replies": [
                        {
                            "comment_id": "7314462",
                            "username": "AshroBugger",
                            "comment_text": "It does that",
                            "timestamp": "2022-11-06T20:59:42.0000000+00:00",
                            "replies": []
                        }
                    ]
                },
                {
                    "comment_id": "7314463",
                    "username": "AshroBugger",
                    "comment_text": "So many people are commenting on this",
                    "timestamp": "2022-11-06T20:59:57.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "7371329",
                    "username": "Celes",
                    "comment_text": "Onto the third reread! Or should I wait for the physical copy... hmmm.",
                    "timestamp": "2022-11-15T17:16:50.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "7405133",
                    "username": "R.B",
                    "comment_text": "Long chapter, but didn't feel it. Will read more. Tftc.",
                    "timestamp": "2022-11-21T05:15:37.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "7545339",
                    "username": "Minos",
                    "comment_text": "Oh wow, what a start.\n\nInstantly relatable protagonist with his bad attitude and extreme introvertedness, check.\n\nInteresting world setting with a magical academy to boot, check.\n\nGreat writing style that goes to the point and doesn't feel either lacking or overly flowery? Check.\n\nTruly a fan favorite, I've been always curious about this story. It seems it's finally time to dig in. If all the ratings, reviews and comments are something to go by, it will indeed be quite a ride.",
                    "timestamp": "2022-12-13T09:48:16.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "7759328",
                    "username": "Bahuvore",
                    "comment_text": "4th reread, all the way from when it was literally only like a third of the way through on the site it used to be posted on 😎 I love this book with my whole heart",
                    "timestamp": "2023-01-15T18:46:52.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8005581",
                    "username": "DarbOv",
                    "comment_text": "Seems like this'll be a nice journey let's see if i can read all of it today!!",
                    "timestamp": "2023-02-18T17:30:31.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8079636",
                    "username": "SourTaffy",
                    "comment_text": "Finally getting around to doing a reread. This story has always been one of my favorites ever since it was first on topwebfiction (man it has been a while) and posted on fanfiction.net.",
                    "timestamp": "2023-03-01T08:13:34.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8163321",
                    "username": "[Deleted]",
                    "comment_text": "[Account Deleted]",
                    "timestamp": "2023-03-13T03:51:15.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8173188",
                    "username": "bloom_red_villains",
                    "comment_text": "This is already so good, considering it's just the first chapter. I can't wait to learn more about this world and the interesting MC. The magic system also seems pretty neat and the worldbuilding has that tinge of realism to it that makes it so interesting. Can't wait to find out more. On to the next chapter for me!",
                    "timestamp": "2023-03-14T11:29:25.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8206562",
                    "username": "TruthSeeker1",
                    "comment_text": "I have question for the author here. Why didn't our mc use blood magic/ritual to sacrifice his lifespan for permanent mana increase. I'm dying to know the reasons.",
                    "timestamp": "2023-03-18T10:37:28.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8260356",
                    "username": "Kailor Parku",
                    "comment_text": "I'm on my second run. It's too good to be forgotten after a single read-through!",
                    "timestamp": "2023-03-25T07:38:47.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8281066",
                    "username": "ninxoxo",
                    "comment_text": "Such a good start!\nCan't wait to read it further ^^",
                    "timestamp": "2023-03-28T03:49:40.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8281070",
                    "username": "ninxoxo",
                    "comment_text": "Such a good start!\n\nCan;t wait to read it further ^^",
                    "timestamp": "2023-03-28T03:50:26.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8375049",
                    "username": "Cyroli",
                    "comment_text": "nice start",
                    "timestamp": "2023-04-08T23:22:51.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8445316",
                    "username": "175offsaid",
                    "comment_text": "Thanks for the chapter!",
                    "timestamp": "2023-04-17T20:42:31.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8449845",
                    "username": "Everything_blue_09",
                    "comment_text": "FTR 18 APRIL, this looks so interesting. Mc is such a fifteen year old snarky teenager lmao, feels refreshing.",
                    "timestamp": "2023-04-18T09:45:30.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8453305",
                    "username": "aaaachoo",
                    "comment_text": "It's great. But what happened to all the rain? If it just vanished that's stupid.... But at the same time cool!",
                    "timestamp": "2023-04-18T19:20:08.0000000+00:00",
                    "replies": [
                        {
                            "comment_id": "8453358",
                            "username": "175offsaid",
                            "comment_text": "And, Ya, what happened to all the rain?!",
                            "timestamp": "2023-04-18T19:28:22.0000000+00:00",
                            "replies": [
                                {
                                    "comment_id": "8453505",
                                    "username": "aaaachoo",
                                    "comment_text": "It mite be that it go's thru a portal and gets teleported away.",
                                    "timestamp": "2023-04-18T19:49:08.0000000+00:00",
                                    "replies": []
                                },
                                {
                                    "comment_id": "8453529",
                                    "username": "175offsaid",
                                    "comment_text": "That would make sense if it teleported away.🧐",
                                    "timestamp": "2023-04-18T19:53:16.0000000+00:00",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "comment_id": "8453505",
                            "username": "aaaachoo",
                            "comment_text": "It mite be that it go's thru a portal and gets teleported away.",
                            "timestamp": "2023-04-18T19:49:08.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "8453529",
                            "username": "175offsaid",
                            "comment_text": "That would make sense if it teleported away.🧐",
                            "timestamp": "2023-04-18T19:53:16.0000000+00:00",
                            "replies": []
                        }
                    ]
                },
                {
                    "comment_id": "8491312",
                    "username": "BBrowning",
                    "comment_text": "Legally blind (no vision in right eye and no central vision in left), so re-reading is what I do, not by choice, but rather by necessity. The caveat being that sometimes I re-read everything I’ve re-read because I enjoyed the re-reading the first time, and the second, and the third, and… voice trails off as nobody103 cares",
                    "timestamp": "2023-04-23T15:45:38.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8527706",
                    "username": "mattcantor2",
                    "comment_text": "This has such great personality!",
                    "timestamp": "2023-04-27T21:04:43.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8600925",
                    "username": "Alzeimechorous",
                    "comment_text": "Awesome Awesome Awesome. I Read this on Ranobes and quite enjoyed it. Its nice seeing It here too. Full 10 from me.",
                    "timestamp": "2023-05-06T14:17:17.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8667198",
                    "username": "[Deleted]",
                    "comment_text": "[Account Deleted]",
                    "timestamp": "2023-05-14T21:54:48.0000000+00:00",
                    "replies": [
                        {
                            "comment_id": "9283229",
                            "username": "WANTED: 2000 words.(jk)",
                            "comment_text": "Love it to!",
                            "timestamp": "2023-07-25T21:00:44.0000000+00:00",
                            "replies": []
                        }
                    ]
                },
                {
                    "comment_id": "8698152",
                    "username": "CaosDragon",
                    "comment_text": "Can anyone recommend something good like this?? I have run out of anything to read, I have read most of the light novels, webnovels or I know them and I don't like it. Recommend me anything.",
                    "timestamp": "2023-05-18T14:16:35.0000000+00:00",
                    "replies": [
                        {
                            "comment_id": "8800594",
                            "username": "Jasus",
                            "comment_text": "On this site Super Supportive has good characters, dialogue and worldbuilding, it is just slow and and unfinished. Lord of the mysteries is an Webnovel with an extensive World set in an Lovcraftian victorian setting and has mysteries littert every where, just reeely slow.",
                            "timestamp": "2023-05-30T13:54:46.0000000+00:00",
                            "replies": [
                                {
                                    "comment_id": "8998364",
                                    "username": "CaosDragon",
                                    "comment_text": "Thanks,Super Supportive is my favorite novel as for the other I don't know, I'm going to try it now.",
                                    "timestamp": "2023-06-22T08:50:51.0000000+00:00",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "comment_id": "8998364",
                            "username": "CaosDragon",
                            "comment_text": "Thanks,Super Supportive is my favorite novel as for the other I don't know, I'm going to try it now.",
                            "timestamp": "2023-06-22T08:50:51.0000000+00:00",
                            "replies": []
                        }
                    ]
                },
                {
                    "comment_id": "8827163",
                    "username": "FleetingClouds9",
                    "comment_text": "Wait, just how long is this single chapter",
                    "timestamp": "2023-06-02T07:21:20.0000000+00:00",
                    "replies": [
                        {
                            "comment_id": "9217903",
                            "username": "foodiB",
                            "comment_text": "Indeed, this was a pirateaba level chapter",
                            "timestamp": "2023-07-18T09:03:02.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "9283196",
                            "username": "WANTED: 2000 words.(jk)",
                            "comment_text": "All I will tell you is that it's LONG.^ ^\n\n^ ^\n\n^ ^\n\n~~~~~~",
                            "timestamp": "2023-07-25T20:56:53.0000000+00:00",
                            "replies": []
                        }
                    ]
                },
                {
                    "comment_id": "8998359",
                    "username": "MortalKombator",
                    "comment_text": "i didn't expect this to be so long, i \\'m new to webnovel, so i expected this to be short",
                    "timestamp": "2023-06-22T08:49:54.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "9071695",
                    "username": "tina_mash",
                    "comment_text": "interesting. Will give this a go.",
                    "timestamp": "2023-07-01T11:08:48.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "9093555",
                    "username": "[Deleted]",
                    "comment_text": "[Account Deleted]",
                    "timestamp": "2023-07-04T03:10:47.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "9138190",
                    "username": "GreatGodBuddy",
                    "comment_text": "thanks for the chapter!",
                    "timestamp": "2023-07-09T08:23:04.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "9217905",
                    "username": "foodiB",
                    "comment_text": "Heard great things about this - let’s goooo!\n\nalso impressive amount of lore dump for chapter one",
                    "timestamp": "2023-07-18T09:04:19.0000000+00:00",
                    "replies": [
                        {
                            "comment_id": "9283213",
                            "username": "WANTED: 2000 words.(jk)",
                            "comment_text": "Ya it is but the chapter is still good.",
                            "timestamp": "2023-07-25T20:58:30.0000000+00:00",
                            "replies": []
                        }
                    ]
                },
                {
                    "comment_id": "9509166",
                    "username": "sillymel",
                    "comment_text": "An interesting, if somewhat cliche, start. I appreciated the magic system exposition that was naturally woven into the story with that one question from a first-year student.\n\nAlso, I wouldn't be surprised if Kirielle ends up dying in (at least) one of the loops.",
                    "timestamp": "2023-08-21T00:39:38.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "9675446",
                    "username": "Nobody B.",
                    "comment_text": "Thank You for the Chapter!",
                    "timestamp": "2023-09-09T09:15:58.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "9751347",
                    "username": "Luke Scheffe",
                    "comment_text": "Thanks for the chapter!!!!",
                    "timestamp": "2023-09-18T22:47:51.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "9939117",
                    "username": "alex_lightwind",
                    "comment_text": "What a great piece. Reminded me HP in a way. 😅",
                    "timestamp": "2023-10-11T21:54:48.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "10027136",
                    "username": "SniperGoony",
                    "comment_text": "Was pretty good, I kept seeing this story pop up, and it's pretty long, so I look forward to seeing where it goes.",
                    "timestamp": "2023-10-22T20:14:10.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "10079007",
                    "username": "Darkoneko",
                    "comment_text": "the story-related rats aside, i ... really wonder just how her bike fell into the river. Surely it didn't happen simply because she was playing with it. Did a bully do it ? or... ?",
                    "timestamp": "2023-10-28T16:48:49.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "10114125",
                    "username": "Expertreader",
                    "comment_text": "Finally finished the novel. What? It was just the first chapter?",
                    "timestamp": "2023-11-01T18:24:15.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "10115762",
                    "username": "Ianaeyore",
                    "comment_text": "Thanks for the chapter!",
                    "timestamp": "2023-11-01T21:20:39.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "10226373",
                    "username": "Hyperflux",
                    "comment_text": "Thank you for the chapter!",
                    "timestamp": "2023-11-14T01:53:11.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "10339352",
                    "username": "aboode-99",
                    "comment_text": "I hated the first half of this chapter hopefully it is uphill from here out.",
                    "timestamp": "2023-11-26T20:24:13.0000000+00:00",
                    "replies": [
                        {
                            "comment_id": "11895690",
                            "username": "TheSpoonThatDied",
                            "comment_text": "Oh, it's not just uphill.. it's a straight ladder to outer space!",
                            "timestamp": "2024-05-06T16:38:25.0000000+00:00",
                            "replies": []
                        }
                    ]
                },
                {
                    "comment_id": "10510255",
                    "username": "thathawaiian",
                    "comment_text": "This is the best novel I've ever read",
                    "timestamp": "2023-12-15T06:57:13.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "10566361",
                    "username": "Brunoski",
                    "comment_text": "Just found this today, hey yall how ya doing? :D",
                    "timestamp": "2023-12-21T17:15:15.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "10575214",
                    "username": "JCMA_Just_Call_Me_Aunty",
                    "comment_text": "TFTC!",
                    "timestamp": "2023-12-22T17:26:05.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "10687241",
                    "username": "BeheadedMouse",
                    "comment_text": "Rereading from chapter 1 for the literal 6th time... I love this damn book.",
                    "timestamp": "2024-01-05T08:02:27.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "10693434",
                    "username": "GuiltyWards50",
                    "comment_text": "First time reading. What I get from this is that Zorian really doesn't like his family and for good reason.",
                    "timestamp": "2024-01-05T22:08:54.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "10704991",
                    "username": "richardwriter",
                    "comment_text": "wow this starts well. Just 106 chapters to go\n\nRichard (Wyld Book of Secrets)",
                    "timestamp": "2024-01-07T07:02:56.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "10766477",
                    "username": "Aranea_Lilium",
                    "comment_text": "However a long first chapter it was, I found it enjoyable. Especially the writing flow. Looking forward to this story!",
                    "timestamp": "2024-01-13T16:17:23.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "10854634",
                    "username": "Rikamew",
                    "comment_text": "First reread! I lost my place on fictionpress, but that's fine since I need to refresh my memory of plot details and the worldbuilding. It's so much fun picking out all the details Zorian is ignorant of.",
                    "timestamp": "2024-01-23T09:16:12.0000000+00:00",
                    "replies": [
                        {
                            "comment_id": "11423231",
                            "username": "WANTED: 2000 words.(jk)",
                            "comment_text": "I know right? It's my third reread and I still can't get enough!",
                            "timestamp": "2024-03-21T18:29:35.0000000+00:00",
                            "replies": []
                        }
                    ]
                },
                {
                    "comment_id": "10988857",
                    "username": "Lord Zoro",
                    "comment_text": "Time for some dive",
                    "timestamp": "2024-02-06T12:57:26.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "11134239",
                    "username": "worsechance",
                    "comment_text": "Amazing story, wouldnt re-read it though",
                    "timestamp": "2024-02-21T20:37:49.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "11289835",
                    "username": "fatima0110baby",
                    "comment_text": "love this so far its very interesting!",
                    "timestamp": "2024-03-08T15:51:15.0000000+00:00",
                    "replies": [
                        {
                            "comment_id": "11423198",
                            "username": "WANTED: 2000 words.(jk)",
                            "comment_text": "I've read the book all the way to the last chapter! It's great!\n\nIt's a great book and I wouldn't miss it.",
                            "timestamp": "2024-03-21T18:26:28.0000000+00:00",
                            "replies": []
                        }
                    ]
                },
                {
                    "comment_id": "11315959",
                    "username": "EbbeRoad",
                    "comment_text": "Just starting this as my first English book that isn’t any type of manga that has pictures :D",
                    "timestamp": "2024-03-11T12:35:32.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "11409116",
                    "username": "Astrokitty",
                    "comment_text": "It's fantastic they never removed the the free chapters even after being officially published",
                    "timestamp": "2024-03-20T11:58:42.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "11487265",
                    "username": "dsclink",
                    "comment_text": "This is my third re-read also. My first time reading it on RR though.\n\nOne of my favorite long stories, thanks to nobody.",
                    "timestamp": "2024-03-28T02:10:00.0000000+00:00",
                    "replies": [
                        {
                            "comment_id": "11895676",
                            "username": "TheSpoonThatDied",
                            "comment_text": "\"Thanks to nobody\" lmaoo",
                            "timestamp": "2024-05-06T16:37:20.0000000+00:00",
                            "replies": []
                        }
                    ]
                },
                {
                    "comment_id": "11573312",
                    "username": "Cambire",
                    "comment_text": "TFTC!!!",
                    "timestamp": "2024-04-05T14:03:06.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "11601292",
                    "username": "PrimaMatri",
                    "comment_text": "",
                    "timestamp": "2024-04-08T13:52:26.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "11737774",
                    "username": "[Deleted]",
                    "comment_text": "[Account Deleted]",
                    "timestamp": "2024-04-21T17:13:24.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "11881589",
                    "username": "Gdub8167",
                    "comment_text": "TFTC, looking forward to seeing were this goes. Heard a lot of good reviews.",
                    "timestamp": "2024-05-05T04:45:58.0000000+00:00",
                    "replies": [
                        {
                            "comment_id": "11895649",
                            "username": "TheSpoonThatDied",
                            "comment_text": "Amazing novel. You're gonna love it",
                            "timestamp": "2024-05-06T16:35:06.0000000+00:00",
                            "replies": []
                        }
                    ]
                },
                {
                    "comment_id": "11891164",
                    "username": "ArmedNormie",
                    "comment_text": "The story is worth the read, its a wild ride everyone should stick around for.",
                    "timestamp": "2024-05-06T05:44:16.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "12062856",
                    "username": "Aleese Hughes",
                    "comment_text": "Just starting this... I wonder what I'm getting into. ;)",
                    "timestamp": "2024-05-22T03:51:56.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "12092353",
                    "username": "Weloys",
                    "comment_text": "Dang that chapter was long are all of them like that?",
                    "timestamp": "2024-05-24T18:38:09.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "12158391",
                    "username": "Lin Lin",
                    "comment_text": "Wow I wish I could read like that!",
                    "timestamp": "2024-05-30T22:41:30.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "12164309",
                    "username": "RacingSnail",
                    "comment_text": "good",
                    "timestamp": "2024-05-31T12:59:19.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "12296441",
                    "username": "Lovelock Carlson",
                    "comment_text": "Just read the first chapter, and I'm hooked! The world-building is on point. This feels like the start of an epic journey. Can't wait to see where the story goes from here!",
                    "timestamp": "2024-06-13T03:22:59.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "12335401",
                    "username": "Azarinth Reader",
                    "comment_text": "I don't remember if this is my third or fourth reread but I love this story and am so excited to analyze it this time. Thanks @nobody103 for posting it here.",
                    "timestamp": "2024-06-17T06:23:28.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "12576818",
                    "username": "TrueCipres",
                    "comment_text": "Today I decided to re-read (again) this novel and want to take the time to thank you, Nobody, for not moving it to Kindle despite getting some pressure on it.\n\nI don't have much extra money and this is my hobby, I do it in my free time, and it helps me get through the 12 hours a day 6 days a week, work loads.\n\nI don't know if you read comments in old chapter, but I really appreciate this story and that you keep it free for those that want to try it. I hope the feeling reaches you.",
                    "timestamp": "2024-07-10T15:47:20.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "12743093",
                    "username": "A tater tot",
                    "comment_text": "TFTC!",
                    "timestamp": "2024-07-26T00:29:22.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "12805282",
                    "username": "ALandFarAway",
                    "comment_text": "I saw this was the highest rated story on RR, and I heard some people arguing about the prose being good or bad or whatever, but that's not relevant. He wouldn't own clothes his mother doesn't approve of, that doesn't make sense. His mother literally just told him to take things more seriously and then said \"you takw things too seriously.\"",
                    "timestamp": "2024-08-01T00:10:35.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "12823750",
                    "username": "Ak Omer",
                    "comment_text": "Great start, loved the first chapter",
                    "timestamp": "2024-08-02T16:54:43.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "13019494",
                    "username": "Eminence",
                    "comment_text": "Tftc",
                    "timestamp": "2024-08-20T20:44:00.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "13032494",
                    "username": "Voice between worlds",
                    "comment_text": "I love the audiobooks and I am on the last on now",
                    "timestamp": "2024-08-22T00:33:02.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "13053456",
                    "username": "GatesOfDawn",
                    "comment_text": "Was the name Kazinski a deliberate choice? A very disturbed individual, Kazinsky killed 3 and maimed 23 others.",
                    "timestamp": "2024-08-23T23:42:58.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "13069010",
                    "username": "Ruuyi",
                    "comment_text": "Interesting beginning. Looks like a long and enjoyable read!",
                    "timestamp": "2024-08-25T18:15:54.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "13075894",
                    "username": "[Deleted]",
                    "comment_text": "[Account Deleted]",
                    "timestamp": "2024-08-26T12:08:03.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "13087306",
                    "username": "Jade Moore",
                    "comment_text": "My first read of this story, I've heard good things.",
                    "timestamp": "2024-08-27T10:50:26.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "13091339",
                    "username": "Samuel Bradley",
                    "comment_text": "First time reading lets see if it's good?",
                    "timestamp": "2024-08-27T18:45:51.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "13094565",
                    "username": "PurpleTwig",
                    "comment_text": "Such a cranky teenager, love it. Also, Kazinski? He seems like the type to know about the disastrous consequences of the Industrial Revolution lol",
                    "timestamp": "2024-08-28T00:52:10.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "13118921",
                    "username": "Sought",
                    "comment_text": "Zorian so relatable fr fr",
                    "timestamp": "2024-08-30T04:23:47.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "13249319",
                    "username": "G.G.Jupiter",
                    "comment_text": "Tftc",
                    "timestamp": "2024-09-12T05:28:29.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "13261076",
                    "username": "CaosDragon",
                    "comment_text": "Fifth rereading.",
                    "timestamp": "2024-09-13T10:14:39.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "13528403",
                    "username": "Gothic_Catalyst",
                    "comment_text": "Thank you for the chapter.",
                    "timestamp": "2024-10-09T09:33:45.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "13583489",
                    "username": "Petty Bastard",
                    "comment_text": "noice",
                    "timestamp": "2024-10-14T17:43:12.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "13720774",
                    "username": "Kafka_minion",
                    "comment_text": "Thanks for the chapter",
                    "timestamp": "2024-10-27T05:19:26.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "13728856",
                    "username": "myfathersgay",
                    "comment_text": "Intersting story and might read more.",
                    "timestamp": "2024-10-28T03:12:14.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "13884051",
                    "username": "Crawling Madness",
                    "comment_text": "Thanks for the chapter!",
                    "timestamp": "2024-11-11T03:16:45.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "14357448",
                    "username": "storyglutton",
                    "comment_text": "literally what is the point of having a sky if youre not able to see beautiful raindroplets streaking across your window??\n\nid hate to live here",
                    "timestamp": "2024-12-25T10:22:15.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "14382033",
                    "username": "Anomundi",
                    "comment_text": "Realmente isso foi uma ótima ambientação, parece uma espécie de Unicamp ou Usp",
                    "timestamp": "2024-12-27T22:58:37.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "14443016",
                    "username": "panan",
                    "comment_text": "I enjoyed the exposition and dialogue.\n\nSo his mom wanted him to take care of his lil sis in his school dorm? That's crazy unreasonable. I'm excited to see how this story develop.",
                    "timestamp": "2025-01-03T05:06:39.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "14547027",
                    "username": "GoldenTracksuit",
                    "comment_text": "the GOAT",
                    "timestamp": "2025-01-12T19:40:48.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "14560168",
                    "username": "Feedback By Chance",
                    "comment_text": "nice",
                    "timestamp": "2025-01-13T23:44:03.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "14596829",
                    "username": "Page Pilgrim",
                    "comment_text": "Time to pilgrimage for a holy reread of the great fanfiction bible",
                    "timestamp": "2025-01-17T01:21:59.0000000+00:00",
                    "replies": [
                        {
                            "comment_id": "14629975",
                            "username": "Custom Beverly",
                            "comment_text": "This'll be my third re-read? Wow, time really flies.",
                            "timestamp": "2025-01-20T04:06:42.0000000+00:00",
                            "replies": []
                        }
                    ]
                },
                {
                    "comment_id": "14623539",
                    "username": "Stingsman",
                    "comment_text": "Wow",
                    "timestamp": "2025-01-19T13:46:20.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "14657218",
                    "username": "T.K.I.N.G",
                    "comment_text": "Thanks for the chapter",
                    "timestamp": "2025-01-22T16:04:39.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "14709024",
                    "username": "Nuclear power plant",
                    "comment_text": "This is the second novel after \"The Runesmith\" from Kuropon I'm reading. Solid start i would say, it is much praised in the comment section",
                    "timestamp": "2025-01-27T07:55:26.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "14765789",
                    "username": "Lythan",
                    "comment_text": "First time reading hopefully its worth the hype",
                    "timestamp": "2025-01-31T23:37:54.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "14820766",
                    "username": "Lover74",
                    "comment_text": "New year new reread",
                    "timestamp": "2025-02-05T22:15:15.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "14832470",
                    "username": "Denssetsuu",
                    "comment_text": "I have always heard good things about this novel, I can’t wait to see what will happen in the latter chapters!",
                    "timestamp": "2025-02-06T23:04:14.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "14852730",
                    "username": "MonarchOfTheHills",
                    "comment_text": "good morning",
                    "timestamp": "2025-02-08T20:48:48.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "14867968",
                    "username": "ImagineObsession",
                    "comment_text": "TFTC",
                    "timestamp": "2025-02-10T14:28:52.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "14890684",
                    "username": "RDart",
                    "comment_text": "After reading the first two paragraph I thought: must be an awesome piece of work.",
                    "timestamp": "2025-02-12T11:54:29.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "14929900",
                    "username": "[Deleted]",
                    "comment_text": "[Account Deleted]",
                    "timestamp": "2025-02-15T20:16:50.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "15019587",
                    "username": "Rowdha Al Sol",
                    "comment_text": "Tftc",
                    "timestamp": "2025-02-23T18:58:21.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "15089548",
                    "username": "Koo Murr",
                    "comment_text": "Tftc",
                    "timestamp": "2025-03-01T12:55:07.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "15120354",
                    "username": "Senergi_SD",
                    "comment_text": "Nice",
                    "timestamp": "2025-03-04T09:18:56.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "15180822",
                    "username": "Well being",
                    "comment_text": "Nice chapter",
                    "timestamp": "2025-03-09T17:16:21.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "15220587",
                    "username": "[Deleted]",
                    "comment_text": "[Account Deleted]",
                    "timestamp": "2025-03-12T21:26:08.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "15234672",
                    "username": "Blade_Master",
                    "comment_text": "One Read, 100+ to Go\n\nAm I the only who thinks that the first chapter was tiring?",
                    "timestamp": "2025-03-13T23:41:08.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "15339620",
                    "username": "Sainey Mendy",
                    "comment_text": "You nailed it man 🥰.",
                    "timestamp": "2025-03-22T12:12:34.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "15396643",
                    "username": "yada",
                    "comment_text": "Just wanted to say a Big Thank You for this master piece, I really loved it, and speed read through it more or less.\n\nYes, parts here and there can be improved, but I really like the story, and hence just ignored all minor imperfections here and there.\n\nWould love a couple (2-5) extra chapters to give more flesh on what happened after all was done.\n\nLike his family, like how his trusted people interacted with him, how the school / students interacted with him.\n\nHow he dealt with limited funding\n\nWould the inspector find him... What did people think of the gifted notebooks\n\netc etc",
                    "timestamp": "2025-03-27T05:47:41.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "15399098",
                    "username": "Well being",
                    "comment_text": "Oh men, that was very long chapter, lot of unnecessary information but still if they are used for character growth and development then it's fine otherwise this is really overwhelming and unnecessary. I can even skip paragraphs but nothing will be changed with the story map in my mind",
                    "timestamp": "2025-03-27T12:12:02.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "15435157",
                    "username": "LennieRabbit",
                    "comment_text": "Seems interesting, but this was a long dry read of a first chapter.",
                    "timestamp": "2025-03-30T17:26:21.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "15467881",
                    "username": "Dauth",
                    "comment_text": "Time for my third reread. Gotta say that the sister waking him up is the perfect opening. Nostalgia for anyone rereading lol",
                    "timestamp": "2025-04-02T09:57:39.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "15556855",
                    "username": "Oliviadbast",
                    "comment_text": "I've always heard about this book *adds to readlist*",
                    "timestamp": "2025-04-09T19:32:19.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "15575658",
                    "username": "Owari Da",
                    "comment_text": "Wow thats a long first chapter. It was hard to read it during math class",
                    "timestamp": "2025-04-11T08:08:00.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "15727139",
                    "username": "Akku",
                    "comment_text": "This chapter was longer than I thought it would be but I like that. Regardless, this was a good first chapter 👍",
                    "timestamp": "2025-04-23T12:42:44.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "15771303",
                    "username": "o0shad0o",
                    "comment_text": "Any chance of a dead tree release? I'd really like a copy...",
                    "timestamp": "2025-04-27T00:12:54.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "15837016",
                    "username": "kirito.5002",
                    "comment_text": "First read heheh",
                    "timestamp": "2025-05-01T18:36:55.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "15899714",
                    "username": "Marcello Sianipar",
                    "comment_text": "Read : FAITH OF A SLAVE\nIt is better than this story",
                    "timestamp": "2025-05-07T00:59:37.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "15916991",
                    "username": "Fafnir's Talon",
                    "comment_text": "nice for opening!",
                    "timestamp": "2025-05-08T10:45:18.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "16046902",
                    "username": "Redleaves",
                    "comment_text": "His brother just has ADHD bro 😭",
                    "timestamp": "2025-05-19T17:35:03.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "16131489",
                    "username": "Game_Neek",
                    "comment_text": "First reread time to experience it all over again",
                    "timestamp": "2025-05-26T16:54:25.0000000+00:00",
                    "replies": [
                        {
                            "comment_id": "16167983",
                            "username": "micksher",
                            "comment_text": "Third for me.",
                            "timestamp": "2025-05-29T10:20:01.0000000+00:00",
                            "replies": []
                        }
                    ]
                },
                {
                    "comment_id": "16220510",
                    "username": "BigWigTig",
                    "comment_text": "This is one of, if not the best stories I've ever read. Finished reading for the second time the other day, and excited to read it again soon! If only I could experience it for the first time once more.",
                    "timestamp": "2025-06-02T21:25:00.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "16238711",
                    "username": "quluzadeh",
                    "comment_text": "Just started. Lets see how it is",
                    "timestamp": "2025-06-04T07:38:41.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "16242306",
                    "username": "AndoryuDragon",
                    "comment_text": "First time reading MoL and in RR! Loving it!",
                    "timestamp": "2025-06-04T15:51:09.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "16304071",
                    "username": "Alicethegirl",
                    "comment_text": "",
                    "timestamp": "2025-06-09T19:25:59.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "16315400",
                    "username": "Heriaks",
                    "comment_text": "It's time to start MoL",
                    "timestamp": "2025-06-10T17:18:26.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "16320518",
                    "username": "brotato065",
                    "comment_text": "Time to give this wonderful story of reread.\n\nTossing a comment in for posterity.",
                    "timestamp": "2025-06-11T01:39:32.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "16378355",
                    "username": "[Deleted]",
                    "comment_text": "[Account Deleted]",
                    "timestamp": "2025-06-15T23:14:37.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "16535398",
                    "username": "booksaesthetics",
                    "comment_text": "Thanks for the chapter!",
                    "timestamp": "2025-06-28T08:45:17.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "16558470",
                    "username": "DLNel",
                    "comment_text": "Excited to get started reading this!!",
                    "timestamp": "2025-06-30T15:37:11.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "16577521",
                    "username": "AVAM",
                    "comment_text": "In spanish plis.",
                    "timestamp": "2025-07-01T23:04:27.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "16582441",
                    "username": "FuturePrince",
                    "comment_text": "Here we go again",
                    "timestamp": "2025-07-02T10:11:13.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "16589887",
                    "username": "HaloReads",
                    "comment_text": "Been hearing so much of this, time to finally give it a read, better late than never ig",
                    "timestamp": "2025-07-02T22:16:20.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "16593802",
                    "username": "staywildreader",
                    "comment_text": "Thanks for the chapters!",
                    "timestamp": "2025-07-03T06:10:18.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "16649249",
                    "username": "Llloyd fronterra",
                    "comment_text": "My first time reading this and god is this mc an obnoxious a-hole. The story seems great though.",
                    "timestamp": "2025-07-07T21:46:24.0000000+00:00",
                    "replies": [
                        {
                            "comment_id": "17296901",
                            "username": "rarson",
                            "comment_text": "Character development\n\nAlso your name is Lloyd Frontera his whole stick is that he's a obnoxious a-hole but funny\n\n(No hate towards TGED)",
                            "timestamp": "2025-08-25T14:40:23.0000000+00:00",
                            "replies": []
                        }
                    ]
                },
                {
                    "comment_id": "16665185",
                    "username": "ButterfliesandBlades",
                    "comment_text": "TFTC!",
                    "timestamp": "2025-07-09T01:00:00.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "16782151",
                    "username": "recurrel",
                    "comment_text": "This is my first time reading it and wondered why it was going for so long on daily trivial things, and wondered what the reason was...hehe I got my answer from other posts  time to read some more!!!",
                    "timestamp": "2025-07-18T00:05:27.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "16941754",
                    "username": "junebug25",
                    "comment_text": "First time reader, so excited",
                    "timestamp": "2025-07-30T04:39:32.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "16941879",
                    "username": "ImaginationMachine",
                    "comment_text": "Oh boy, oh boy, I am starting to love this! I was just taking a glimpse at it and ended up reading it! Great work, man!",
                    "timestamp": "2025-07-30T04:55:01.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "16977647",
                    "username": "OceanRahman",
                    "comment_text": "Great story telling. It truly captures all aspects of writing pretty well and it certainly lives up to both it's name & fame. I'll try to make my novel as good as this if not better.",
                    "timestamp": "2025-08-01T18:20:46.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "17030560",
                    "username": "Luna Campbell",
                    "comment_text": "This is what convinced me to start publishing on here.",
                    "timestamp": "2025-08-05T18:19:26.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "17233550",
                    "username": "Makuseru_Ranpa",
                    "comment_text": "I really love this novel, once i read it. it ignited me, to make my own Novel!\n\nRiftborn Saga!!",
                    "timestamp": "2025-08-20T16:31:36.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "17402620",
                    "username": "DACLINIC",
                    "comment_text": "Is this worth reading?",
                    "timestamp": "2025-09-02T15:56:40.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "17425369",
                    "username": "mostakinhossain89",
                    "comment_text": "good",
                    "timestamp": "2025-09-04T04:03:53.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "17560192",
                    "username": "MinaWetp",
                    "comment_text": "Such an impressive work — it must have taken many months. I truly admire it. Very different from my own writing, but that’s the beauty of literature. I warmly invite you to visit my story as well. I’m a bit of a romantic soul, a woman with a big heart who loves to fix the world.",
                    "timestamp": "2025-09-14T20:33:20.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "17592874",
                    "username": "Bingerreader",
                    "comment_text": "Wow nice.",
                    "timestamp": "2025-09-17T05:21:07.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "17832336",
                    "username": "John smith555",
                    "comment_text": "Tftc",
                    "timestamp": "2025-10-05T08:21:42.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "17851817",
                    "username": "Emsen",
                    "comment_text": "Thanks for the chapter",
                    "timestamp": "2025-10-06T20:29:02.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "18022677",
                    "username": "Sentinal",
                    "comment_text": "I'm both excited and hyped to finally read this mother of learning legend novel. Started reading novels just this year and I hope this is peak",
                    "timestamp": "2025-10-19T16:06:17.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "18024032",
                    "username": "Silent Striker",
                    "comment_text": "Quality stuff man. A rarity nowdays",
                    "timestamp": "2025-10-19T18:28:33.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "18083524",
                    "username": "DracoNonDeo",
                    "comment_text": "Tftc",
                    "timestamp": "2025-10-24T00:07:22.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "18121525",
                    "username": "Curious Reader",
                    "comment_text": "Tftc",
                    "timestamp": "2025-10-27T02:32:22.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "18220891",
                    "username": "bswg",
                    "comment_text": "Tyftc",
                    "timestamp": "2025-11-03T16:25:23.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "18229028",
                    "username": "OldAlchemist",
                    "comment_text": "tftc",
                    "timestamp": "2025-11-04T02:09:42.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "18259552",
                    "username": "The_Ultimate_Snakebomber",
                    "comment_text": "It is always nice to find this book for re-reads. Having it be the top rated fic is very convenient for locating it.",
                    "timestamp": "2025-11-06T07:33:36.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "18275139",
                    "username": "Tiberius21",
                    "comment_text": "This has been hyped to me so much, I can't wait to finally read through it :D",
                    "timestamp": "2025-11-07T12:08:33.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "18287067",
                    "username": "CaptainToad",
                    "comment_text": "Interesting",
                    "timestamp": "2025-11-08T05:22:09.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "18382897",
                    "username": "Zacheas",
                    "comment_text": "It seems REALLY weird for someone to not know what mana in this context. One example of several section of exposition what probably didn't need to be explained so explicitly.",
                    "timestamp": "2025-11-14T21:52:47.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "18395438",
                    "username": "Torttuga",
                    "comment_text": "Nice story",
                    "timestamp": "2025-11-15T23:20:24.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "18400405",
                    "username": "Ceba_official",
                    "comment_text": "Zorian is such a little shit! He's so endlessly critical of everyone but himself. Whenever someone does or says something to him, his only thought is \"ugh, this effects me\". He's unable to make that leap from \"I'm feeling a certain way about these people\" to \"Why are they doing what they're doing?\". I hope this young man learns this skill fast because otherwise he'll fail hard.",
                    "timestamp": "2025-11-16T10:33:30.0000000+00:00",
                    "replies": []
                }
            ]
        }
    ]
}