{
    "id": "26675",
    "title": "A Journey of Black and Red",
    "fiction_url": "https://www.royalroad.com/fiction/26675/a-journey-of-black-and-red",
    "cover_image_local": "data\\images\\26675_cover.jpg",
    "author": "Mecanimus",
    "category": "Original",
    "status": "COMPLETED",
    "tags": [
        "Urban Fantasy",
        "Villainous Lead",
        "Female Lead",
        "Action",
        "Adventure",
        "Fantasy",
        "Historical"
    ],
    "description": "A conversation with a handsome stranger leaves Ariane chained in a cellar with a strange affliction. She soon discovers that the darkness of the nineteenth century’s Deep South hides many dangers. Mages, wolf shifters and the humans who hunt them play a risky game where to stumble is to die, all under the amused gaze of the apex predators of the supernatural world: vampires.\n\nIt is never healthy to attract the gaze of the aristocracy of the night. It takes much to survive in this merciless world, but Ariane will not let that deter her. The southern belle has a bite, and she is willing to learn and to grow in this hostile new world. She will use whatever means necessary to reclaim her freedom, be it guile, charm, or those intriguing new instincts that make blood so delectable.\n\nThis is a story of vampires as I believe they should be, with their strengths and weaknesses, with their remnants of humanity and the beast inside. Updates every Friday. Mind the tags.\n\nCover by Antti Hakosaari: https://www.artstation.com/haco\n\nSpecial thanks to Svensonsen for getting me started, as well as Omi Nya, Hesketh, Rhaegar, Yaksher, Selkie and Raven for proofreading my stuff. Thanks to my patrons and you dear readers, for the support. I could not do it without you.\n\nJourney is on Amazon, both in ebooks and audio. here is a link to the first one:\n\nhttps://www.royalroad.com/amazon/B08DK6G8Y8\n\nThe story probably exists in your local marketplace as well of I can tempt you.",
    "stats": {
        "score": {
            "overall_score": "",
            "style_score": "",
            "story_score": "",
            "grammar_score": "",
            "character_score": ""
        },
        "views": {
            "total_views": "12,983,043",
            "average_views": "54,322",
            "followers": "13,849",
            "favorites": "7,578",
            "ratings": "5,010",
            "page_views": "4,585"
        }
    },
    "metadata_hash": "0609d224c37dce36a330014b36fa05bef4c42cca39f48c8e47f249d6dbe8fde1",
    "created_at": "2025-12-03T18:27:49.055934",
    "updated_at": "2025-12-03T18:27:49.055934",
    "last_synced_at": null,
    "reviews": [
        {
            "review_id": "2839515",
            "title": "What the teenage hormones is this?",
            "time": "18:12 27/11/2025",
            "content": "What the teenage hormones is this?\nREVIEWED AT: 9. A casual visit\nBY Jacob Gamber\n18:12 27/11/2025\n\nI want to preface this by saying I have nothing against the author whatsoever. Props on the success, and I'm sure the story gets a lot better... but I just could not make it past the first chapter. It reads like the fanfiction fever dream of a 15-year-old who stayed up too late binge-reading Nevernight. The purpleness of the writing style is through the roof, and this girl is somehow melting at the sight of every male, which is described in painful over-emotional, unrealistic detail... And then the setting makes absolutely no sense, with the historical (?) hints that clearly show rudimentary historical knowledge at best on the author's part.\n\nKudos to you who have slogged through writing like this, but I could not.\n\n Report",
            "user_id": "479657",
            "chapter_id": "396969",
            "story_id": "26675",
            "score_id": "2839515_score",
            "_id": 