{
  "storyId": "301925150",
  "storyName": "WANDERLUST: Romance in F Minor",
  "storyUrl": "https://www.wattpad.com/story/301925150-wanderlust-romance-in-f-minor",
  "coverImg": "https://img.wattpad.com/cover/301925150-256-k954895.jpg",
  "category": null,
  "status": "completed",
  "tags": [],
  "description": "To Kade Sanford Black, falling for his best friend Xanthie Lorenz, a serious and drop-dead handsome songwriter, was a line he did not want to cross. Knowing all too well the huge possibility of losing the only person who could see through him, he took a step back and put a distance to sustain their friendship - especially since Xanthie is soon to marry.\n\nWill Kade be able to hold back his feelings until he sees Xanthie married? Or will he finally have the courage to confess his feelings...and risk losing the only friend he has? \n\nWARNING: This story contains depictions of suicide, self-harm, and mental health crises that may be upsetting for some readers. Any depictions of mental health issues herein are not meant as a replacement for medical care. If you or someone you know deals with similar issues, they should seek the help of a medical professional. Reader discretion is advised. If you or someone you know in the U.S. is contemplating suicide, please encourage them to call 988 or visit 988lifeline.org. For international resources, please visit: http://www.suicide.org/hotlines/international-suicide-hotline s.html\n\nCECELIB | C.C. \nCover by Ren Tachibana",
  "totalChapters": 64,
  "totalViews": 6832836,
  "voted": 340465,
  "mature": true,
  "freeChapter": false,
  "time": "2022-02-17T00:02:29Z",
  "userId": "CeCeLib",
  "chapters": [
    {
      "chapterId": "1446085050",
      "storyId": "301925150",
      "chapterName": "✨ CeCeLib's 10th Anniversary Event ✨",
      "voted": 277,
      "views": 22807,
      "order": 0,
      "publishedTime": "2024-05-24T07:04:03Z",
      "lastUpdated": "2024-05-24T14:27:26Z",
      "chapterUrl": "https://www.wattpad.com/1446085050-wanderlust-romance-in-f-minor-%E2%9C%A8-cecelib%27s-10th",
      "commentCount": 26,
      "wordCount": 117,
      "rating": 0,
      "pages": 1
    }
  ]
}