{
  "storyId": "328509109",
  "storyName": "The Hookup Pact",
  "storyUrl": "https://www.wattpad.com/story/328509109-the-hookup-pact",
  "coverImg": "https://img.wattpad.com/cover/328509109-256-k905609.jpg",
  "category": null,
  "status": "completed",
  "tags": [],
  "description": "When Evelyn and her long-term enemy, star hockey captain Atlas, are forced to work together on a university media project, sparks fly as resisting their attraction becomes a far bigger challenge than their opposing opinions.\n\nStandalone in the Wellsfield University Series\n\n*****\n\nEvelyn Hayes has hated Atlas Griffin, the golden boy of their university hockey team, since their very first conversation three years ago. To Evelyn, he's the womanizing, arrogant epitome of rich privilege and everything she despises. So when a university-funded media project for the hockey team throws her into Atlas' orbit, she fully expects them to be at each other's throats. \n\nWhat she doesn't expect is for the snarky comments and daring glares to turn into sparks of undeniable attraction. With Atlas' sights set on the NHL and Evelyn desperate to keep the media lead position she's worked so hard for, neither is interested in anything complicated. Soon, a heated one-night stand leads to an enemies-with-benefits hookup pact. But is either ready to face the consequences when the lines blur and strings start to get attached?",
  "totalChapters": 51,
  "totalViews": 3256373,
  "voted": 66671,
  "mature": true,
  "freeChapter": false,
  "time": "2022-12-06T09:41:06Z",
  "userId": "fleuresmell",
  "chapters": [
    {
      "chapterId": 1440975081,
      "storyId": "328509109",
      "chapterName": "50| Atlas: I thanked my lucky stars",
      "voted": 610,
      "views": 29340,
      "commentCount": 798,
      "wordCount": 3696,
      "publishedTime": "2024-07-05T14:00:03Z",
      "lastUpdated": "2024-07-16T22:49:31Z",
      "chapterUrl": "https://www.wattpad.com/1440975081-the-hookup-pact-50-atlas-i-thanked-my-lucky-stars",
      "rating": 0,
      "pages": 5,
      "order": 0
    }
  ]
}