{
  "storyId": "345904534",
  "storyName": "In My Neighbor's Bed",
  "storyUrl": "https://www.wattpad.com/story/345904534-in-my-neighbor%27s-bed",
  "coverImg": "https://img.wattpad.com/cover/345904534-256-k322457.jpg",
  "category": null,
  "status": "completed",
  "tags": [],
  "description": "Maggie thought she was content with her serviceable marriage, but when a new neighbor awakens the hidden passion inside of her, she must make an impossible choice: risk it all and follow her heart or lose her brother forever.\n\nSeason 1 of In My Neighbor's Bed \n\n***\n\nMaggie Henderson is a housewife living in your typical picture-perfect suburb. A handsome husband, friendly neighbors, and a peaceful life. What more could a girl ask for? Too bad it's all a lie. \n\nIn reality, her husband is a manipulative jerk who uses a prenup and her terminally ill brother to keep her from leaving, her neighbors are as fake as a three-dollar bill, and her \"peaceful life\" is actually boring as hell. \n\nBut that all changes when the new guy, Mason Kendall, moves in across the street. What starts as a sexy game soon turns into a full-fledged affair. But as feelings bloom beneath the surface, the stakes in their little game become higher than ever before. What will she choose? A new life with her lover? Or the life of her dying brother?\n\n***\n\n\"You're going to kill me at this rate,\" he grumbled.\nI had to repress a giggle as I feigned ignorance. \"What do you mean? Am I too heavy? Should I get off?\"\n\"Don't worry, I'll take care of getting you off,\" he murmured, sliding his hands under my shirt.",
  "totalChapters": 96,
  "totalViews": 1940676,
  "voted": 25041,
  "mature": true,
  "freeChapter": false,
  "time": "2023-07-05T11:09:25Z",
  "userId": "RipperGirl88",
  "chapters": [
    {
      "chapterId": "1561951926",
      "storyId": "345904534",
      "chapterName": "Ch. 95: Epilogue Part 2",
      "voted": 67,
      "views": 1560,
      "order": 0,
      "publishedTime": "2025-09-29T17:00:02Z",
      "lastUpdated": "2025-10-21T16:41:03Z",
      "chapterUrl": "https://www.wattpad.com/1561951926-in-my-neighbor%27s-bed-ch-95-epilogue-part-2",
      "commentCount": 9,
      "wordCount": 2326,
      "rating": 0,
      "pages": 2
    }
  ]
}