{
  "storyId": "347718219",
  "storyName": "Costantino | A Mafia Romance (Complete)",
  "storyUrl": "https://www.wattpad.com/story/347718219-costantino-a-mafia-romance-complete",
  "coverImg": "https://img.wattpad.com/cover/347718219-256-k372666.jpg",
  "category": null,
  "status": "completed",
  "tags": [],
  "description": "Forced into a marriage neither of them wanted, a fierce Greek mafia princess and a ruthless Sicilian underboss must navigate a storm of power, passion, and betrayal-only to discover that their greatest battle might be against their own hearts.\n\n***\n\nThey hated each other from the moment they met, but little did they know, they were destined to be together.\n\nMillicent Rhea Darmos: Princess of the Greek Mafia. At 25 years old, she's established herself as a self proclaimed boss bitch, running her own publishing company. But now it's time she fulfils her duty to her family's organisation. It's time she gets married.\n\nCostantino Salvatore Accardi: Underboss and Heir to the Sicilian Mafia. At 28 years old, he has no interest in settling down-he already has it all. He believes in family above all, so why bring in an outsider?\n\nYet, after a strange string of events, the two of them find themselves thrust into married life. It's full of chaos, drama and all kinds of tension. The question is, how do they survive their marriage and the storm that follows?\n\n***\n\n\"I've never kissed anyone.\" My voice trembled with a tinge of vulnerability - something I hated. But Costa didn't seem to mind that I was nervous or anxious.\n\n\"Good. You're mine.\" He spoke so seriously, without a flicker of doubt as he took my hand in his. \"So you want it be special, principessa?\"\n\n\"Every girl's first kiss is special.\" I whispered, watching as he brought my hand up to his lips. \n\n\"I only care about yours.\"",
  "totalChapters": 56,
  "totalViews": 17314676,
  "voted": 426031,
  "mature": true,
  "freeChapter": true,
  "time": "2023-07-26T12:00:19Z",
  "userId": "byzahra_xo",
  "chapters": [
    {
      "chapterId": 1546900281,
      "storyId": "347718219",
      "chapterName": "Rocco has arrived 👀",
      "voted": 1331,
      "views": 94686,
      "order": 0,
      "publishedTime": "2025-06-02T13:11:05Z",
      "lastUpdated": "2025-06-02T13:11:07Z",
      "chapterUrl": "https://www.wattpad.com/1546900281-costantino-a-mafia-romance-complete-rocco-has",
      "wordCount": 59,
      "rating": 0,
      "commentCount": 163
    }
  ]
}