{
  "storyId": "363005447",
  "storyName": "Just One Kiss",
  "storyUrl": "https://www.wattpad.com/story/363005447-just-one-kiss",
  "coverImg": "https://img.wattpad.com/cover/363005447-256-k402938.jpg",
  "category": null,
  "status": "completed",
  "tags": [],
  "description": "Enjoy this story free for a limited time.\n\nWhen Farrah Blake let's slip that she wants to lose her virginity this summer, she doesn't expect her childhood best friend, trust-fund baby Ethan Sinclair, to offer her a deal: if he doesn't find a nice guy for her by the end of their joint family vacation, he'll take her virginity himself.\n\nStandalone in the Just One Kiss series\n\n***\n\nFarrah Blake is dead-set on losing her virginity as soon as she can, so when the guy she's had a crush on for as long as she remembers offers his help, she can do nothing but accept. Ethan Sinclair has been in her life forever - he's her best friend, just like his mother is her own mother's best friend, and their families go on a joint vacation to the lake house every year.\n\nEthan Sinclair is out of time. His parents have arranged his marriage, just as they arranged his brothers. At the end of their summer vacation, he'll be expected to propose to a woman he barely knows. One last summer of freedom, one last chance to do whatever he wants - and he wants nothing more than to make sure his best friend loses her virginity in the most positive way possible, even if that means hiding his upcoming engagement from her.\n\nBut as time goes on, and feelings grow, will Ethan follow his family, or his heart?",
  "totalChapters": 41,
  "totalViews": 912859,
  "voted": 19439,
  "mature": true,
  "freeChapter": false,
  "time": "2024-02-15T17:06:15Z",
  "userId": "lost-blueberries",
  "chapters": [
    {
      "chapterId": 1498622297,
      "storyId": "363005447",
      "chapterName": "Ch. 40: Just One Finale",
      "voted": 326,
      "views": 11823,
      "commentCount": 290,
      "wordCount": 3002,
      "publishedTime": "2025-01-06T18:02:04Z",
      "lastUpdated": "2025-01-21T12:53:19Z",
      "chapterUrl": "https://www.wattpad.com/1498622297-just-one-kiss-ch-40-just-one-finale",
      "rating": 0,
      "pages": 4,
      "order": 0
    }
  ]
}