{
  "storyId": "373719707",
  "storyName": "Love For Sale",
  "storyUrl": "https://www.wattpad.com/story/373719707-love-for-sale",
  "coverImg": "https://img.wattpad.com/cover/373719707-256-k490115.jpg",
  "category": null,
  "status": "completed",
  "tags": [],
  "description": "When Adrianna stands to lose everything after pushing her wealthy father too far with her wild behaviour, she goes to the one person she believes might save her: her brother's best friend. There's just one problem - they despise each other.\n\nSeason 1 of Binding Contracts\n\n***\n\nAdrianna faces a tough decision: find a husband her father approves of to save her family's reputation, or risk losing everything she cares about. To her dismay, her brother suggests she marry his best friend, Xander, who has earned her father's respect over the years. Despite their hatred for each other, Adrianna reluctantly tries to convince Xander, even offering part of her inheritance to sway him. \n\nTheir past quickly makes things difficult - Adrianna used to mock Xander for being poor, which hurt him deeply. Seeing Adrianna beg, he bargains with her to accept the proposal. But how are they to fool the public - and her father - when they can't stand to be in the same room? As they spend more time together, old animosity slowly turns to attraction. And soon, Adrianna and Xander are forced to face the past, and their future, with the pressure of a fake engagement looming over their heads. What is real, and what is for the contract?",
  "totalChapters": 54,
  "totalViews": 50943,
  "voted": 1016,
  "mature": true,
  "freeChapter": false,
  "time": "2024-07-24T14:02:44Z",
  "userId": "AngelW",
  "chapters": [
    {
      "chapterId": "1560103579",
      "storyId": "373719707",
      "chapterName": "Chapter 53",
      "voted": 11,
      "views": 374,
      "order": 0,
      "publishedTime": "2025-09-05T17:00:03Z",
      "lastUpdated": "2025-09-05T17:00:02Z",
      "chapterUrl": "https://www.wattpad.com/1560103579-love-for-sale-chapter-53",
      "commentCount": 9,
      "wordCount": 1801,
      "rating": 0,
      "pages": 2
    }
  ]
}