{
  "storyId": "388206999",
  "storyName": "No Second Chances",
  "storyUrl": "https://www.wattpad.com/story/388206999-no-second-chances",
  "coverImg": "https://img.wattpad.com/cover/388206999-256-k434744.jpg",
  "category": null,
  "status": "ongoing",
  "tags": [],
  "description": "In order to go on holiday with their friends, mortal enemies Kai and Joey make a pact to be civilized with each other for the entire duration of the stay. Joey already thinks this is going to be the hardest thing she's ever had to do in her life...and then she learns that they have to share a room.\n\nStandalone in the Just One Kiss series \n\nOn December 8, content from chapter 7 onwards will only be available to redeemers. Now's the time to catch up to the story and read it while it's free! Already purchased a chapter? No worries-you won't need to pay for it again.\n\n***\n\nWhen her friends decide to plan a group holiday for the summer, Joey Winters doesn't expect the one person she hates the most to be a part of the plan, and she certainly won't let being around Kai Rutherford affect her rules: never forgive, never forget, and never fall in love.\n\nNot only does she have to breathe the same air as him, she's expected to share a room - and a bed - with him too. Determined to make this work, Joey and Kai enter into a pact: they have to be civilized with each other all summer. If they don't, their friends will force them to stay in the creepy cabin included in their rental. Alone.\n\nBetween passive aggressive compliments, late night arguments, and moments of confusing sincerity, Joey starts to wonder if she's had Kai wrong all along. And, just maybe, her friends will finally find out why she really hates him.\n\n***\n\nWeekly updates on Mondays. Wait & read for free, or unlock with coins-the choice is yours!",
  "totalChapters": 44,
  "totalViews": 213614,
  "voted": 5405,
  "mature": true,
  "freeChapter": false,
  "time": "2025-01-14T15:13:44Z",
  "userId": "lost-blueberries",
  "chapters": [
    {
      "chapterId": "1584613810",
      "storyId": "388206999",
      "chapterName": "Ch. 43: No Skydiving",
      "voted": 70,
      "views": 780,
      "order": 0,
      "publishedTime": "2025-11-24T18:00:02Z",
      "lastUpdated": "2025-11-24T18:00:02Z",
      "chapterUrl": "https://www.wattpad.com/1584613810-no-second-chances-ch-43-no-skydiving",
      "commentCount": 41,
      "wordCount": 2680,
      "rating": 0,
      "pages": 4
    }
  ]
}