{
  "storyId": "389097748",
  "storyName": "The Only Girl of Class E | Ang Mutya ng Section E: English Version",
  "storyUrl": "https://www.wattpad.com/story/389097748-the-only-girl-of-class-e-ang-mutya-ng-section-e",
  "coverImg": "https://img.wattpad.com/cover/389097748-256-k992145.jpg",
  "category": null,
  "status": "completed",
  "tags": [],
  "description": "Jay-jay only wants simple things in life-to be far from trouble and experience a normal high school life. But now that she's placed in an all-boys classroom, will Jay-jay be able to stick to her word?\n\nEnglish version of the hit series Ang Mutya Ng Section E. Watch the TV series adaptation now exclusively on the Viva One app!\n\nSeason 1 of The Only Girl of Class E (Ang Mutya ng Section E: English Version)\n\n***\n\n\nWhen Jasper Jean Mariano transferred to HVIS, she promised herself to stay away from trouble and do everything in her power for her high school life to be as normal as possible. But in a strange twist of fate, she gets into Section E, where she is the only girl in class. Even though it's only the start of the year, she has gotten nothing but headaches and embarrassment. Now that she's surrounded by her troublemaker classmates, she is stuck between a rock and a hard place. Will she be able to live her normal life and stay away from her destructive ways even if her patience is wearing thin? Or will she join the chaos if it meant the safety of her friends?",
  "totalChapters": 129,
  "totalViews": 2050445,
  "voted": 24829,
  "mature": true,
  "freeChapter": false,
  "time": "2025-01-31T07:33:53Z",
  "userId": "eatmore2behappy",
  "chapters": [
    {
      "chapterId": "1531966433",
      "storyId": "389097748",
      "chapterName": "CHAPTER 125.3: New Year, New Hmmm",
      "voted": 171,
      "views": 14530,
      "order": 0,
      "publishedTime": "2025-04-11T13:27:50Z",
      "lastUpdated": "2025-04-11T13:27:50Z",
      "chapterUrl": "https://www.wattpad.com/1531966433-the-only-girl-of-class-e-ang-mutya-ng-section-e",
      "commentCount": 36,
      "wordCount": 2081,
      "rating": 4,
      "pages": 3
    }
  ]
}