{
    "id": "44590",
    "name": "Imperial Academy",
    "url": "https://www.royalroad.com/fiction/44590/imperial-academy",
    "cover_image": "data\\images\\44590_cover.jpg",
    "category": "Original",
    "status": "INACTIVE",
    "tags": [
        "Progression",
        "Male Lead",
        "Adventure",
        "Fantasy",
        "High Fantasy",
        "Magic"
    ],
    "description": "Higher than a commoner and lower than most nobles, Morgan Kiath is unable to fit in amongst the other students and even after a few dull months at the Imperial Academy he has not made a single friend. Yet his monotone life is about to change when he meets Marith Sian a thoughtless foreigner with little regard for Imperial traditions and hierarchy. In no time at all Morgan’s rather bleak existence is given colour by Marith and the friends that are inexplicably drawn in around the foreigner. Soon Morgan even meets his future master, the enigmatic Archmage Aspartos Mudreth and once more his life shifts in direction.\nFollow Morgan on his rather unexpected journey as he attends the Imperial Academy, fights an incurable disease and is apprenticed to an Archmage who is more than a little out of the ordinary.",
    "total_views": "14,058",
    "average_views": "502",
    "followers": "43",
    "favorites": "10",
    "ratings": "15",
    "page_views": "388",
    "overall_score": "",
    "style_score": "",
    "story_score": "",
    "grammar_score": "",
    "character_score": "",
    "reviews": [
        {
            "review_id": "2446454",
            "title": "Great First Novel!!",
            "time": "08:26 17/2/2025",
            "content": "Great First Novel!!\nREVIEWED AT: Chapter 17\nBY Fafner\n08:26 17/2/2025\n\nI absolutely loved this novel!! While it could have used another read through for proofreading, it had wonderful characters and a great plot! I enjoyed the story of a teenage boy going off to university to make his way in the world. I also bought the book on Amazon. Hopefully, the author will write a sequel someday.\n\n Report",
            "user_id": "501368",
            "chapter_id": "715047",
            "story_id": "44590",
            "score_id": "2446454_score",
            "_id": 