{
    "id": "44783",
    "name": "Twilight Neverland",
    "url": "https://www.royalroad.com/fiction/44783/twilight-neverland",
    "cover_image": "data\\images\\44783_cover.jpg",
    "category": "Original",
    "status": "DROPPED",
    "tags": [
        "Urban Fantasy",
        "Psychological",
        "Multiple Lead Characters",
        "Action",
        "Fantasy",
        "Mystery",
        "Female Lead",
        "Low Fantasy",
        "Magic",
        "Male Lead",
        "School Life",
        "Supernatural"
    ],
    "description": "A world without words — is a dull one.\n\nWords brought about communication. It brought forth harmony and conflict. For a world to exist without it, it would bring about melancholy. There would be no noise.\n\nZachary Ashworth aspires to be a brilliant author one day. However, one problem lies ahead of him. After years of desiring nothing but to shun out people and their noise, he can no longer see the world, for it’s only colorless.\n\n\"A wish for faint light. A wish for greater blight. By the by, do you crave desire?\" Said the faceless man hanging from the ceiling.\n\nThis was a story for a wonderland.\n\nCover and Art Illustrated by Hayato Noda",
    "total_views": "15,124",
    "average_views": "378",
    "followers": "20",
    "favorites": "6",
    "ratings": "10",
    "page_views": "356",
    "overall_score": "",
    "style_score": "",
    "story_score": "",
    "grammar_score": "",
    "character_score": "",
    "reviews": [
        {
            "review_id": "1079286",
            "title": "Definitely something different but worth a read",
            "time": "01:10 2/8/2021",
            "content": "Definitely something different but worth a read\nREVIEWED AT: Arc 0: Prelude 13 - Adrift the Ocean\nBY Arthur-67\n01:10 2/8/2021\n\nOverall great job\n\nFirst thing- unrelated to the actual story is you should space out your updates more. Most are all done in one day and therefore you are greatly reducing your exposure to new people. One chapter a day would mean you are on the new updates section each day instead of like once a week as you are currently. \n\nSecondly, I loved the picture in the first chapter, it looked really good. Nice way to start off.\n\nGrammar\n\nA few mistakes here and there e.g.'it hasn't been a few minutes since she started writing. 'Cladded in armour'. But these are all quite small and easily missed by authors who are very familiar with their work. A quick run-through of Grammarly or word to speech would likely catch them all. I should probably also follow my own advice here aswell lol.\n\nStyle\nThe style is quite poetic at the start which is different but quite nice to read.  Something I've never really read before. It's unique but might make your story more of a niche than it already is. It is a mix of past and presents tense but still written well enough to be more than readable.\n\nSome phrases could do with a little tweaking as they seem to interrupt the flow of the story. 'dozed off in his own daydream of thought,\n he woke up when he realized Lauren was no longer by his side,. Just a few bits and bobs here and there to help the flow.\n\nThe first chapter heavily favoured tell but it does balance out with a nice mix of dialogue and description later on.\n\nStory\nIt starts off all fantasy-like, with swordsmen and knights. A raging battle etc. Then the next moment it becomes a modern-day school setting,\n.It was like I was reading a different novel entirely in its style. Especially since the characters had names here. There are a lot of puzzling questions- was the first part his dream or some giant metaphor. It is definitely through-provoking\nand I am definitely curious to see how it will all link in together.\n\nCharacter\nWe don't really get any character names until later on. It sort of reminded me of the goblin slayer novel in that aspect. The lack of names does make it somewhat harder to feel a connection to the characters. As does the style. However, as I read more and learnt more about them, I still did find myself enjoying the characters.\n\n Report",
            "user_id": "192625",
            "chapter_id": "724142",
            "story_id": "44783",
            "score_id": "1079286_score",
            "_id": 