{
    "id": "54508",
    "title": "The Unexpected Engagement of the Marvelous Mr. Penn",
    "fiction_url": "https://www.royalroad.com/fiction/54508/the-unexpected-engagement-of-the-marvelous-mr",
    "cover_image_local": "data\\images\\54508_cover.jpg",
    "author": "rkgoff",
    "category": "Original",
    "status": "COMPLETED",
    "tags": [
        "Adventure",
        "Historical",
        "Mystery",
        "Romance Subplot"
    ],
    "description": "In May, 1899, a hundred and fifty unassuming envelopes are delivered to households across the city. Most of them will be picked up by butlers and carried on silver trays to their recipients. All of them contain invitations to the wedding of Lady Eleanor Serrs to Mr. Ryce Penn. When the newspapers hear about it, they start buzzing. Who can blame them? This would be the wedding of the century! She’s the daughter of Duke Erravold Aubrey-Serrs, and the Marvelous Mr. Penn is one of the most famous men in the country.\n\nBut Penn is famous for being the city’s most notorious thief. He’s an unrepentant attention-seeker with a taste for gems and danger. And Eleanor swears that she’s never met him.\n\nChief Inspector Lucas Haley, Penn’s long-time nemesis, is called in to protect the Aubrey-Serrs family and try to figure out what the master thief is planning. He’ll need all his experience and tenacity for this case, as it quickly becomes obvious more is at stake than the reputation of an innocent woman.",
    "stats": {
        "score": {
            "overall_score": "",
            "style_score": "",
            "story_score": "",
            "grammar_score": "",
            "character_score": ""
        },
        "views": {
            "total_views": "375,978",
            "average_views": "7,673",
            "followers": "1,225",
            "favorites": "729",
            "ratings": "537",
            "page_views": "362"
        }
    },
    "metadata_hash": "8d3cc77b3da37f1e5c747b13fe02ee1485211e12953840749c113d8ca4037ada",
    "created_at": "2025-12-03T18:21:12.276319",
    "updated_at": "2025-12-03T18:21:12.276319",
    "last_synced_at": null,
    "reviews": [
        {
            "review_id": "2582951",
            "title": "As Marvelous as Mr. Penn Himself",
            "time": "02:48 28/5/2025",
            "content": "As Marvelous as Mr. Penn Himself\nREVIEWED AT: Epilogue\nBY Confused Pigeon Noises\n02:48 28/5/2025\n\nThe Unexpected Engagement of the Marvelous Mr. Penn is not the usual story you find on Royal Road, but don't let that fool you. This story has the quality of a fully published book, the kind of delightful read employees would recommend in a bookstore.\n\n\nThis story's premise is intriguing and unique, but above all else, the characters are its treasure, larger than life and full of love (minor spoilers). We see the witty newspaper writings of Mr. Penn, Master Thief. The clever but sheltered Lady Eleanor, as well-read as Sherlock himself. The bombastic father, full of love and anger. The persistent Detective Harley, stuck in his cat & mouse chase of the master thief.\n\nI can't recommend it enough. I suggest you find a comfy chair, preferably on a rainy afternoon, grab a spot of tea, and start reading.\n\n Report",
            "user_id": "157669",
            "chapter_id": "943712",
            "story_id": "54508",
            "score_id": "2582951_score",
            "_id": 