{
    "id": "5580",
    "name": "Yuiitsu and Sei",
    "url": "https://www.royalroad.com/fiction/5580/yuiitsu-and-sei",
    "cover_image": null,
    "author": "Aileri",
    "category": "Original",
    "status": "INACTIVE",
    "tags": [
        "Comedy",
        "Strong Lead",
        "Action",
        "Adventure",
        "Fantasy",
        "Gender Bender"
    ],
    "description": "Two worlds stand at the brink of collapse. One world's mana continue to decrease at a dangerous pace, slowly destroying the lands without anyone knowing it. Another has so much mana, that those who are weak to mana are slowly dying due to mana intoxication. The goddess could stand it no longer, so she made a choice, one that will change the two worlds forever. Shorter Synopsis: Op protagonist in fantasy world the end :V Warning: I'm a terrible writer and this'll probably give you cancer, so shoo! EDIT: This'll FOR SURE give you cancer, so shoo!",
    "stats": {
        "score": {
            "overall_score": "",
            "style_score": "",
            "story_score": "",
            "grammar_score": "",
            "character_score": ""
        },
        "views": {
            "total_views": "55,802",
            "average_views": "3,488",
            "followers": "207",
            "favorites": "52",
            "ratings": "23",
            "page_views": "97"
        }
    },
    "reviews": [
        {
            "review_id": "50920",
            "title": "Gender Bender lover here :D",
            "username": "brian007",
            "at_chapter": "",
            "time": "3/17/2016, 8:03 PM",
            "content": "Gender Bender lover here :D\nBY brian007\n3/17/2016, 8:03 PM\n\nGood Job, Keep it Up !!                                                                        \n\n Report",
            "score": {
                "overall": "Overall",
                "style": "",
                "story": "",
                "grammar": "",
                "character": ""
            }
        },
        {
            "review_id": "64447",
            "title": "fuck shit.. i hate the characters",
            "username": "wraith26",
            "at_chapter": "",
            "time": "7/7/2016, 7:09 AM",
            "content": "fuck shit.. i hate the characters\nBY wraith26\n7/7/2016, 7:09 AM\n\nits great and all but the characters is goddamn annoying!!! they all act dumb and stupid.. sometimes illogical beyond compare.. its really annoying seeing their attitude ...\n\n Report",
            "score": {
                "overall": "Overall",
                "style": "",
                "story": "",
                "grammar": "",
                "character": ""
            }
        },
        {
            "review_id": "50885",
            "title": "this is good.",
            "username": "waimer",
            "at_chapter": "",
            "time": "3/17/2016, 11:22 AM",
            "content": "this is good.\nBY waimer\n3/17/2016, 11:22 AM\n\nTerrible writer? I can't agree with you.\n\nI like you job so, please, update more.\n\n \n\n \n\nBtw. Greath work with that mc.\n\n Report",
            "score": {
                "overall": "Overall",
                "style": "",
                "story": "",
                "grammar": "",
                "character": ""
            }
        },
        {
            "review_id": "51697",
            "title": "My new Fav",
            "username": "sad860",
            "at_chapter": "",
            "time": "3/25/2016, 3:34 AM",
            "content": "My new Fav\nBY sad860\n3/25/2016, 3:34 AM\n\nThe idea may not be completely original but it is refreshing to see. I can only hope more chapters are released not each day but not the point it feels like it's dropped either because I'm enjoying the series to much to see it vanish from RR.\n\n Report",
            "score": {
                "overall": "Overall",
                "style": "",
                "story": "",
                "grammar": "",
                "character": ""
            }
        },
        {
            "review_id": "51546",
            "title": "Its unique",
            "username": "overpalada",
            "at_chapter": "",
            "time": "3/24/2016, 12:30 AM",
            "content": "Its unique\nBY overpalada\n3/24/2016, 12:30 AM\n\nThe story is interesting and the fact that the mc is one person in two bodies is really unique\n\n Report",
            "score": {
                "overall": "Overall",
                "style": "",
                "story": "",
                "grammar": "",
                "character": ""
            }
        }
    ],
    "chapters": [
        {
            "id": "56803",
            "name": "Prologue Yuiitsu and Sei",
            "url": "https://www.royalroad.com/fiction/5580/yuiitsu-and-sei/chapter/56803/prologue-yuiitsu-and-sei",
            "content": "Prologue\n\nIn a grand arena, three figures are seen fighting.\n\nOn one side is two twin little girls around the age of 12, with closed eyes, a blade in each hand, black and white long hair flowing down their head respectively. The white haired girl wore a pretty white dress filled with black frills, making her look like an cute adorable angel, while the other black haired girl wore a pretty black dress of the same design with white frills.\n\nThe blades in their hands are both black and white respectively and with 5 rings on each hand, a beautiful golden pendant around their necks, their impeccable timing with each other made it look like the dance of two fairies.\n\nOn the opposite side, was a gigantic golden dragon, the pressure that he gave out did not make him feel like a king, nor a emperor, but instead, that of a god.\n\nThe golden scales that looked like it could repel any attack, the golden sharp claws that looked like it could slash through everything and with a pair of gigantic horns on his head, they fought.\n\nBut now, the golden scales have lost its shimmer, the sharp claws have become dull, and one of his two great horns was cut off, making him look like a wounded beast.\n\nThe two girls, however, look completely fine with not a single cut on their skin, but that is not really the case, because if you look on top of their heads, a single hp bar is shown which has been drained until 5%.\n\nBoth sides were at death’s door and the next attack would decide it all.\n\nThe dragon flapped its two great wings and prepared itself to end it all in his next attack, the mana gathered in its mouth was such a great amount that it actually looked like it was distorting the air around him.\n\nSeeing this, the player controlling the girls decided to use his trump card too. The eyes of the two girls instantly sprung open revealing a symbol of a balance in each one and a gigantic black and white wing grew out of their back respectively. One wing on each of them, meaning they had to flap at the perfect time or else they’ll plummet to the earth below.\n\nFlying into the sky, every one of their move was the same as the dragons, from a the movement of a finger, to the blinking of the eyes, everything was exactly the same.\n\nThe dragon, noticed this, but did not know what they were planning to do because obviously, they as humans cannot copy a dragon’s breath attack.\n\nAs he gathered more and more mana, the girls did the exact same in their mouth, and instantly, the dragon knew something was wrong. Humans were not supposed to have the dragon’s breath attack nor could their body endure the recoil to use it, but it’s already too late now, so he gambled everything on this one attack.\n\n[Divine Obliteration]\n\n[God’s Scale]\n\nThe Golden Ray was the dragon’s ultimate attack. Simple yet powerful. Gathering all his mana into his mouth and blasting it off with all his might, the most destructive attack he had. Mixed with his own special energy Golden Divine Energy, which only he is supposed to have, it can be considered the strongest attack in the world that can even kill middle to higher rank gods.\n\nThe twin girls however, did exactly the same. By imitating every move of the dragon, from his breathing, blinking to his fidgeting and flapping of the wing, they copied everything and what they did not have, they created with their powers just so they can copy the dragon.\n\nThe author's tale has been misappropriated; report any instances of this story on Amazon.\n\nAnd with every move copied perfectly, they used God’s Scale, an ability that lets them fire the exact same attack with the exact same force, but if they miss a single movement, the magic would not fire and they would be sitting ducks.\n\nLuckily, or rather skillfully, they copied every movement perfectly and perfectly fired the same beam back at the dragon.\n\nAs the two beams of equal strength collided, the arena started to crumble, the ground cracked, the air shook and everything was falling apart.\n\nAs the beam slowly died down on both sides, the twins readied their next attack, but the dragon could not move. It used all its mana in that one attack leaving it with nothing left, but the girls still had some. No they did not have any left, but using their powers they converted what little hp they had into mana.\n\nSeeing this, the dragon smiled, it was not a smile of arrogance thinking how could such a small attack beat me, but instead, it was the smile of a warrior that has finally met it’s match.\n\n[Ying Yang Blast]\n\nIt just floated there in the sky and watched as the ball mixed with light and dark magic came flying at it. It did not try to evade, nor did it struggle, it just floated there in all its majestic glory.\n\nAnd as the magic hit him, the little hp he had left were gone.\n\nThe dragon shattered into a million pieces of light that fell from the sky.\n\nThe virtual reality game’s final boss Dragon God Daeneries was defeated.\n\nAnd the player behind the twin girls that defeated it, mysteriously disappeared at the exact same time.\n\n---\n\nAs I opened my eyes, the first thing I thought was where the hell am I. The last thing I remember was playing the famous game called Elenair fighting the final boss of the Tower of God which was said to have been undefeated in the 5 years since the game began.\n\nEven the strongest players couldn’t solo it with its ability to fly and ultimate attack that cannot be blocked and has to be dodged, it’s said to be unbeatable.\n\nI remember I just beat it after 2 hours of hard work and now my head hurts like hell.\n\n“I have a request for you, will you become a guardian of the gates?”\n\nAn angelic voice? Where’s it coming from.\n\nAs I looked up I saw a blonde woman wearing what could be called a simple white dress, but on her it radiated holiness. Her beautiful figure with her beautiful face made her the perfect definition of a goddess.\n\nLooking at her I was stunned speechless, I mean why would such a beauty be in my room…\n\nWait…\n\nLooking around, I’m in a white space, and when I turned, I saw another beautiful girl’s face. One in each of my vision. They looking identical, but the different dresses made them easy to distinguish.\n\nMoving my arm to see if it’s real, both girls with did the same thing at the same time.\n“”WHAT THE HELL!?”\"",
            "comments": [
                {
                    "comment_id": "556393",
                    "username": "Chiisutofupuru",
                    "comment_text": "Tell me to shoo, hmgh.\nI only read the first line though and have a question:\nQuote:\nIn a grand arena, three figures are seen fighting.\nWho sees these three figures fighting? *Curious*",
                    "time": "2016-03-04T07:57:56.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "556715",
                    "username": "Aileri",
                    "comment_text": "There are many answers to your question\nsome call him blah\nothers may call him bob\nbut I, I call him\nsir isasius neutonia plantonic quabula franchesca le deur the talina abrica dabra eriousoulus...\nSHUT UP CARL\nthe 42nd meaningeus du laifu\nGOD DAMMIT CARL!\nif you want a serious answer...",
                    "time": "2016-03-04T17:11:45.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "557014",
                    "username": "Aileri",
                    "comment_text": "ok a more serious answer, this is a MMORPG boss fight, so it's going to be seen by the other players in the real world. Sorry no enigmatic figure for you here ^.^",
                    "time": "2016-03-04T22:58:18.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "569862",
                    "username": "Nanashikun",
                    "comment_text": "That was interesting, Kuma!",
                    "time": "2016-03-15T17:50:53.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "570296",
                    "username": "udin-san",
                    "comment_text": "ohh, it's looking good~",
                    "time": "2016-03-16T01:43:07.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "993620",
                    "username": "Tedious",
                    "comment_text": "interesting loli heh",
                    "time": "2017-03-24T22:54:42.0000000+00:00",
                    "replies": []
                }
            ]
        },
        {
            "id": "56936",
            "name": "Chapter 1: Gone",
            "url": "https://www.royalroad.com/fiction/5580/yuiitsu-and-sei/chapter/56936/chapter-1-gone",
            "content": "Chapter 1: Gone\n\nTwo angelic voices in perfect sync came out from the two girls mouths.\n\nThe girl two girls looked exactly the same, yet different. Where one was white, the other was black and where one had black, the other had white.\n\n“Ah yes, those are the bodies you created and strengthened to the point where it allowed you to defeat a god.”\n\nThe goddess once again spoke, and instantly I remembered. The face, it’s the exact same one as the game. The closed eyes, the beautiful smooth pale skin, the perfectly proportional face and the silky lone hair, it’s the same one I created 5 years ago!\n\nI turned my vision back to the goddess to ask.\n\n“”Why am I here?””\n\nHer face did not change, even as she spoke, she showed no expression on her face. The beautiful blue eyes was full of serenity that does not waver, nor change.\n\n“I took you here child, to prevent the collapse of both worlds, I linked them, but to prevent invasion from either sides, I need a guardian on each side. The Golden Dragon God Daeneris defends his world from your side and I need one from your world to defend the other side.”\n\nI see, she needed a guardian and the golden dragon was a test, the RPG and the tower were both just tests.\n\n“Child, will you take upon the task? To make it simpler I have given you the body you created and used to beat the Dragon God, which has itself ascended into godhood.”\n\n“”what about my old body?””\n\n“I froze it in time in case you reject the offer.”\n\nEh? Doesn’t that mean I can return to everyday life?\n\nBut do I really want to… I mean I have no family, dropped out of high school and works at a gas station with barely any friends and no lover. I have a hard time making enough money to live anyways…\n\nThe only one who might miss me is Takashi, but he’ll be fine. Probably?\n\nWait I just remembered! I got tons of money in this character, and it’s super strong, so I got nothing to worry about meaning I can just laze around and eat!\n\nWOOHOO LAZY FOR LIFE!\n\nI can also try all those anime food that seem delicious!\n\nWith a wide grin on their faces and a little bit of drool on the side of their mouths, the twins replied to the goddess “”There’s nothing holding me back, so I will guard the gate from the other side, but can you grant me a single wish?””\n\n“And what is that?”\n\n“”Let me roam the world, I want to see the world that I am defending against, but if challengers reach the gate, then I will do my duty. But until then, I do not want to be bored sitting around doing nothing.””\n\nYup totally because of boredom, not because I’m going to try all the food in the world!\n\n“Fair enough, you will guard the lowest level of the Dungeon of Origin, the one that links the two worlds, and whenever someone reaches your room and enters, you will be automatically teleported, fair enough?”\n\n“”Thank you for granting my request””\n\nAnd with that, she disappeared. Literally disappeared into thin air and the white room slowly darkened into a cave.\n\nThis story originates from Royal Road. Ensure the author gets the support they deserve by reading it there.\n\nThe Cave was a huge semicircle. With a radius of around 250 meters, it was enormous and at two ends of the cave were a door and what seemed like a crack in space. Through the crack I could see a gigantic gold tail.\n\nWait… I KNOW THAT TAIL! IT’S THE DRAGON’S! Wow, so he was a god all along huh… I guess I’ll go visit him once in a while, since the in game version of him never talked, I wonder what he’s like.\n\nThe other side was a door, a door with the carving of two beautiful little girls on each side holding a balance in hand…\n\nWait… THAT’S MY CHARACTER! I guess this means I’m the final boss? I wonder what happens if I die…\n\nWell first things first, looking back at my two new bodies, I tried moving, since operating 4 arms is going be a pain, but surprisingly, they worked the same way as the game.\n\nI know I’m supposed to be a man and try to touch those, but… isn’t this wrong? I mean they’re only 12 years old… even if they’re super-duper cute and so adorable I want to hug them...\n\n*sigh* I was never really that curious about it I guess, but seriously, THE SKIN IS SILK SMOOTH AND THE HAIR TOO FEELS SO GOOD TO TOUCH!!!!\n\naaaahhh…. The super soft skin that instantly sank in when touched and the smooth silky hair that feels like the finest silk made my face instantly relax.\n\n“At least you two are enjoying this.”\n\nA loud voice that shook the cave sounded out from behind me, which made me jump up in surprise.\n\nA giant eyeball… the distorted space showed a giant slit eyeball… Even though I can probably guess who it is, it’s still scary turning around to see a frigging gigantic snake like eye staring at you…\n\n…””Are you stuck?”…\n\n“WHAT! NO! I’m not stuck you idiots, I’m supposed to guard this side from intruders, but beside you two, almost none have come and the ones that came can’t stand a single hit, so come over here, let’s spar!”\n\n“”WHAT NO! go find someone at your own level””\n\n“but the only one at my level is you two. Is there anybody else nearby that’s a god?”\n\n“”What are you talking about I’m not a god, I’m human””\n\n“check your statuses then”\n\nStatus\n\nName: Yuiitsu and Sei\nRace: High God\n\nGender: None\nJob: Balance God\n\nRank: SSS\n…\n\nGENDER NONE!? AND RANK SSS!? I swear I was rank A before when I fought Daeneries, but more importantly! GENDER NONE!!!!!!?????\n\nI instantly flipped up my skirt to check\n\n“HEY HEY HEY! DO YOU KNOW NO SHAME WOMAN!”\n\nBeing changed to a girl is fine… I mean it doesn’t matter to me whether I’m a man or a woman since with technology now, genders can be changed easily… BUT THIS!? WHAT THE HELL IS THIS! HOW DO I USE THE WASHROOM WITH NOTHING!!!!\n\nDoesn’t this also mean I’ll never be able to feel pleasure again!? NOOOOOOO!!!!! orz\n\n“Sooooo about that spar”\n\n“”SHUT UP LEAVE ME ALONE!!!””",
            "comments": [
                {
                    "comment_id": "569865",
                    "username": "Nanashikun",
                    "comment_text": "Wait, so the guy plays two character, Kuma? That's awesome, Kuma!",
                    "time": "2016-03-15T17:55:01.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "570306",
                    "username": "udin-san",
                    "comment_text": "it's GONE!! literally!! that was hilarious haha\nthanks for the chapter~",
                    "time": "2016-03-16T01:52:31.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "2166082",
                    "username": "The One who Knows",
                    "comment_text": "Hahahaha! Oh man, I'm having flashbacks about Tensei Slime.",
                    "time": "2019-03-29T06:36:45.0000000+00:00",
                    "replies": []
                }
            ]
        },
        {
            "id": "57103",
            "name": "Chapter 2: Byosu",
            "url": "https://www.royalroad.com/fiction/5580/yuiitsu-and-sei/chapter/57103/chapter-2-byosu",
            "content": "I swear does no one read the warning these days? @>@ if you're still here, it either means you got nerves of steel, you already got cancer or some third reason that I have absolutely no clue about...\n\n---\n\nChapter 2: Byosu\n\nThe same time that Yuiitsu and Sei appeared in the cave, Elenair changed…\n\nThroughout the world beings appeared out of thin air…\n\nThey appeared mostly in cities, but not many appeared. In a city, only 10 or so appeared.\n\nThe men had black long black hair, one closed eye with a yin symbol inside, a single demonic hand with claws and they looked exactly like a human besides the hole in their sternum. The women on the other hand had long white hair, the other eye closed with an yang symbol inside, a white angelic hand and they also looked exactly like humans except their hole was at the stomach.\n\nWearing all sorts of different clothing that has never been seen in this world, they wandered. Some were young, some were old, some were cheerful, some were shy, some were kind, some were mean, but they all had something in common.\n\nThey all knew nothing about this world…\n\nThey had knowledge of technology that is much more advanced than the world, they knew of money systems and mathematics that were not from this world and they all thought a piece of them was missing…\n\nEvery one of their knowledge was incomplete, yet the things they knew were far more advanced than this world.\n\nAlthough this is something that is incredibly abnormal, the residents of this world easily accepted it, because they knew, this means a new high god has been born.\n\n---\n\n“soooo are the two of you going to stop squatting there and drawing stuff in the dirt? It’s been hours…”\n\nWhy can’t this stupid dragon leave me alone, let me create the RECOVER MAN/WOMANHOOD PLAN in peace…\n\n“are you done yet?”\n\nShut up…\n\n“how about now?”\n\nSHUT UP!\n\n“hey hey, how about now?”\n\n“wana have a spar with a high god now?”\n\nFOR THE LOVE OF GOD SOMEONE SHUT THIS DRAGON UP!\n\nWait, he’s a high god… HE MIGHT KNOW SOMETHING ABOUT THIS!\n\n“”Hey Daeneries, what gender are you?””\n\n“Hahaha, obviously I’m genderless like all high gods, sorry girls, can’t mate with you no matter how attracted you are to me.”\n\n…this stupid overgrown lizard… who the hell would be attracted to a gigantic golden lizard\n\nBut that line, all high gods being genderless?\n\n“”Why’re all high gods genderless?””\n\n“I see what you are doing, you two want to change my gender to mate with me don’t you, well too bad. We are handed this position by the goddess and each of us govern an element or race. If we are able to reproduce and more high gods appear, the world will be flooded by new kinds of elements and races.”\n\nI see... that does make sense.\n\nWait does this mean I get my own race? WOOHOO!!\n\nYou might be reading a pirated copy. Look for the official release to support the author.\n\n““Hey Daeneries, what are the Balance race like? Or Balance element?””\n\n“What in the world are you talking about? There are no…”\n\n“Yes?”\n\nWhy did he freeze mid-sentence and why is he narrowing his eyes! Uh oh…\n\n“YOU TWO! YOU GUYS HAVE BECOME HIGH GODS HAVEN’T YOU!”\n\n“”Uh….. maybe?””\n\nOh crud, I hope he doesn’t attack again. I still haven’t mastered this body yet.\n\n“HAHAHAHAHAHA! FINALLY A WORTHY OPPONENT OF THE SAME RANK! COME LET US BATTLE TO THE DEATH!”\n\n“”EHHHHHHH!?””\n\nWhat just happened?\n\n“What are you two waiting for? Come on, let’s fight, oh how fun this’ll be!”\n\nIs his brain fried? Or is he just mentally retarded? I mean fight to the deaths!? Why the hell would I want to fight him to the deaths when I don’t even want to spar with him?\n\n“Come on, don’t worry about it. We can’t die anyways, so let’s have some fun!”\n\n“”Wait, we can’t die?””\n\n“Ah, the goddess didn’t tell you did she? What did she tell you about your new race?”\n\n“”Nothing?””\n\n“Wow, she must be really tired from connecting the two worlds then. Well worry not, your senior high god will teach you.”\n\n“You see, high gods each govern a race or element meaning we are that race and that race is us. Without us, the race or element will disappear from the world, but with us here, the race will continue to spawn in the world, even if it goes extinct.”\n\n“Now because we are the race or element itself, if one of us disappears the world will change greatly. For instance, if the water high god disappeared, there will be no water. So to ensure that never happens, each of us are made to be able to never age and respawn when we die. The respawn location is set by the goddess, so it cannot be changed.”\n\n“To make sure we don’t multiply, the goddess made us unable to reproduce, and we also cannot do eat, breath or excrete, this is to help prevent our deaths.”\nCan’t eat… can’t eat… can’t eat…\n\nNOOOOOOOOOOOOO!!!!!!!! YOU FIRST TAKE AWAY MY PLEASURE AND NOW YOU TAKE AWAY MY ABILITY TO EAT! CURSE YOU GODDESS WHYYY!!!!! Orz\n\n“Yea, I know you must be sad because you can’t reproduce with the great me. But worry not, we can enjoy ourselves with a bout! TO THE DEATH!”\n\nSCREW THIS I’M LEAVING!\n\nAs I slowly get up and walk towards the door, I hear screaming coming from the dragon.\n\n“Wait, where are you going? Come back! Come on, just a fight to the death! A single one! come back! Wait, just a little spar!”\n\nStupid dragon. If I have to suffer, so will you!\n\nOpening the door, I turned around and with a straight face I replied with a single word.\n\n“”No!””\n\nAnd I slammed the door shut!\nTAKE THAT YOU RETARDED YELLOW LIZARD!",
            "comments": [
                {
                    "comment_id": "557773",
                    "username": "canaan",
                    "comment_text": "woahhhh good story. thanx for chapter",
                    "time": "2016-03-05T15:02:56.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "566841",
                    "username": "Scholek",
                    "comment_text": "\"or some third reason that I have absolutely no clue about...\"\nCancer is easier to explain.",
                    "time": "2016-03-13T09:10:31.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "569874",
                    "username": "Nanashikun",
                    "comment_text": "Haha, funny lizard, Kuma!",
                    "time": "2016-03-15T18:05:18.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "570310",
                    "username": "udin-san",
                    "comment_text": "this gives me cancer alright but funny and good nonetheless haha\nthanks for the chapter",
                    "time": "2016-03-16T02:01:59.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "687946",
                    "username": "sunderkeenin",
                    "comment_text": "Third reason, I just have a tolerance level of \"too damn high\". I'm so far gone that I'm at the point where the first thing I thought when I saw transmigration into twin bodies controlled by one person was twincest selfcest until you had them become genderless.\nWho needs cancer when you got crazy?",
                    "time": "2016-06-13T03:19:37.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "698134",
                    "username": "Zemophobia",
                    "comment_text": "That 'lizard' is right. If you can't eat, sleep or have sex, the only thing to do if fight to the death!",
                    "time": "2016-06-22T01:43:35.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "715259",
                    "username": "wraith26",
                    "comment_text": "corny",
                    "time": "2016-07-06T21:51:32.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "993626",
                    "username": "Tedious",
                    "comment_text": "yeah the warning is effective if you mess this masterpiece up!!!",
                    "time": "2017-03-24T23:02:11.0000000+00:00",
                    "replies": []
                }
            ]
        },
        {
            "id": "57269",
            "name": "Chapter 3: Dungeon",
            "url": "https://www.royalroad.com/fiction/5580/yuiitsu-and-sei/chapter/57269/chapter-3-dungeon",
            "content": "Chapter 3: Dungeon\n\nOn the other side of the door was literally another world…\n\nThere’s no other way to describe it, it was heaven yet at the same time hell!\n\nThe place looked as if it was perfectly cut in the middle.\n\nOn the left side was like heaven, a marble palace styled like the ancient Greek’s pantheon of gods sat in the middle of a huge forest, that was beautiful beyond compare. The lake was pure and so clean that it was sparkling, while the fruits on the trees were perfectly ripe.\n\nThe people were beautiful beyond compare and not just one or two, but every single one of them. They had ten wings, five on each side and they each wore full metal body armour that covered their body from the neck down and they all looked young while radiating light. With all sorts of weapons in hand, they lived in perfect harmony with nature around them.\n\nThe light radiating out of each of the beings, filled their world with light. So much that it even made me forget I was underground for a second.\n\nI even saw the water in the lake rising before forming a human shape and slowly, the water fell off, revealing the figure of a beautiful naked women with ten wings. As she walked out of the lake, the earth rose around her and hardened becoming full body metal armour and a spear.\n\nThe other side, however, was like hell…\n\nIt was a lifeless black land, filled with pools of magma. There were no signs of nature on it from one end to the other. The wall of earth on the other side seemed like a safe haven compared to the eerily black land. The pitch black land consumed all light and not just in a figuratively way. Light that got in from the left side fell to the earth as if it was as heavy as metal and disappeared as if it were consumed. The only source of light on the land, was light being radiated from the magma and that red light mixed with the eerily dark land made it seem like it was hell itself.\n\nThe residents of the land were also human figures of great beauty wearing little to no cloths. They had dark red skin with magnificently large horns protruding out of the two sides of their head. With two great black wings, a long jet black scaly tail, claws for hands and three big talon for feet, they were like demons from books brought to life.\n\nThey lived however they want on the land. Some bathing in the magma, others fought painting the black land red, while others eating each other both figuratively and literally. And whenever one dies, the land itself opens and becomes a big jaw with teeth that rises and devours the body before spitting the being out again in perfect shape and returning back to being earth. The being that was spat out continues his previous actions as if he never died.\n\nYup, I’m avoiding the right side. It wouldn’t be funny if the beings or even the earth tried to eat me or kill me.\n\nSlowly walking down the stone stairs that led to the door to my room, I moved towards the left side and as soon as I stepped on the grass, every single one of the figures turned to me.\n\nThe beings all stopped what they were doing before turning to me…\n\nWhat am I supposed to say in this circumstance?\n\n“”Um… hi?””\n\nI said a single word! JUST A GREETING! And every single one of them took to the skies and rushed towards me! WHAT THE HELL!\n\nI mean they look strong!\n\nAnd there’s over a hundred of them!\n\nTurning around the twins ran back up to the stairs for the door, but once they reached the top, two figures landed before the door.\n\nThe demonic looking one was the same as the others. She was wearing what seems to be lack stripes that coil around her body with a blood red double sided sword in hand. The angelic looking one, also looked the same as the others,  but her armour only covered her chest, arms, legs and lower area. In her hand was two blades that bent back. A blue line was stretched across the two tips of the blade forming a bow, but no arrows were anywhere in sight. Looking closer, one can see the yin and yang symbols floating around their eyes in opposite directions.\n\nThe author's content has been appropriated; report any instances of this story on Amazon.\n\nWhile Yuiitsu and Sei were sizing up their opponents, the angelic and demonic figures from the back has also caught up, so the twins are pincered from both sides.\n\nThere’s nowhere to run, so I guess I have to fight. I hope Daeneries wasn’t lying when he said we can’t die, because I think I’m about to find out.\n\nPulling their twin swords out from the inventory, the twins took a stance and was ready for battle, but what happened next was out of their expectations.\n\n“Goddess-samas, what are your orders?”\n\nBoth the angelic and demonic figures kneeled around them, with bowed heads and a big smile on their face, they stared at the twins waiting intently for their masters’ orders.\n\nStaring at the scene in front of them, Yuiitsu and Sei’s mind blanked out. The actions that the beings were doing was so incomprehensible that they had no idea how to answer.\n\n“Is something the matter goddess-samas?” the angelic and demonic figure at the top of the stairs asked.\n\n“”Why’re you calling me goddess-samas?””\n\nThe angelic and demonic being with had a puzzled face and looked at each other. Then with tilted heads they replied,\n\n“Well goddess-samas, there are two of you, therefore we call you goddess-samas instead of goddess-sama?”\n\nOh right… I have two bodies now, I really need to remember that or people are going to call me odd. Better start using us before it’s too late. But that’s not the main problem.\n\n“”No, I do not mean why you call us goddess-samas, but why do you call us goddess?””\n\n“You are the god of balance, the god of our race, the Byosu.”\n\nOh… so these are the race I govern… weird why’re there two types of them?\n\nAt least my race looks strong, I mean they look extremely similar to devils and angels from my old world, and I heard all kinds of myths about their power.\n\nI wonder if they hate each other like in the stories, having my race gone extinct because of an internal dispute is not going to be funny…\n\n“”Do the two of you hate each other?””\n\n“No goddess-samas, we live separately in balance, so neither side bothers the other.”\n\n“And even if we had to pick yes or no, we’d pick no ya know, because we change depending on which side is in charge ya see.””\n\nThat’s a load of relief, I guess my race isn’t going extinct any time soon.\n\n“Goddess-samas, do you have any orders for us?”\n\n“”Ah, no there are no questions at the moment.””\n\n“I see…”\n\nThe white Byosu answered with a sad look.\n\n“”But we do have a question. How do we get out of here?””\n\n“Oh, you can climb the stairs on the other side. There are 100 floors in the Dungeon of Origin, so please be careful goddess-samas.”\n\nEH!? 100 FLOORS!? WHERE IN THE WORLD ARE WE?????\n\n“Also, are we allowed to follow you goddess-samas? Since ya know, we can demonstrate our usefulness.”\n\nI hope she doesn’t mean what I think she means…\n\n*gulp* “”All of you?...””\n“Yup!”",
            "comments": [
                {
                    "comment_id": "569880",
                    "username": "Nanashikun",
                    "comment_text": "Followers, yay! Kuma!",
                    "time": "2016-03-15T18:11:22.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "570324",
                    "username": "udin-san",
                    "comment_text": "thanks for the chapter~",
                    "time": "2016-03-16T02:15:20.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "698141",
                    "username": "Zemophobia",
                    "comment_text": "If feels like he is controlling the twins inf 3rd person when he is referring to himself in 3rd person.\nIt would be pretty trippy controlling two bodies at the same time. Like, does he see through two sets of eyes at the same time, and can the two bodies separate from each other?",
                    "time": "2016-06-22T01:51:27.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "715265",
                    "username": "wraith26",
                    "comment_text": "fuck!!. another mc that act extremely dumb and stupid.. whatev\n22/06/2016 01:51:27Zemophobia Wrote: [ -> ]\nIf feels like he is controlling the twins inf 3rd person when he is referring to himself in 3rd person.\nIt would be pretty trippy controlling two bodies at the same time. Like, does he see through two sets of eyes at the same time, and can the two bodies separate from each other?\nohh.. maybe hes doin it at 2 persons pov at the same time... like how humans control each side of humans body like its completely natural",
                    "time": "2016-07-06T21:58:47.0000000+00:00",
                    "replies": []
                }
            ]
        },
        {
            "id": "57987",
            "name": "Chapter 4: Raid Boss",
            "url": "https://www.royalroad.com/fiction/5580/yuiitsu-and-sei/chapter/57987/chapter-4-raid-boss",
            "content": "Chapter 4: Raid Boss\n\n“”No.””\n\n“Please?”\n\n“”No!””\n\n“Pretty please?”\n\n“”NO!””\n\n“Ehhhh, but whyyyyyyyy?”\n\nWhy the hell would I bring all of them out with me!? Can you imagine how much chaos a gigantic army appearing out of a dungeon would cause? Also I’m not even sure if they know common sense. Like those stupid characters in novels I read, if they start killing everything in sight or calling everyone they meet an insect, that’s going to be a pain to deal with.\n\nThere’s also the problem of food and water, where the hell do I get enough for an army this big!?\n\nAll I want is to go out and eat food, not wage war against the whole world god dammit!\n\n*sigh* Time to make up some random excuse and hope they go along with it.\n\n“”Because we need you guys to protect… “”\n\n“Protect?”\n\n“”Um…””\n\n“Um?”\n\n“”this door?””\n\nI mean this door is pretty well made, it looked like it was sculpted by a master and now that I look closely… it gives off a weird purple glow? Yea, I had no better idea… This is obviously not going to work, PLAN B RUN FOR IT!\n\n“Ah! We understand goddess-samas, you want us to guard your temple, we shall protect it with all our might!”\n\n“””BY YOUR WILL!”””\n\nEscape plan number 1, I’ll first run to gain speed, jump over them and fly… wait what…\n\nWhen did this become my temple!? And why are you guys so happy to… oh screw it, I’m getting out of here!\n\nThe twins put on the rest of their battle gear that was so badly damaged by the dragon that they auto unequipped, which were magically repaired by the goddess. They Opened their wings and ran towards the stairs, deciding to jump and fly to the other side, then slowly climb the dungeon.\n\nA plan this simple can’t possible go wrong, but why do I hear a beeping soun… Oh crap!\n\nAs they took the next step, blue light engulfed the twin and they disappeared.\n\n---\n\nThere are many races throughout the world, the humans, demons, beastkin, dragonkin, elves and dwarfs. The world that was split into three small wars became one great war instead. It used to be the humans versus demons, the elves versus the dwarfs and the dragonkin versus the beastkin, but then the humans, elves and beastkin created an alliance and to answer, the demons, dwarfs and dragonkin did as well.\n\nThe world was split into two and this fight continued for millenniums, until 200 years ago.\n\nThe Dungeon of Origin was created hundreds of years ago in Elenair, the goddess that created it disappeared alongside the dragon god right after creating it, leaving behind nothing except for the dungeon in the center of the six capitals.\n\nAt first everyone just thought the goddess was sleeping, but after hundreds of years, she has still not returned. Every single race was worried. They did not know what happened to their beloved goddess who created the world and watched over it. Some went searching for the high gods, to learn of what happened to the goddess, but they didn’t know, others went around the world looking for her, but none found her. With the threat of monsters throughout the land, every race forced a ceasefire to search for the goddess. The dedication the people had for the goddess was real and in these one hundred years, almost every inch of Elenair was searched, except for this dungeon…\n\nThe reason they didn’t search the dungeon was not because they didn’t want to or didn’t try, but because they couldn’t. Even with the strongest adventurer from every race, they only got down to the 70th floor, where they were eradicated by the floor boss.\n\nIn the 30th floor boss room,\n\nSix adventurers were fighting against the floor boss Great White Snake in the closed boss room.\n\n“Katsuro move! It’s the poison breath!” (Riku)\n\n“Understood” (Katsuro)\n\nAlthough he had full heavy armour on and a great shield with a mace, the dragonkin, Katsuro, was still able to dodge the poisonous breath.\n\n“Ren, attack it’s head, Haruto, defend her!” (Riku)\n\n“Okie dok” (Ren)\n\n“Hey! Slow down Ren!” (Haruto)\n\n“Why don’tcha speed up?” (Ren)\n\n“WELL I CAN’T CATCH UP TO A TIGERKIN EVEN IF I SPEED UP!” (Haruto)\n\n“Relax, this is a B+ boss, and we’re all A- ranks” (Ren)\n\n“Don’t you remember, the ranking system is different for monsters, a monster with rank B+ is equal to 6 B+ adventurers.” (Haruto)\n\n“And we’re A-, so relax, I’m going on ahead!” (Ren)\n\nAfter that, the tigerkin, Ren, who was barely wearing anything, leaped around the snake’s head attacking it from all directions with her claws, leaving a very pissed off human, Haruto, in leather armour trying to keep up and protect her from the tail’s attack, but halfway he just gave up and started attacking the tail with his sword and shield.\n\n*Sigh* “Sora…” (Riku)\n\n“Don’t worry already on it” (Sora) and with that, ice shackles appeared all around the snakes body, trying to tie it down.\n\n*Sigh* “Thanks, thank god we don’t have a second Ren or Haruto, just having them is bad enough.” (Riku)\n\n“Um… Uhhhhh” (Aya)\n\n“Don’t worry Aya, you’re doing great, just keep healing and buffing Katsuro.” (Riku)\n\n“Un!” (Aya)\n\nAfter giving the Human girl, Aya, confidence, the elf archer, Riku, notched another arrow and aimed at one of the snake’s eyes. Seeing this, the elf mage, Sora, focused his ice shackles around the snake’s head and neck.\n\nAfter hours, the snake had an arrow in each eye, and it was bleeding everywhere. The white scales were dyed red with a tint of green, and the tail was cut off, it could no longer struggle against the ice chains binding it and fell to the ground.\n\n“Ren! Haruto! Finish it!” (Riku)\n\n[Cleave]\n\n[Empower]\n\nWith the armour scales gone from the neck, Haruto’s Cleave was able to easily cut into the snake’s neck, but due to the sheer size of the snake, he could only cute off 3/4 of the neck. That’s where Ren comes in, with her incredible speed and empowered her claws, she was able to separate the head from the body.\n\nStolen from Royal Road, this story should be reported if encountered on Amazon.\n\nThe greenish red blood spewed everywhere covering most of the area around the snake. Katsuro was far away, defending the Riku, Sora and Aya, so the four of them did not get splashed by it. However, Ren and Haruto weren’t so lucky, they were at point blank range, and could not avoid getting fully drenched in the poisonous blood.\n\n“Aya! Quick, heal them, the blood’s poisonous!” (Riku)\n\n“Un!... got it” (Aya)\n\n[Detoxify]\n\n“Phew, thanks Aya, you really saved me” (Haruto)\n\n“Aya-chan! You healed Haruto first! Does that mean what I think it means?” (Ren)\n\n“EHHHHH!!!” (Aya)\n\n“Awww my cute innocent Aya is growing up, onee-chan is proud” (Ren)\n\n“NO! That’s not it!” (Aya)\n\n“It’s fine, don’t worry onee-chan will support you, even if you’re after the no good weakling.” (Ren)\n\n“HEY!” (Haruto)\n\n“Um… I don’t think Haruto is weak…” (Aya)\n\n“EH!? So you’re not going to deny you’re after him? How courageous!” (Ren)\n\n“Ah! NO!!!!! I’m not after him!” (Aya)\n\n“it’s okay, it’s okay onee-chan knows, you’re just shy, don’t worry, onee-chan will help you!” (Ren)\n\nAnd the three of them continued messing around. With Ren teasing Aya whose face is as red as a tomato and ocassionally sneaking insults in while teasing Haruto. On the other side, the three grown men were gathering the material from the snake.\n\n“Look who gets all the girls.” (Riku)\n\n“Haha, it’ll be nice to be young again I guess” (Sora)\n\n“Come on, you two are younger than me, I’m already over 90!” (Katsuro)\n\n“Well mentally I guess, since your race in human terms in over 40, but technically, we’re still older, since we’re over 120” (Riku)\n\n“Cmon Riku, you know our age in human terms are only around 30” (Sora)\n\n“I guess… *sigh* we’re old… HEY GUYS! WE’RE DONE COLLCTING LET’S MOVE!” (Riku)\n\n“”Coming””\n\nAnd the party of six was just about to move on to the next room, when the doors that opened after the floor boss’s death slammed down and closed themselves.\n\n“What’s going on!” (Haruto)\n\n“No clue, my Trap Detection skill isn’t going off. Sora?” (Riku)\n\n“I don’t sense any magi… WAIT! Magic is gathering at the center of the room!” (Sora)\n\n“Everyone! Get ready for battle!” (Riku)\n\nThe six veteran adventurers instantly got ready and as the mood tensed, a blue light shined in the middle of the room.\n\nFrom the blue light, twin girls with closed eyes appeared. Their beauty was out of this world. With luxurious dresses, five rings on each hand, a necklace, a white and black cloth wrapped around the sole of their feet and arms like bracers respectively, and a black and white ribbon on the opposite sides of their heads combined with the gigantic black and white wing coming out of their backs, they looked as beautiful as the goddess herself!\n\nThe party stood there speechless, not knowing what to do.\n\nThey have never heard of any monster like them, nor any beings with a single gigantic black or white wing.\n\nThe party literally did not know what to do. They stood there admiring the beauty of the twin goddesses that appeared.\n\nThe first one to regain his consciousness was Riku, being the party leader, he was the first to snap out of their stupor and immediately used Identify on them.\n\nThe result, however, left him speechless…\n\nName: ???Race: ???\n\nGender: ???Job: ???\n\nRank: ???Strength: ???\n\nIntelligence: ???Agility: ???\n\nMagic Power: ???\n\nThere was no age… there was no age in identify! It could only mean one thing, the beings in front of him could not age and only highly evolved entities could not age meaning they’re extremely strong! Question marks is the result given if the stat of the target is a lot higher than the users, that he can understand, but the stats the beings has… It frightened him extremely! There was no defensive stat, only attack and more attack meaning these two in front of him, were power type monsters and those are usually the more aggressive type. With two monsters that is way out of their league being possibly extremely aggressive, it was the worst situation possible. This same result was returned from both of them, meaning their party had to face not 1, but two of them! It was insane!\n\nRiku immediately shouted his teammates names to get them out of their stupor and they reacted. Katsuro immediately stepped in front to block any incoming attack. Behind him stood Haruto and Ren in a V formation protecting Aya within. Behind Aya, stood Riku and sora, defending the back from possible attacks. It was their strongest defensive formation, the diamond formation, but the situation was still critical. The best he can hope for, is to buy time for Sora to activate the Return magic to send as many of them alive as possible out of the dungeon.\n\nAs sweat rolled down from his forehead, he quickly made hand signs, signaling Sora, telling him the plan, while watching the beings every move. He already gambled on screaming at his teammates to get them out of their stupor, so he could not risk agitating the beings anymore, and chose to make hand signs for Sora to read.\n\nAfter sora read the plan, he immediately used Thought Transfer to tell his teammates, and as he finished telling his teammates the plan, the beings tilted their heads in the opposite directions, and a pair of angelic voices rang out.\n\n““What are you guys doing?””\nTHEY CAN TALK IN THE SAME LANGUAGE AS US!?",
            "comments": []
        },
        {
            "id": "58415",
            "name": "Chapter 5: Choice",
            "url": "https://www.royalroad.com/fiction/5580/yuiitsu-and-sei/chapter/58415/chapter-5-choice",
            "content": "Chapter 5 Choice\n\nThe two girls did talk… this means they have intelligence, maybe I can negotiate our way out. Or at least buy time for Sora.\n\nThey also said the same things at the same time, they must know each other very well. Considering their looks and cloths, I think they might be twins. But this just makes it more weird, I’ve never heard of any race like that, and if their monsters, they shouldn’t know how to speak so fluently…\n\nWith hand signs I signal Sora to continue the plan of escaping, while I try to get some information out of them.\n\n“So, who are you two?” (Riku)\n\n“”Yuiitsu and Sei””\n\n“So, which is yuiitsu?” (Riku)\n\nAnd the twins both made a displeased face.\n\nDid I say something wrong? Crap, I hope I didn’t accidentally insult them or something, two enraged beasts are worse than two normal ones!\n\nI prepared myself for combat, but they just stood there with the displeased look…\n\nAfter a few minutes, the one that wore a black dress answered,\n\n“I am Yuiitsu”\n\n“And I am Sei”\n\n“Now, what are you doing?” (Yuiitsu)\n\n“In this dungeon today?” (Sei)\n\nEhhhh!??? Before they talked in sync, now they speak in parts!? Although with their looks, I find it surprisingly cute, it’s still scary. For two people to be this in sync, fighting them will not be like when we usually fight multiple enemies, where we can use one to impede the other. It’s best not to make them into enemies…\n\n“We’re here to try to find information on the goddess’s disappearance.” (Riku)\n\nTHEIR FACES TWITCHED! BOTH OF THEM! They know something!\n\n(Sora! Get the teleportation spell ready, but don’t use it, they know something about the goddess’s disappearance.) (Riku)\n\n(Got it.) (Sora)\n\n“”We see, however, your journey will prove to be… unfruitful…””\n\nTHEY DO KNOW! And they admitted it too… This might be the first advance in our search for the goddess in hundreds of years! We can’t let this chance slip by.\n\nBut before Riku could think of a way to pull information out of the twins in front of him,\n\n“WHAT DID YOU DO TO THE GODDESS!” (Haruto)\n\nShit, that stupid hot headed Haruto, he’s going to get us all killed!\n\n“HARUTO STOP!” (Riku)\n\n“What!? Don’t you want to know what happened to the goddess too!” (Haruto)\n\n“I…” (Riku)\n\n“No one in the world knows what happened to her! Not even the high gods! Doesn’t that mean something has happened to her! And yet they sound like they knows, doesn’t that mean they’ve done something to our goddess!” (Haruto)\n\n“”we did nothing””\n\n“Yes you did!” (Haruto)\n\n““No we did not!””\n\nHaruto couldn’t take it anymore and ran in with his sword and shield in hand. But right as he reached the twins,\n\n“WATCH OUT!” (Sora)\n\n“”Eh!?””\n\nThe shadow behind him rose up, into the form of a second Haruto and slashed towards the original, but the attack was blocked by a holy barrier.\n\n“I won’t let you” (Aya)\n\nThis time Riku noticed Aya’s shadow rising,\n\nShit I won’t let you!\n\nAs Riku shot the arrow, a black arrow intercepted it mid-air and Aya was struck flying by the shadow Aya.\n\n“STOP!” (Yuiitsu)\n\nAnd everyone froze, understanding their current predicament.\n\nLooking back, Haruto saw a black blade, blocked by the holy barrier created by Aya, but although he was fine, Aya was not and neither was his teammates. Behind Sora was a shadow sora, pointing a fireball at his head. Behind Riku was a shadow Riku, with 3 arrows notched in his bow, ready to fire at any time. Aya was on the floor, and behind her stood the shadow Aya, who just finished swinging her staff. As for Shadow Ren, she already had her claws around Ren’s neck and Ren still hasn’t noticed! Shadow Katsuro stood magnificently right behind Katsuro, cutting him off completely from his teammates.\n\n“Return!” (Sei)\n\nAnd the shadows all went down on one knee, before slowly dissolving into the shadow.\n\nRen quickly ran to Haruto’s side, while Katsuro went to help Aya up. Sora and Riku stayed vigilant,\n\n“I apologize for my companions rash actions” (Riku)\n\n“APOLOGIZE!? SHE ALMOST KILLED HARUTO!” (Ren)\n\n“CALM DOWN Ren, it was Haruto’s fault for attacking first.” (Riku)\n\n“Nnnn It’s fine” (Sei)\n\n“But we’ve been searching for the goddess for hundreds of years, and this dungeon is one of the only places we haven’t searched yet.” (Riku)\n\n“Fumu, I see…”(Yuuitsu)\n\n“Yet it seems like the two of you know something about her disappearance” (Riku)\n\nAfter that, awkward silence swept through the area. The group waited, hoping that they actually knows something, and is willing to share their knowledge. To help advance the search. What felt like hours to the group was actually just minutes, they waited, anticipated, but all they got was an innocent smile on the two girls faces.\n\nIn the current situation, the innocent smile felt very out of place… If they show a kind smile, and help they could understand, or a malicious smile and attack, that could also be understood, but the smile they gave off was neither.\n\nThey gave off an innocent smile… one that meant they knew nothing…\n\n“”Sorry, but we don’t know””\n\nIt was clearly a lie… they knew something, and they already showed it too, but now they’re trying to play dumb all of a sudden. What is their plan!?\n\nHaruto was once again filled with rage. With the sword tightly gripped in his hands, he was about to charge once more,\n\n“Why you!” (Haruto)\n\n“Haruto stop!” (Ren)\n\nBut the next words of the two silence him and everyone completely,\n\n“”Although we do not know where the goddess has gone, we do know why she left as well as what her current state is.””\n\nIf you stumble upon this tale on Amazon, it's taken without the author's consent. Report it.\n\nThey were joyous, happy, exhilarated! Finally, after centuries of searching, finally a clue has appeared. However, the following words of the two were like dumping cold water on their heads. It immediately cooled them down.\n\n“”However, nothing is free””\n\nWhat could they possibly want… They have power that is beyond compare, their equipment is at least legendary if not ancient. Compared to our rare equips, that’s like heaven and earth…\n\nAs Riku followed this line of logic, slowly, beads of sweat formed on his forehead.\n\nDo they possibly want our lives!?\n\nInstantly, the atmosphere tensed, the group was prepared to flee at a moment’s notice, because like Riku, they all arrived at the same conclusion. One person, however, was an exception.\n\n“Tell me! What do you want for the information. I’ll do anything if it’s within my power.” (Haruto)\n\n“”Oh? Even if it might cost you your life?””\n\nWith a firm look, Haruto responded “Yes”. Not once did his eye stray from the twin’s gaze, which lead her smile to widen. It was no longer an innocent, clueless smile, but instead, one of admiration.\n\nShit, they might actually take his life!\n\n“Ren!” (Riku)\n\n“On it!” (Ren)\n\nBut before Ren could get to him, Haruto was surrounded by 2 orbs, one white and one black rotating around him. Not knowing what it was, Ren chose not to move closer, because if she move carelessly, she might cause more harm than good.\n\n“”Why are you willing to go to such lengths for the goddess?””\n\nWith a daring smile, Haruto replied, “remember, nothing is free”\n\n“”Haha, what goes around comes around, fine, take this!””\n\n“NO!” (Ren)\n\nThe group watched in horror as the two balls spun faster and faster, leaving behind a trail of black and white, before disappearing completely, leaving behind an unconscious Haruto in the center, lying on the ground with a pained expression. The leather armour on his back looked like it was burned off, revealing his bare back with what looked like a scale, on the left of the scale was a shield of pure white, one that gave off a divine feel, while on the right was a sword, so black that it looked like the embodiment of evil.\n\n“WHAT DID YOU DO TO HIM!” (Ren)\n\n“”Ask him yourself when he wakes up, here also take this.””\n\nWith that Yuiitsu and Sei threw a single crystal at the group. It was a tetragon blue summoning crystal, it was a rare crystal that is a onetime use item, which can summon a being. No one knows how it was made as well as what it summons, but they did know the summoned creature is usually strong. However, the creature is not bounded to the summoner, so it was a dangerous artifact rarely used.\n\n“”If you guys want the knowledge I have on the goddess, find a way, so that a high god can eat.””\n\n“””EHHHHHH!?”””\n\nWhat the hell!? A high god can eat!? Why would anyone want to know that!? Do they want to poison a high god? No, there’s no point since if they die, they will just resurrect… What in the world is their objective!?\n\nWait, finding information on high gods are hard enough, but they want a way to change a high god… THAT KIND OF THING ONLY THE GODDESS CAN DO OR ATLEAST SOMEONE AT HIGH GOD RANK!\n\nThey want us to become that strong… But why? There’s no merit for them and they only know we are trying to…\n\nNo! It can’t be! The goddess must be in trouble! And they want us to become strong enough to help her!\n\nI see, so everything was a test, to check our determination, whether we’ll help the goddess or not!\n\nBut why not just tell us straight that the goddess is in trouble, why go around in circles?\n\n“”But remember this, tell no one about me… Not my looks, or my existence.””\n\nThat’s a warning, not to tell anyone about them… There must be enemies in the world that their hiding from! I see, they want to help the goddess, but they lack the power and are testing to find people with enough determination to grow strong enough to help the goddess.\n\nIt seems, only Haruto was worthy huh.\n\n“Thank you” (Riku)\n\nRiku thanked the twins with a smile, which left the two with a baffled face.\n\n“Come, Sora let’s go, I understand everything now.” (Riku)\n\n“You better explain it to us when we get back.” (Ren)\n\n“Yea, I have no idea what just happened.” (Sora)\n\n“Don’t leave me out, I want to know too.” (Katsuro)\n\n“Um…. How about Hatsuro, will he be fine?” (Aya)\n\n“Yea, don’t worry, Katsuro, can you carry him?” (Riku)\n\n“Sure” (Katsuro)\n\n“Let’s go Sora, and once again thank you Yuiitsu and Sei.” (Riku)\n\n“”Please t…””\n\nBut before the twins could finish their sentence, Riku’s gang disappeared.\n\n“”ell us how to get out of here…””\n\n“”NOOOOOOOOOOOOOOOOOOO!””\n\n---\n\n“Hey Sora, what did you think they were going to say” (Ren)\n\n“I don’t know, how about you Katsuro” (Sora)\n\n“I don’t know either, Aya?” (Katsuro)\n\n“Ehhh? … ummmm maybe “Please take care”?” (Aya)\n\n“Pfffttt, no way, they almost killed us!” (Ren)\n\n“Yea, I agree with Ren for once, look what they did to Hatsuro” (Sora)\n\n“No, I think Aya’s right” (Riku)\n\n“””EHHHHH!?”””\n\n“Did you fall for them or something!? Why do you have such a favourable impression of them!?” (Ren)\n\n“EH!? Love!?” (Aya)\n\n“I think Ren’s right, they did almost kill us.” (Sora)\n\n“Riku, don’t you think they’re a bit out of your league? Be more reasonable” (Katsuro)\n“Haha, no guys, I’ll explain it to you guys when we get back” (Riku)",
            "comments": [
                {
                    "comment_id": "566635",
                    "username": "xacual",
                    "comment_text": "I'm going to guess that Riku's interpretation of events is not going to be agreed with. Depends on what happens with Haruto when he wakes up, was the mark something of a blessing from them?",
                    "time": "2016-03-13T04:37:14.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "566652",
                    "username": "Aileri",
                    "comment_text": "we'll see ^.^",
                    "time": "2016-03-13T04:57:07.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "566679",
                    "username": "RoyalDollS",
                    "comment_text": "Lol, poor Yuiitsu and Sei.\nHey, I was wondering, are Yuiitsu and Sei ever going to be separate (As separate as magically connected twins could get anyway) people in the future?",
                    "time": "2016-03-13T05:35:51.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "566734",
                    "username": "xacual",
                    "comment_text": "13/03/2016 05:35:51RoyalDollS Wrote: [ -> ]\nLol, poor Yuiitsu and Sei.\nHey, I was wondering, are Yuiitsu and Sei ever going to be separate (As separate as magically connected twins could get anyway) people in the future?\nBased on the after transformation scene, it seemed like one consciousness was controlling both bodies so for them to be develop to be separate entities it would probably be impossible. Plus their status screen was \"Yuiitsu and Sei\" together, not two separate statuses for each of them.\nAnyway I had another thought but depending on how long this adventurer group was in the dungeon, they'll probably be hearing about the birth of a new High God when they get back to the city or whatever. Are they smart enough to connect it with the twins is the question, they don't seem all that smart.",
                    "time": "2016-03-13T06:15:11.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "567172",
                    "username": "Aileri",
                    "comment_text": "Both of your questions will be answered very soon.",
                    "time": "2016-03-13T15:40:36.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "569899",
                    "username": "Nanashikun",
                    "comment_text": "I need more, please, Kuma!",
                    "time": "2016-03-15T18:24:38.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "570348",
                    "username": "udin-san",
                    "comment_text": "thanks for the chapter~",
                    "time": "2016-03-16T02:41:08.0000000+00:00",
                    "replies": []
                }
            ]
        },
        {
            "id": "58776",
            "name": "Chapter 6: Help arrived sorta?",
            "url": "https://www.royalroad.com/fiction/5580/yuiitsu-and-sei/chapter/58776/chapter-6-help-arrived-sorta",
            "content": "Lemme just say, this chapter is a bit boring....\n\n---\n\nChapter 6: Help arrived sorta?\n\nI’M SO BOREDDDDDD\n\nSOMEONE SAVE ME!!!!\n\nStupid predicament I’m in, why the hell do the frigging doors and walls have to have some stupid barrier on them!\n\nI swear this is worse than being in the bottom of the frigging dungeon! At least I advanced, now I’m LITTERALLY stuck!\n\nI can’t even teleport out! Since I don’t know any place on the surface! I even tried to teleport back to my boss room, but apparently, NOPE… *sigh* probably should’ve expected that you can only teleport up in a dungeon, never down, since that’d defeat the point of a dungeon.\n\nAll I wanted was to go out and try some food… Even though Daeneries was talking about how high gods can’t eat, they can taste right? I mean that’s the only hope I have left…\n\n*sigh* Let’s think back to how this happened…\n\n---\n\nWhen the light died down, I was standing infront of six weird looking people, two had pointy ears, one was a big ass lizardman, two humans, I think, and a cat girl?\n\nSince there’s a cat girl, I bet Takashi would love to come to this would.\n\nWe stood there for a while, and when I seriously got bored, I asked them what they were doing, which led to a surprised look. Did they think I was stupid or something?\n\nThen the archer guy asked me about which one’s yuiitsu and honestly, I didn’t know! I mean the class Balancer is composed of two characters that you can design yourself, and people are allowed to make one name for the two of them, but I make two, but eventually forgot which one’s which!\n\nIt has been like 5 years? Well I just went eeny meeny miny moe and randomly picked one, but now that I think about it… THE WHITE ONE WAS YUIITSU FUCK!\n\nWell whatever, can’t take back what I said.\n\nNow, they did say something about goddess disappearing, I guess that’s when she went to connect the two worlds and is now asleep. Looking at their equipment, I doubt they’ll be able to beat me and meet the goddess, so I was trying to be helpful, but instead the stupid guy with a sword and shield accused me and attacked me!\n\nThe surprise didn’t end there either, one of my unique class passives activated! I swear that thing activates so rarely I can count the number of times it activated in the five years with one hand.\n\nIt’s a useless passive that activates if you face enemies that are over 10x weaker than you as well as over 5 times your team’s number. That crap was useless in every situation! Farming monsters 10x weaker gives you no exp and so little money, you wouldn’t even pick it up if someone dropped it. The crap summons shadow versions of the enemy and does everything they would do. The only time it might be useful was with an ant event boss, which summoned endless weak minions, but when [Shadow Balancer] activated, it only made it worse, it made my whole guild Disconnect and they held that grudge for weeks against me! If we didn’t Disconnect, it might’ve been useful, but seriously it’s pretty much a useless skill…\n\nIt’s been so long since it activated I barely remembered the commands to stop them! I swear, even if I’m a god now, I was still a human a day or two ago, so please exempt me from murder…\n\nThe most surprising part was after I almost killed them, they apologized! I was seriously thinking EHHHHH on the inside. To compensate them, I did decide to tell them about what I knew about the goddess, but then I decided to make an exchange. If they help me find a way to eat, I’ll tell them all I know and I’ll help them try to find her, yup, that was my decision. I mean, how hard is it to find a way to eat right? They just got to find a surgeon right? How hard can it possibly be, with magic, I bet surgery is even easier in this world, yup.\n\nIf you spot this story on Amazon, know that it has been stolen. Report the violation.\n\nAs for the rude sword and shield guy who tried to attack me a SECOND time, they called Haruto, personally I don’t hate him. He’s willing to lose his life for the goddess, so he must love her a lot. Although I don’t understand, I respect that, so I used [Warrior’s Scale] oh him, which is a skill that gives a person a blessing to summon either [Holy Aegis] or [Malice], which uses 1% mana a second, but if they don’t use both weapons the equal amount of time, they’ll suffer 70% weakened stats for 3 days…\n\nIt is a decent blessing, since both skills are legendary rank, but since players can’t change equipment in the middle of battle… it’s kind of useless…\n\nWell, I hope that logic doesn’t apply in this world\n\nOr it’ll probably help out in emergencies, just like that summoning crystal I binded to myself, they can summon me in a pinch.\n\nStill why did they thank me after I warned them not to mention about me? I mean all I wanted was so the world doesn’t know I am strong, since with power comes responsibility, and I hate that crap.\n\n…\n\nSo…. What now…\n\n…..\n\n.\n\nI hope they get in a pinch soon… I’m still stuck here…\n\n---\n“Sire! Greed is resonating!”\n\n“WHAT! Do you mean to tell me the 7th artifact has appeared?”\n\n“Yes.”\n\n“I see… the peace was nice while it lasted, *Sigh* war will be upon us soon, ready the troops.”\n\n“What about the Byosus?”\n\n“Their newborns without a capital, don’t mind them, we just have to find Gluttony before the others.”\n\n“Yes sir!”\n\nAs the second figure left the room, “*Sigh* I knew this day would come, and at the worst time possible… goddess-sama, I hope you predicted this and left insurance, or else races will go extinct... for good…”\n\n---\n\nIT’S BEEN A FRIGGING MONTH!!!! WHYYYY AM I STILL STUCK HERE!!!!!\n\nI’M SO FRIGGING BORED, THAT I’VE BEEN PLAYING ROCK PAPER SCISSORS WITH MYSELF!\n\n*Sigh*\n\nAt least I don’t need to eat or go to the washroom, or I’d be seriously screwed…\n\n…\n\nActually, even dying would be better than this… I’d just respawn at the bottom of the dungeon according to Daeneries …\n\nWHY DIDN’T I THINK OF THAT SOONER!\n\nWell… he’s been right so far about high god… but I’m still not sure about this…\n\nI mean if he lied, I’d be really dead and I don’t mean it figuratively…\n\n*Sigh* what do I do now…\n\nAs Yuiitsu and Sei was seriously bored out of their minds for who know how many times, a blue circle appeared in front of them.\n\n“”ALL RIGHT! THEY’RE IN TROUBLE!””\n\nWithout thinking, the twins jumped right in,\n\n---\n\nFinally I’m out! I’m no longer locked up in that place!\n\nAs the twins fully appeared, countless silver chains appeared from every direction in the surrounding and firmed bounded them\n\nThe chains were so tightly packed, it made them look like a mummy wrapped in chains.\n\nOh COME ONE! I JUST GOT OUT!\n\nLooking around, searching for the person who bound them up. In the grassland surrounded by stone walls, they saw a single boy wearing a uniform about 11, standing in front of a magic summoning circle, which they are on right now, and behind the boy stood a single old man in robes, with around 19 other children beside him…\n\nWHERE THE HELL AM I THIS TIME AND WHO ARE THESE PEOPLE!?",
            "comments": [
                {
                    "comment_id": "569323",
                    "username": "xacual",
                    "comment_text": "It looks like they got summoned by some kind of school summoning ritual, probably for familiars or something? Well I doubt a high goddess is going to be able to be bound by a human magic for long, I'm curious how the magic circle summoned them though. You would think a high goddess would be way, way out of some kid's league.\nAlso aren't they technically outnumbered and been faced with a hostile action again? No shadows activating though? Or is it too grim to activate on 11 year old brats?",
                    "time": "2016-03-15T04:52:51.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "569335",
                    "username": "canaan",
                    "comment_text": "it become silly you know why godess got summoned by some human child. it better if you change it. so twin goddes will have their adventure, not become slave to human kid. i just affraid if you got idea problem. thx",
                    "time": "2016-03-15T05:22:11.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "569342",
                    "username": "Aileri",
                    "comment_text": "how they were summoned, you'll find out soon :3\nas for the unique passive, it activates if they become enemies, which is being attacked or them attacking in video games, because they didn't do anything, nothing happens. as well as 5x her members. It activated in the dungeon because the 6 people were in a party and 1 attacked, but in this case, each of the student is considered to be stand alone, so unless more than 5 attack, it also won't activate. This also means, buffs or spells on standby that weren't launched also won't trigger the passive.\nAs for Canaan, never did say they will become slaves to humans ^.^",
                    "time": "2016-03-15T05:28:49.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "569346",
                    "username": "KK2",
                    "comment_text": "Lol, I thought they were frowning last chapter because it was hard to have just one speak and the other stay silent.\nAlso, for whatever reason I imagined Yuiitsu was the white one and Sei was the black one so I was really happy that the names were accidentally switched :)",
                    "time": "2016-03-15T05:34:13.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "569373",
                    "username": "canaan",
                    "comment_text": "15/03/2016 05:28:49Aileri Wrote: [ -> ]\nhow they were summoned, you'll find out soon :3\nas for the unique passive, it activates if they become enemies, which is being attacked or them attacking in video games, because they didn't do anything, nothing happens. as well as 5x her members. It activated in the dungeon because the 6 people were in a party and 1 attacked, but in this case, each of the student is considered to be stand alone, so unless more than 5 attack, it also won't activate. This also means, buffs or spells on standby that weren't launched also won't trigger the passive.\nAs for Canaan, never did say they will become slaves to humans ^.^\nokay. i understand.",
                    "time": "2016-03-15T06:20:03.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "569429",
                    "username": "Finnit",
                    "comment_text": "Loving the story so far, keep it up!",
                    "time": "2016-03-15T08:09:18.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "570360",
                    "username": "udin-san",
                    "comment_text": "thanks for the chapter~",
                    "time": "2016-03-16T02:51:43.0000000+00:00",
                    "replies": []
                }
            ]
        },
        {
            "id": "60123",
            "name": "Chapter 7: Deal",
            "url": "https://www.royalroad.com/fiction/5580/yuiitsu-and-sei/chapter/60123/chapter-7-deal",
            "content": "If you want to know why this took so long, I blame school! frigging 2 assignments and 1 test on monday, god... the agony...\n\nBTW MORE TEST AND EXAMS INC! YAY!!!!! .... I hate life sometimes...\n\nso yea if release slows, you know why @>@\n\nPS this chapter was rushed, if you found some errors please tell me in comment below, or if you're confused about anything. Please and thank you :D\n\n---\n\nChapter 7: Deal\n\nOk… I stepped into a magic circle for summoning, that I’m sure, this means I was summoned? I guess that boy crouching near the circle is my summoner?\n\nSuddenly, the space beside the boy is starting to distort. A small white sphere appeared, and it slowly expanded outwards into an oval the size of an adult.\n\nFrom the white hole, an angry old man in a long robe appeared and he’s staring at me? Hey don’t you know it’s not polite to stare!\n\nSo, what am I supposed to say in this situation… It’s not every day you get summoned and bounded in chains for no reason at all…\n\nWhat the hell do I do…\n\n“Excuse me, but may I ask why you two have graced us with your presence?”\n\nWow, that old man is polite, unlike the boy who has this stupid smirk on his face. Why is he looking at me like that!?\n\n“I summoned them, so now they’re my servants.”\n\nServant? Why the hell would I serve a brat!?\n\n“Ho? And pray tell how you managed to summon them?”\n\n“Obviously because I’m talented!”\n\n“…”\n\n“”…””\n\nThe boy might be stupid or retarded… probably retarded…\n\n“*Sigh* leaving that aside, why are the two of you here?”\n\n“”We were summoned.”” Can’t really deny that fact though, but it makes me feel stupid being summoned by such an idiot.\n\n“So what are your plans now?”\n\nActually, what are my plans!? At first I wanted to be just a neet and play, eat sleep, but now I don’t need sleep, can’t eat and there’s nothing to play, I have nothing to do… Oh right I still got to test whether I truly can’t eat or not.\n\n“”We want to test something.””\n\nEhhh, the old man got more tense, and he sent the teacher and children away? What does he think I want to test? Genocide? Geez, people really lack common sense here…\n\n“And what do you want to test…”\n\n“”Eating bread.””\n\n“What…”\n\nWhat’s wrong with eating bread!? Why’s he staring at me as if I’m an idiot! Hey that’s insulting! Don’t look at me the same way you looked at the retarded brat! Maybe they don’t have bread as food? That makes more sense.\n\n“”How about rice?””\n\n“Wait, wait, you lost me… you want to try eating food?”\n\n“”Yea, is there a problem?””\n\nWhat other purpose is there for bread? Oh right, I remember in history class, they said in medieval times, bread was used as a plate?\n\n“Excuse me, but I don’t understand, why’re you so tense? You are the headmaster right? You should be at Grandmaster S rank, and don’t you see they’re bounded in chains, they can’t possibly be a threat.”\n\nOh S rank? I remember in the game once reaching the S rank, instead of +,- they use a new ranking system, since the gap between the ranks are so high. Every rank above S rank is divided into Novice, Veteran, Expert, Master, Grandmaster, Saint, King, Emperor, Divine, God. Once, they reach the S god rank, they'll reach a bottleneck, and to go into the next tier, they got to evolve their race. For instance, the bottleneck of the human race is A rank, they need to evolve into demigod to get into S rank. And to reach low god, they need to be SS rank and then max of SS rank is when they can evolve to mid god.\n\nThe difference between a human and a demigod, beside their strength, is just that a demigod can live 10x longer than a human… Wow he must be old!\n\nThe old man was talking to the boy, but he was still staring at me. Crap, did he sense me calling him old in my mind! Oh wait, he’s just being vigilant…\n\n“Understand this boy, I set up a spell, one that warns me in anything above S rank entered the academy grounds, and the ones that set it off are standing in front of you, I’m not sure why they haven’t broken out of the chains yet, but I doubt a chain made by a measly D rank child can keep it contained.”\n\nWith that, the boy’s facial expression changed. It was not one of fear or terror, but instead excitement.\n\n“Yes! I summoned an above S ranked being as my servant!”\n\nI thought I told him I’m not his servant! Forget the food, this guy’s ticking me off!\n\n“”Why do we have to be your servant?””\n\n“Ehhhh? What are you talking about?”\n\n“”we’ll repeat what we said. We    are    not    your    servants.””\n\n“But, I summoned you two.”\n\nI swear I’m going to beat them so badly, they won’t consider asking me to be their servant again!\n\nRight as I was about to break the chains and have some quality… Teacher time…\n\n“And how could someone barely even ranked D, summon an being above S rank?”\n\n“um… I’m talented?”\n\n“Out with it brat!”\n\n“Um… yes, I used an S ranked beast’s magic crystal to help strengthen the summoning.”\n\n“And where did you get that magic crystal…”\n\nHahaha! Serves you right brat! Since I got nothing better to do, watching someone, besides me, get scolded is so much fun.\n\nWith a meek and scared expression, the child replied to the headmaster who was so angry, I could literally see a vein pop on his forehead. Rest in pieces, I’ll forever remember you as that annoying brat.\n\n“I got it from the treasury sir…”\n\n“And which treasury is that!”\n\nThe narrative has been taken without permission. Report any sightings.\n\n“The one in the basement…”\n\n“HOW DID YOU EVEN GET IN THE BASEMENT!”\n\n“Through the front door?”\n\n“BUT THAT’S LOCKED WITH AN A RANK SPELL! HOW DID YOU GET THROUGH IT!?”\n\n“Internet?”\n\n“WHAT THE HELL IS AN INTERNET!?”\n\nIt seems the headmaster truly didn’t know about internet and considering the technology I have seen so far, I doubt they have it, so why does the boy know about it?\n\nI quickly broke out of the chains using [Ailment Destruction], which destroys spells that continuously cause aliment, and walk towards them both, which left their mouths gaping open seeing how easy I broke out of it. Normally, I’d take this time to enjoy the view, but there’s more pressing matter at hand.\n\n“”Japanese?””\n\n“EHHHHHH! How do you know about Japan?”\n\nI see, he truly was either a person that travelled to this world, or reincarnated…\n\n“”Date?””\n\n“You mean the current date? I think…”\n\n“”No, earth””\n\nWith that, his eyes nearly popped out of his eye sockets, before finally calming down and thinking about it.\n\n“Um, 2018?”\n\nThat was 12 years ago! And with his age, it perfectly fits… Does that mean he reincarnated here 12 years ago? Did the goddess send him here too… I wonder what’s his purpose.\n\n“”Who sent you?””\n\n“Eh!? What do you mean?”\n\nWeird… that reaction means he wasn’t sent by anyone, then how did he get here…\n\n…\n\nThis is interesting!\n\n“”Old man, let us enroll here.””\n\n“EH!? Why?”\n\n“”Because!””\n\nI need to research how to change my gender, eat as well as magic, well the magic is just to complete the first two tasks. Oh and there’s also school, I kind of missed that too. I dropped out in high school to support myself, but the times there were fun. Hanging out, eating, playing around, it was fun… It seems, only when you lose it, do you miss it…\n\nWell I can’t really tell him that, since the whole another world crap sounds crazy…\n\nWait… Why do I have to make an excuse in the first place?\n\n“”Why not?””\n\nOh crud, I think I pissed him off… was it something I said, because his eyes literally looked at me the same way he looked at the boy earlier…\n\n“I don’t know, BECAUSE YOU CAN POSSIBLY KILL EVERYONE THERE, DESTROY THE PLACE AND DO MUCH MORE WITH ALL THAT POWER IN YOUR BODIES!? Hell I don’t even know what you are!”\n\nI took out a magical contract item from the game. It was used for non-aggression pacts between two parties and if one violates it, they will lose whatever is written on it, but I’m not sure if it works in this world… Why not test it out?\n\nHanding the paper to him with an innocent smile, I asked,\n\n“”Contract?””\n\nWhich made his jaws drop again… seriously, why’s he so surprised about a non-aggression pact… I swear they were easily made, only C rank items.\n\n“This! This is a magical contract guarded by the world system! How did you get your hands on it!?”\n\nWhat…\n\nMagical contract guarded by the world system!? Well the world did enforce it, so I guess that makes sense, but whys he so surprised if he knew about it?\n\n“Only the ancient mystical races in the past used these to settle disputes! The method to create them was thought to be long gone! How did you get one!”\n\n… I’m not going to say anything, nope! If I talk about the game, it’ll only make me seem crazy…\n\nWhat do I say… ahhh forget it, sorry Mariko, I’m stealing your favorite line\n\nActing as cutely as possible with my tilted head and a finger on my cheek I tell him,\n\n“”Se-c-ret””\n\nAnd his face blushed! I saw that! Even it’s disgusting seeing it on an old man, Mariko’s favorite line worked, but god it’s so embarrassing doing it I feel like I could die…\n\n“Ahem, Fine, I’ll go fill out a transfer sheet… But you two still have to take a test to find out which class you two are in, promise not to do anything that can cause harm to the students or teachers here while you’re here as well as help the academy in case there’s trouble.”\n\nNot like any of those are a problem, since I do have common sense you know, I’m not going to blow up everyone in the academy, just for fun. And if there’s trouble I guess helping out is okay, since I’ll be staying here. The main problem is… the test… I swear I never did like taking tests and I never will, but this is necessary to find my class, so I’ll bear with it…\n\nWait, he didn’t say the consequence for going against the set of rules! Haha, that means there are none!\n\n“”Deal.””\n\nOh crap, I forgot to ask for a place to stay… Oh well, I’ll just sneak into the headmaster’s house, not like he can do anything about it MWAHAHAHA\n\nWith the magical contract made, he teleported away, to deal with the transfer papers I think? Well, this is nice, a place to stay, playing with friends and learning magic to find a way to regain my gender and my FOOOOOOOD!!!!\n\n“So, are you two going to be my servant now?”\n\nGOD DAMMIT WHY DO YOU HAVE TO RUIN MY HAPPY TIME!\n\nTurning to the annoying brat… wait… I didn’t even know his name!\n\nAh forget it, it’s not important\n\nAnd with that I left him and started my tour around the campus!\n\n“Wait, I haven’t heard your answer yet!”\n\nGOD DAMMIT CAN’T YOU TAKE A HINT! I swear if I’m not the type of guy that keeps his promises, I’d beat you black and blue right now!\n\nAnd with that, I ran, from the annoying brat whose name I don’t even know.",
            "comments": [
                {
                    "comment_id": "578782",
                    "username": "canaan",
                    "comment_text": "oh god stupid boy. nah hope their fun not got ruined by idiot boy.\noh god stupid boy. nah hope their fun not got ruined by idiot boy. thx",
                    "time": "2016-03-22T05:48:30.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "578837",
                    "username": "xacual",
                    "comment_text": "Interesting. It still seems a bit easy if it only takes some catalyst to summon a high god though so I'm going to guess there was more at work than just that.",
                    "time": "2016-03-22T06:43:42.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "578877",
                    "username": "Reddu",
                    "comment_text": "22/03/2016 06:43:42xacual Wrote: [ -> ]\nInteresting. It still seems a bit easy if it only takes some catalyst to summon a high god though so I'm going to guess there was more at work than just that.\nWell you could think about it that they were willingly jumping to summoning circle if I'm right",
                    "time": "2016-03-22T07:37:20.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "578924",
                    "username": "Ivanator The Great",
                    "comment_text": "Cheeky cunt! but thanks to you we get to progress the story, a school arc at that! Thanks for the chappy~!",
                    "time": "2016-03-22T09:01:37.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "579053",
                    "username": "Scholek",
                    "comment_text": "***Oh S rank? I remember in the game once reaching the S rank, instead of +,- they use a new ranking system, since the gap between the ranks are so high. Every rank above S rank, it’s divided into Novice, Veteran, Expert, Master, Grandmaster, Saint, King, Emperor, Divine, God. Once, they reach the S god rank, they reach a bottleneck, and to go into the next tier, they got to evolve their race. For instance, the bottleneck of the human race is A rank, they need to evolve into demigod to get into S rank. And to reach low god, they need to be evolve from S rank to SS rank and then max of SS rank is when they can evolve to mid god.***\nMe: What? I really tried to understand, but it's very unclear how this ranking system works. I really want to know.",
                    "time": "2016-03-22T11:37:32.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "579259",
                    "username": "Aileri",
                    "comment_text": "was it unclear? sorry. max rank of human race and other races are A+ rank\nto get to S they have to evolve into demigods\nonce reaching S, instead of + and -, each rank is separated by Novice, Veteran, Expert, Master, Grandmaster, Saint, King, Emperor, Divine, God\nevery rank up following S requires them to evolve their race, it's like a breakthrough",
                    "time": "2016-03-22T16:36:36.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "580737",
                    "username": "overpalada",
                    "comment_text": "Thanks for the chapter",
                    "time": "2016-03-23T17:28:27.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "582399",
                    "username": "sad860",
                    "comment_text": "Thanks for the chapter",
                    "time": "2016-03-24T20:35:20.0000000+00:00",
                    "replies": []
                }
            ]
        },
        {
            "id": "61303",
            "name": "Chapter 8: Zeff",
            "url": "https://www.royalroad.com/fiction/5580/yuiitsu-and-sei/chapter/61303/chapter-8-zeff",
            "content": "OK this ones actually a bit boring gomenasai\n\nChapter 8: Zeff\n\nAs I was lying on two branches that is in some garden on the academy under the warm afternoon sun, the space distorted again and from the distortion, the headmaster walked out with a calm and determined face. The white hair, white beard and the wrinkles on his face, however, makes him seem a bit tired.\n\nI have no idea what he’s determined about, but I hope it’s not troublesome to deal with, I’d rather not have to do anything, I’m lazy.\n\n“Can you two explain to me why you’re lying on a tree branch over 5 meters above the ground?”\n\nWhat should I tell him… The truth about running away from that annoying stalker brat, and then climbing to the top of the tree to hide from him?\n\nNope totally not saying that, it’d make me feel even more stupid. I’m just going to do what I do every time I don’t know what to say, MAKE AN EXCUSE! It worked in middle school, so why not here.\n\n““Ummmm, because it’s nice here?””\n\n“*Sigh* forget it, I’ve filled out the transfer sheet, now all we need is for you to take the test.”\n\nI don’t think he bought it... ah whatever, let’s just pretend nothing happened and go with the flow…\n\nI tried to get up from the tree, “”Let’s go now then.””\n\nBut I was stopped by the headmaster who raised his hand telling me to stop,\n\n“The test won’t be ready for a bit, since they’re making it now, so while we’re waiting, can you two answer some questions?”\n\n“”Why not””\n\n“What are the two of you. From Identify, I can’t see.”\n\n“”Not telling””\n\n“How about your race?”\n\n“”Nope””\n\n“Your class?”\n\n“”No””\n\n“*Sigh* How about the ACTUAL reason for your stay here, since you can test ‘eating bread’ anywhere. Why here?”\n\n“”Learning Magic””\n\nAnd testing eating too, but I don’t think he’ll like that answer…\n\n“Oh? So you two are one of those ancient beings that don’t bother with worldly matters and only seek knowledge?”\n\nWow there are beings like that?\n\nI wonder what they look like and where they are. Maybe I can go find some of them to help with my research. Yes, yes I’ll gather an army of ancient wise old men to help me search for a way to eat food! And then, I’ll make them research a way to create the tastiest food with magic! My plan is brilliant if I do say so myself.\n\n“So that’s what you two are, since you’re nodding your head. And as long as this academy has value, you’ll stay and protect it right? I’ve met a few of your kind in my lifetime and they’re all like that.”\n\n“”No wait we’re…””\n\nInterrupting my denial with a big grin on his face as if he just solved the biggest mystery in the world, the headmaster happily announced,\n\n“Worry not, I will not tell anybody about you two. I know your kind are very secretive, but I’m still a bit curious, why you’re not hiding your status and how you two are able to speak at the same time with the same words.”\n\nHis words seriously surprised me, well it was pretty obvious that if you met two people who are able to speak the same thing at the same time, it’d be pretty weird. I feel even stupider for not noticing this a while ago… Why didn’t anybody tell me!\n\nI guess I should stop this for when the school starts.\n\nLet’s let Yuiitsu be the quiet one and Sei be the one doing all the talking.\n\nAs for the closed eyes… nothing I can do about that, since they are one use per week and I doubt eyes with a scale symbol in it is normal… I probably have to figure something out before the school starts, or bullshit my way through it…\n\nLet’s see, what else stands out. The wings are retractable, and the equipment can be unequipped. I guess that leaves me only with the closed eyes,\n\n“Are you two okay?”\n\n“Ah, sorry I was thinking of something.”\n\n“Huh, why isn’t the black lady talking?”\n\n“Well, we just had a discussion and the two of us speaking in sync would be weird, so I’ll be the one doing the talking from now on. As for how we’re able to do it, great minds think alike?”\n\n“Haha, so you don’t want to tell me huh? It’s fine, I was just curious, also why don’t you two hide your status? Is it to deter unwanted people from bothering you two, or some other reason?”\n\n“What? What do you mean hide my status?”\n\n“Oho, so you two didn’t know you can hide your status?”\n\nI shook my head, because I had no idea what he was talking about.\n\n“You see, there’s a skill called [Identify], it allows one to tell the status of the person the use it on, and to counter it, people use a skill to either create a fake status for them to see, or just block it.”\n\nThis book was originally published on Royal Road. Check it out there for the real experience.\n\n“I never knew that…”\n\n“Don’t worry I’ll teach you, since you’re going to need it if you want to stay in school here.”\n\n“Before you do, can you tell me why did your attitude change so much? At the start you were on guard and cautious around me, but now you’re so open it’s scary.”\n\nWith a smirk as if he won something, the old man happily replied\n\n“Haha, I picked up a few tricks in my days. And one of them lets me tell what people are like from conversing with them. And your answers contained no lies, only honesty. Not only that, but also the actions you conducted yesterday also led to no casualty as well as no one being hurt, since if you two wanted to do something to the academy, I doubt I can stop you two because both your stats are question marks to me. Your people also have… unique knowledge, so you can consider this an investment, maybe I can get something out of it in the future.”\n\nHe seems like a good guy, but I’ll still keep my real identity a secret for now, since he might react differently if he knew the truth.\n\n“Thank you, Mr…”\n\n“Call me Zeff, Zeff Theofrius”\n\n“Nice to meet you Zeff, I’m Sei and this is Yuiitsu. Also, Did you know if you don’t set a punishment when you sign the Contract, it automatically invalidates itself, since there’s no consequence of violating the deal?”\n\n“So you mean…”\n\n“Yes, you made me waste a contract, by not stating any punishment and I’m still able to harm the people here if I choose to.”\n\n“I see, so why did you tell me this?”\n\n“Let’s say, it’s the first return from your investment”\n\n“Haha, I guess I can trust you two. Now about hiding your status, you need to open up your own status, before covering it in another layer of mana. Then change the mana into either a barrier to protect people from reading your status, or manipulating the information on it. Usually it takes a few months to learn, but one as powerful as you shouldn’t take too long.”\n\n…What the fuck…\n\nCovering my status in a layer of mana? I don’t know how to manipulate mana! Every time I cast a spell I just think of what the spell does and recite the spell words in my head and BAM it appears.\n\n…\n\nOkay, let’s try once before asking Zeff…\n\nAs I was imagining a slimy liquid that dripped down from above, slowly covering my status screen in a blue goo, I felt the same sensation of when I use a skill in game and mana decrease.\n\nI think that’s right? Now manipulate it to the values I want.\n\n…\n\nHow do I do that?\n\nLet’s just think of a bunch of 0s everywhere…\n\n[Fake Status(F)] Acquired.\n\nF class!? That low? Wow I must suck at this.\n\n“Marvelous, you learned it in a matter of minut…”\n\n“Huh?”\n\n“…”\n\nAs I was pondering why he suddenly stop talking, I look up to see Zeff standing there looking at me with a troubled face.\n\n“What”\n\n“I don’t think that’s right…”\n\nStatus\n\n00000 0000000 000 000\n00000 0000 000\n\n000000 0000\n0000 0000000 000\n\n00000 000\n…\n\nYea that doesn’t seem right.\n\n“Both of your status are messed up…”\n\nOh crap! I have a single status for the two of us. Meaning there’s no way to create a fake status, since we’ll have the same one…\n\nGod dammit, I guess I’ll just turn it into a barrier that blocks instead of altering the content seen.\n\nStuffing a third of all my mana into the barrier,\n\n[Status Barrier(S)] Acquired.\n\n“Ho? It’s now totally blocking me out.”\n\n“Yea, changing it indicating growth is too troublesome, so I’ll just block out people trying to view it.”\n\n“But how did you achieve such a high rank in the skill? Normally people start at a low rank, but your rank in the barrier is so high, it blocks me out completely!”\n\n“Ughhhh I’m good at barriers?”\n\n“Is it related to your class?”\n\nMaking a pouting face to try to change the topic\n\n“Not telling.”\n\n“Hoho, I guess I should stop trying to dig further huh? Well then, the test should be ready, so let’s go.”\n\nWith that, the space distorted again and following the headmaster, I also walked in.\n\n…\n\nYOU GOT TO BE KIDDING ME! THIS IS THE TEST!?",
            "comments": [
                {
                    "comment_id": "587254",
                    "username": "overpalada",
                    "comment_text": "Thanks for the chapter",
                    "time": "2016-03-28T06:46:08.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "587538",
                    "username": "Nanashikun",
                    "comment_text": "Thanks for the chapter, Kuma!",
                    "time": "2016-03-28T11:29:42.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "588072",
                    "username": "xacual",
                    "comment_text": "Ahh too bad I loved their in sync duo talking. Imagining how everyone would get weirded out by it was fun. The alternating sync from when they chatted with the adventurers was also good.",
                    "time": "2016-03-28T18:03:10.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "588705",
                    "username": "sad860",
                    "comment_text": "Yay (throws hands in the air from excitement) an update \\(^u^)/ . Thanks for the chapter",
                    "time": "2016-03-29T07:57:34.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "592524",
                    "username": "EndingNight",
                    "comment_text": "Greatly Enjoy This Story Keep It Coming.",
                    "time": "2016-04-01T03:01:40.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "698161",
                    "username": "Zemophobia",
                    "comment_text": "He used a third of his mana just to create a skill to hide his status? You would think a High God would have more mana than that but, meh. I don't read this story for its attention to detail, I read it to get cancer.",
                    "time": "2016-06-22T02:33:02.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "715347",
                    "username": "wraith26",
                    "comment_text": "shit.. im really annoyed at their attitude... fuck they act dumb and stupid... fuck. all the characters here act dumb and stupid..",
                    "time": "2016-07-06T23:14:36.0000000+00:00",
                    "replies": []
                }
            ]
        },
        {
            "id": "62722",
            "name": "Chapter 9: Outsider",
            "url": "https://www.royalroad.com/fiction/5580/yuiitsu-and-sei/chapter/62722/chapter-9-outsider",
            "content": "You see, the last chapter 9 was so good, that i was going to name this one chapter 10, but then again... I might get complaints about people wanting to see chapter 9 so scratch that @>@\n\nAlso I feel like the warning isn't doing its job... Maybe i should fire it and get a better one...\n\nSo without further Ado, Chapter 10! I mean 9!\n\n---\n\nChapter 9: Outsiders\n\nAfter following the headmaster into the portal, he brought me to a room. It was an empty classroom where the rows were set semicircular and each row was a bit higher than the row before.\n\nIt looked just like a university lecture halls you see on television.\n\n“Here’s the paper and pencil, go sit anywhere and tell me when you’re done. I’m going to exclude you from the magic and physical combat section because I don’t want my academy to have holes in it…”\n\nHey! That’s insulting, I’m not like those brawns for brains idiots who doesn’t know how to control their power!\n\nI took the paper and pencil while pouting, which brought a smile to Zeff’s face\n\n“If I didn’t know any better, I would have thought you were a mere child.”\n\n“Things aren’t always what they seem.”\n\n“Haha, that’s true.”\n\nWell, let’s get this over with.\n\n“Oh and split up, don’t want you two cheating now.”\n\nOh right, as I split the two off into different directions, from Yuiitsu, I felt a gaze…\n\nIt came from the window, but as I turned to the source, it disappeared?\n\nOpening my eyes, I tried to find any movement, while making sure the headmaster did not see them, but there was none\n\n“Is something wrong? Why did you two both turn to the window?”\n\n“Ah no it’s nothing.”\n\nI guess I’ll worry about that later, someone was probably just curious and looked through the window, while leaving right after.\n\nLooking over the test…\n\n…\n\nThis is stupid…\n\n…\n\nWhat kind of person put history on the test! HOW THE HELL AM I SUPPOSE TO KNOW WHEN THIS STUPID KINGDOM WAS CREATED!\n\nAnd what the hell is the Dark Era!\n\nThe math was easy as hell, and magic theory was mostly about how elements react to each other, which is common chemistry, but how do I deal with history!\n\nThere’s also a stupid section about etiquette! Who cares about that!?\n\nSure you don’t want to be disgusting in public, but who cares about walking in a straight line with back straight and all that crap. Just walk god dammit! How do I answer these!?\n\nScrew it, I’ll just leave it blank…\n\n“What’s wrong? Is it too hard?”\n\n“Huh, oh no. I’m done.”\n\n“Already!? It’s only been a few minutes!”\n\n“Well, most of it is blank, so that’s why.”\n\nThe surprised look on his face made me feel good, but I really did leave most of the test blank, since they had some really stupid subjects on there.\n\n“Well, we’ll grade it today and you can start class tomorrow. Here’s your keys, they’re for room 248 in the residents building. This academy is set up with the main academy in the center, the north-east building for residents and cafeteria, the north-west building for magic studies, and the physical activities building in the south. The academy is surrounded by a barrier in the Forest of Draggres, so be careful. Actually I doubt the monsters here are more fearsome than you, but don’t go breaking the barrier, it cost a lot of mana to repair.”\n\n“Thanks”\n\nAs I took the keys from the grinning old man, I once more felt the gaze…\n\n*Sigh* Since they’re only watching I guess it’s okay, but if they don’t stop soon, I’m give them a piece of my mind.\n\nAfter I left the room, the gaze was gone and I got a free place to stay at WOOHOO! But I forgot something important.\n\nReally important…\n\nWhich way is north!? And which building are we in right now?\n\n…\n\nI really want to try to eat something! The joys of good food cannot be matched! Then again, it’s back to cafeteria food again… *Sigh* Those suck!\n\nMaybe I should ask someone for directions…\n\nAh screw it, I’ll just walk around, there should only be 4 buildings, how hard can it be.\n\n---\n\nAs Yuiitsu and Sei left the hallway, an owl appeared from shadows in the room, and seeing it, the old headmaster grinned even more.\n\n“So what do you think?”\n\n“About what?”\n\n“Don’t play dumb, you and me both know what we’re talking about.”\n\n“The twins huh.”\n\n“What else could it be about.”\n\n“Nothing.”\n\n“So what’s your first impression.”\n\n“…They do not care.”\n\nHearing these unexpected words, the headmaster’s grin instantly disappeared and he stared at the owl expectantly,\n\n“What does that mean?”\n\n“It means as I have said, they do not care, not about life, death, the world, nothing.”\n\n“Really? It seems to me they were good children, that are kind.”\n\n“They act the part, but their eyes shows the truth, they have long lost interest in the world…”\n\nThis story has been unlawfully obtained without the author's consent. Report any appearances on Amazon.\n\n“Hmm, maybe your right, but how do you know which world they lost interest in?”\n\n“What do you mean…”\n\nThe owl’s eyes instantly turned sharp and glared at the headmaster, but he just revealed smirk and threw papers at the owl.\n\n“This… this is…”\n\n“Yes it’s their test…”\n\n“…Did they do this on purpose… Or are they outsiders… What are they truly…”\n\n“Possibly, but we don’t know that, now do we.”\n\n“…”\n\n“Either they purposely left it blank, or they know nothing about this world’s history, not about the Dark Era, Outsider’s invasion, nothing. As well as elemental theories and symbols that this world hasn’t even heard of yet. It’s highly likely that they’re outsiders…”\n\n“…So it has started again… With the goddess asleep, this will be a tough battle…”\n\n“Haha, or they could not.”\n\nHearing these words, the owl’s gaze instantly sharpened as he directed it to the headmaster.\n\n“What do you mean…”\n\n“As you have said, their eye’s shows lack of emotions correct?”\n\n“…”\n\n“When they were summoned, they also did not cause any harm, damage or even act up, and they didn’t try to hide any info, but instead revealed some, such as the World Contract.”\n\n“So you mean…”\n\n“It is possible they are deserters, and from them we can get useful intel.”\n\n“I see, but it’ll be dangerous…”\n\n“? Aren’t you six strongest dragon Grandielf? The one that repelled over 10,000 outsiders by himself?”\n\n“Yes, but their Status Barrier… It is at least S class… I was blocked out, so I don’t know their strength. And we all know how dangerous that can be, not knowing the strength of the opposition…”\n\nHearing this, the headmaster’s eyes instantly widened in surprise.\n\n“What do you mean! I just taught them that barrier a few minutes ago, they couldn’t possibly have made it past S class!”\n\n“Ho… Then that means you should’ve seen their status right? Then I guess it won’t be as dangerous as I thought.”\n\n“… Not exactly…”\n\n“!? What do you mean”\n\n“I couldn’t see anything… everything was question marks meaning, they’re much stronger than me…”\n\n“…I guess they’re even more dangerous than I thought…”\n\n“But I have a feeling, they’re not dangerous people, if not opposed, they will not act.”\n\n“Hmph, and I feel they’re dangerous beyond compare, they almost noticed me twice, and I was in perfect stealth.”\n\n“Then I guess, I’ll just leave the watching over them, to you, since you consider them dangerous.”\n\n“Huh!? What’re you going to do then?”\n\n“Nothing unless I have to do something.”\n\n“Easy going as always…”\n\n“Yup.”\n\n“*Sigh* How did you even make it to S class with that attitude, normally your kind is the first to perish.”\n\n“I trusted my instinct and they’ve never failed me yet.”\n\n“I guess that’s true… If not for your instinct, I guess I wouldn’t be here right now…”\n\n“You mean as my pet or among the living?”\n\n“As much as I hate to say it… Both…”\n\n“Haha, I guess that’s true.”\n\n“So what’re you going to do about them?”\n\n“As I have said, nothing, my instincts are telling me not to go against them, but instead follow and support them. They feel like a natural disaster, one you cannot avoid, but if you follow its tracks, not only will you avoid it’s wrath, you’ll also reap it’s benefits.”\n\n“*Sigh* And what if they still cause harm, even if you don’t go against them?”\n\n“That’s where you come in.”\n\n“*Sigh* Same crap as always…”\n\n“Haha, don’t be like that old chap, it’ll be fine, and also warn the dragons… Trouble’s brewing… I can feel it and with the goddess gone… It might be serious, so stay on alert.”\n\n“Understood.”\n\nAnd with that the owl disappeared into the shadow once more, leaving the headmaster Zeff Theofrius there with a difficult expression on his face.\n\n“Old chap… As always, you miss important details.”\n\nIn his hand, he held the two set of tests…\n\nBoth identical to one another…\n\n“They can speak in sync, answer the same questions with the same answers and leave the same questions blank. Even the name is not their own, but together Yuiitsu and Sei. There wasn’t even a sign of any magic being used like thought transmission. If they are the scouts for the Outsiders, then we’re doomed, but if we can get them on our side... Then we might get some nice intel and new knowledge. Even if there was no Outsider invasion, then we’d have lost nothing.”\n\n“…But I hope, I’m wrong… I truly hope, this feeling that tells me, you two are natural disasters that crush all within its wake is wrong… and the one telling me your kind is right…”\n“No, now’s not the time to worry about whether I’m right or wrong. For now I just have to try to bring them to our side…”",
            "comments": [
                {
                    "comment_id": "597753",
                    "username": "xacual",
                    "comment_text": "Aren't they the gate guards to prevent outsiders from entering the world though. Also it's weird a guy like the headmaster wouldn't connect Yuiitsu and Sei with the new race that appeared / new High God.",
                    "time": "2016-04-04T07:14:51.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "597786",
                    "username": "Silvania",
                    "comment_text": "First off thanks su~\n04/04/2016 07:14:51xacual Wrote: [ -> ]\nAren't they the gate guards to prevent outsiders from entering the world though. Also it's weird a guy like the headmaster wouldn't connect Yuiitsu and Sei with the new race that appeared / new High God.\nIf I remember correctly. The gate guards were just there to keep the people from earth and from the world they are in separated along the path the goddess herself opened..\nHowever another corridor wouldn't have the same treatment. (like for instance dungeons spawning monsters could be seen as more naturally or rather say ruins that 'offworlders' transport to or other things of that nature.)\nAnd yes. It would likely be odd that the headmaster hasn't noticed any new races appearing. (Though I doubt most high gods cruise around the planet leisurely [And into other peoples summoning circles. fufu])",
                    "time": "2016-04-04T07:45:01.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "598093",
                    "username": "xacual",
                    "comment_text": "No it mentioned back in the early chapter that members of the new race appeared in the world.",
                    "time": "2016-04-04T14:20:21.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "598158",
                    "username": "Quapple",
                    "comment_text": "Thanks for the chapter!",
                    "time": "2016-04-04T14:59:18.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "598222",
                    "username": "Aileri",
                    "comment_text": "The dragon and them are only guarding the passage from Earth to Elenair.\nAlso consider the annoying brat, if the guardians are guarding against all outsiders, how did he get there? So no they only guard against physical and spiritual forms that try to cross the passage the goddess has made between these two worlds. as for other passages, if they don't know they can't do much about it. #muscleheads\nThe new races appeared all over the world, but remember they look different from Yuiitsu and Sei, considering they don't have wings or dress like them at all, also the new races appeared a month ago, they've been trapped in the dungeon for... quite a bit...",
                    "time": "2016-04-04T15:44:35.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "598391",
                    "username": "Cycoteddy",
                    "comment_text": "This story is realy good looking i hope you continue it for a long time. I cant wait for the next chapter thx for writing.",
                    "time": "2016-04-04T18:17:52.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "604141",
                    "username": "Scholek",
                    "comment_text": "“It means as I have said, they do not care, not about life, death, the world, nothing.”\n“Really? It seems to me they were good children, that are kind.”\n“They act the part, but their eyes shows the truth, they have long lost interest in the world…”\nSo Yuuitsu and Sei just have a blank expression on their face because controlling expressions of 2 bodies is hard for the guy? That is my guess. It's not like he doesn't care about the world. He's probably just absent minded, hungry, and doesn't pay attention to facial expressions.",
                    "time": "2016-04-08T19:15:59.0000000+00:00",
                    "replies": []
                }
            ]
        },
        {
            "id": "65405",
            "name": "Chapter 10: Night",
            "url": "https://www.royalroad.com/fiction/5580/yuiitsu-and-sei/chapter/65405/chapter-10-night",
            "content": "Chapter 10: Night\n\n(Grandielf)\n\nI’m sorry Zeff, but I hope you’ll forgive me for going against you this once…\n\nThose eyes…\n\nThey aren’t from this world for sure. There are no eyes in this world with a scale in it, and when I saw it… I felt like they could see through everything. Within those eyes, I could also sense an unmeasurable power hidden underneath, one that I’m sure is extremely powerful.\n\nAnd even though I was in perfect stealth, those eyes makes me question whether they noticed me or not, but one thing is for sure. They knew they were being watched and yet they did not take any action…\n\n…\n\nThey are arrogant...\n\nI probably have only one chance to destroy them. Even if I die, I’ll have to convince the Five Elders to use that orb to summon Daeneries, because they are that dangerous…\n\n---\n\n(Hallway inside the main academy building)\n\n*Sigh* I’ve been wandering around this stupid building for a while, but I still can’t find the god dam door out!\n\nThe sky’s already dark, so the cafeteria should be closed by now…\n\n*Sigh*\n\n“You two over there, Stop!”\n\nHuh?\n\nAs I turned around, I saw a little girl wearing a blazer and skirt around 14 walking towards me with a rapier drawn.\n\nWait…\n\nIs that a rapier!?\n\nAre weapons allowed in this academy?\n\n“HEY! I’m talking to you!”\n\n“Ah, I’m sorry, I was thinking of something. May I ask what you want?”\n\n“Humph, demon scum. Get out of the academy or I’ll kill you here and now!”\n\nIsn’t this person jumping to conclusions too easily?\n\nAnd isn’t that punishment a little harsh to demons?\n\n“I’m not a demon you know.”\n\n“Hmph, you might not be a demon, but you hang out with one, so it doesn’t make you any better!”\n\nI hang out with one?\n\n…\n\nDoes she mean Yuiitsu?\n\nLooking towards Yuiitsu, I just see a pretty human girl. There’s no part of her that makes her look like a demon?\n\nThen again, I don’t even know what demons look like in this world.\n\n“Why is my friend considered a demon?”\n\n“Humph, don’t act dumb with me, everyone knows demons have black hair with red eyes and although both of you have your eyes closed, her hair’s black. This means she must be a demon pretending to be human!”\n\n“Can’t humans have black hair?”\n\n“Only humans that learn black magic and its considered illegal in the human kingdom, when found its instant death sentence!”\n\nSo she’ll see me as either a criminal or demon huh? And if I pick either one, she’ll kill me…\n\n*Sigh* so troublesome\n\n“She’s not a demon, she’s my twin sister. She was cursed and now her hair is black.”\n\n“… Show me your eyes, if it’s not red, I’ll believe you…”\n\n…\n\nShould I…\n\nAs I opened my eyes with Yuiitsu, I used Sei to quickly explain.\n\n“She can’t talk because of the curse, and as you can see from her eyes, something was done to her.”\n\nAfter seeing Yuiitsu’s eyes, the girl just stood there with a shocked face and stared in silence.\n\nAlthough I had a straight face, on the inside, I was screaming please believe my lie!\n\nI seriously have no other ideas at this moment. The only other idea was finding the headmaster, and asking him to make some lie up, but I can’t find a way out of this building, much less find the headmaster.\n\nThen again, there’s the option of killing her, but that’s not going to help disguise Yuiitsu’s hair in the future and the headmaster’s promise…\n\nWait, I can also knock her out! That also works.\n\n“Seeing as how you two look so similar, your different hair colours, as well as her eyes, I’ll believe she’s not a demon. But how do I know she didn’t become like that after learning dark magic?”\n\nDammit, she’s sharp…\n\nSorry, please don’t blame me for this,\n\nAnd right when I used [Speed] to increase my movement speed,\n\nThe headmaster teleported in from the side of the wall,\n\n“I thought I specifically said, no magic in the hal…”\n\nAnd when he saw me, his face instantly cramped,\n\n“Hello”\n\n“What… What’re you doing here?”\n\n“Uh… I kind of, might of gotten a bit lost…”\n\nThis book's true home is on another platform. Check it out there for the real experience.I feel so embarrassed right now I could literally feel my face turning red… I haven’t gotten lost since elementary school!\n\nSeeing my reaction, the headmaster was also a bit stunned\n\n“Right, probably should’ve told you, the only entrance and exits are on the second floor.”\n\n…\n\nWhat…\n\nWhat kind of building only has entrances on the second floor!\n\nWhy don’t you guys put any on the first floor!?\n\nDo you know how embarrassing it feels to admit a mistake like this in front of others!\n\nI could literally feel my anger boiling and my face turning red, not from shame this time, but rage!\n\nI wasted around an hour god dammit!\n\n“Headmaster, you know them?”\n\n“Huh? Oh if it isn’t Miss Zeifrei, on your daily after hour patrols I see.”\n\n“Yes sir, and I found these suspicious individuals on the school grounds, and that one over there seems to be a dark mage.”\n\n“Dark mage?”\n\nAs the headmaster turned around to look at us, he suddenly had a realization.\n\n“Ah! Miss Zeifrei, she is not a dark mage!”\n\n“Oh? So she truly was cursed? Then what are they doing here after hours if not coming to find live sacrifices for her dark magic?”\n\n…\n\nDark magic sacrifice people?\n\nAre we talking about the same dark magic here? The dark spells I have don’t need any live sacrifices.\n\n“She’s here because she got lost, she’s going to be a new transfer student starting tomorrow, so please take care of her.”\n\n“I see… Then I guess it’s fine, but she’ll still be punished for using magic on the school grounds without permission.”\n\n“Ah, I forgot to tell her the rules, so please overlook this once Miss Zeifrei.”\n\n“*Sigh* Yes, sir.”\n\nAnd with that, she walked away, but not before giving me one last hateful glare.\n\nHey! What did I do!?\n\nTurning my face away from her leaving back, I could see Zeff seriously looking at me.\n\n“So why were you going to use magic…”\n\n“…I was going to knock her out before running away…”\n\n“…”\n\n“What?”\n\n“What would you do after knocking the king’s royal guard captain’s daughter out?”\n\n“Runaway of course.”\n\n“…”\n\nWhat do you expect me to do? Stand there and wait to be punished? Some people these days are so stupid.\n\n“Are you sure you’re not a child?”\n\n“Are you sure you’re not an idiot?”\n\n“Haha”\n\n“Humph”\n\n“Coming from the one that got lost?”\n\n“…your childish…”\n\n“HAHA! Well, since there’s nothing else you need, I’ll be taking my leave.”\n\nAs I leave the building, I saw the girl called Zeifrei standing outside the door by the wall,\n\nWhen she saw me, she instantly pulled out her rapier again and pointed it at me.\n\n“What are you two?”\n\nHuh!?\n\n“What do you mean”\n\n“Don’t try to act dumb with me” and suddenly she leaped pointing the rapier’s tip towards Yuiitsu’s throat,\n\nAs she was just about to hit Yuiitsu’s throat, I used Sei to pull Yuiitsu out of the way and seeing my movement, she suddenly slashed sideways with even more force than before, but I already jumped down the stairs and started to walk away.\n\nThere’re times when you should fight and there are times you should run and since I shouldn’t hurt the students, this time should run, but if I’m going to run, I want to at least look cool while doing it.\n\nI mean seriously, running away look cowardly, but walking away slowly looks cool!\n\nSeeing me walk away, she started to run at me with the rapier\n\n“GET BACK HERE!”\n\nNOPE! RUN! SCREW LOOKING COOL!\n\n“**** JUST WAIT TILL I CATCH YOU TWO!”\n\nWHY WOULD I WAIT IDIOT!\n\n---\n\nHiding in a flower bed, no one will suspect a thing!\n\nAfter around an hour, I slowly got up from the flower bed in the garden\n\n“*Sigh* I hope I lost that annoying girl“\n\n“Huh? Who are you?”\n\nEh?\n\nTurning around, I saw a little boy with a scholar like look. He had snake like eyes, two black horns on his head, a full head of black hair that moves like water and pale white skin. On his back was a lizard tail and a pair of wings formed from the same material as his hair.",
            "comments": [
                {
                    "comment_id": "618226",
                    "username": "Fennin",
                    "comment_text": "Thanks for the chapter! :D",
                    "time": "2016-04-18T09:31:16.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "618240",
                    "username": "Shiki",
                    "comment_text": "Man... I wish the misunderstandings will stop soon...  Well, It's good to see the 2-in-1 MC ran away from the annoying miscellaneous characters while unconsciously humiliating them(LOL).\nBut still, it's still painful to see the Newly appointed High God(s) run away from the people who didn't know their true prowess via instinct(I know 'tis absurd but...)\nI'd like to see them do the teasing rather than being teased.\nAnyhow, thanks for the chapter ~~!\nP.S. Is Yuuitsu and Sei have only one consciousness ?\nI see some novels with MC have multiple consciousness e.g. like 1 is controlling the pen while the other is munching goodies but still only one mind. Like a supervisor (No, not multiple personality)",
                    "time": "2016-04-18T09:51:35.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "618476",
                    "username": "coldfire142",
                    "comment_text": "Miss Zeifrei btter watch herself shes running on thin ice and messing with some one she should not mess with.",
                    "time": "2016-04-18T15:10:42.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "618491",
                    "username": "SomeReader",
                    "comment_text": "I always liked misunderstandings lol",
                    "time": "2016-04-18T15:20:59.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "618503",
                    "username": "Quapple",
                    "comment_text": "Thanks for the chapter ~",
                    "time": "2016-04-18T15:24:12.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "618642",
                    "username": "Rse",
                    "comment_text": "Thanks for the chapter",
                    "time": "2016-04-18T16:40:34.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "618757",
                    "username": "xacual",
                    "comment_text": "Daeneries was the Dragon God from the starting chapters wasn't he? I can't wait to see him get summoned and then greet the two of them. No wait actually wouldn't he be really up for the fight after the two of them ran away from him before? Well regardless, Daeneries' attitude toward them will probably reveal who or what they are to anyone watching.",
                    "time": "2016-04-18T17:54:56.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "619488",
                    "username": "kydomos",
                    "comment_text": "thanks for the chapter!!",
                    "time": "2016-04-19T03:49:12.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "715373",
                    "username": "wraith26",
                    "comment_text": "nHOLY FUCKING CUNT BITCH !!! SHIT FUCK FUCK FUCK!!!!!! im really really annoyed at the attitude of the mc!!! FUCK!! I SWEAR! TGEY ARE DUMB! FUCKING DUMB!!!",
                    "time": "2016-07-06T23:31:00.0000000+00:00",
                    "replies": []
                }
            ]
        },
        {
            "id": "73697",
            "name": "Chapter 11: Darkness",
            "url": "https://www.royalroad.com/fiction/5580/yuiitsu-and-sei/chapter/73697/chapter-11-darkness",
            "content": ":V\n\n~.~ (。-ω-)zzz\n\n----\n\nChapter 11: Darkness\n\nThe scholar looking boy was narrowing his eyes, while emitting killing intent at me. Combined with his looks I swear it feels like death itself is standing before me.\n\n“I won’t repeat my question a third time, Who Are You?”\n\nWith that, the dark fluid started to gather around his two hands forming long sharp claws that seem to suck in all light. After the claws were formed, no longer did the black fluid move, but instead it hardened. After the claws, the same fluid started to cover his whole body, turning into a black set of armour that emit an aura of death.\n\nAt the same time, darkness starts to slowly rise all around the three of us, creating a space with just the three of us.\n\n“My name is Sei and this is Yuiitsu.”\n\n“And what are you two doing here?”\n\n“We were chased here by that messed up girl? I mean seriously, who attacks a person they’ve never met with a rapier!”\n\n“No I don’t mean in this garden.”\n\n“Oh, I’m a new student here, nice to meet you.”\n\nWith a kind smile I seriously hope he doesn’t attack me. I mean weird black fluid + big dark claws = bad idea to mess with. I’d say that’s a pretty easy to understand equation.\n\n“Enough of your jokes, I mean why’re you in this world?”\n\nThis world? I doubt he would like the joke about ‘When a man and woman are deeply in love with each other’…\n\n“A goddess sent us here.”\n\n“A goddess huh? Tell me, what is her name.” Slowly narrowing his eyes further, the boy got into fighting stance.\n\n“Ughhhh, her name?”\n\n“Yes, What Is Her Name?” Slowly saying one word at a time, I could feel the tension rising.\n\nBut in all honesty, I forgot. Or did she even tell her name to me? Wait a sec, did I even ask?\n\nWow, agreeing to the request of a random stranger without even knowing their name… I must be a genius…\n\n“I don’t know?”\n\n“And what did she send you two here to do?”\n\n“She sent us here to guard the gate linking the two worlds at the bottom of the Dungeon of Origin.”\n\n“And the two of you are all the way out here, in the middle of this academy becoming students instead of doing your job huh? If you’re going to tell a lie at least make it believable.”\n\nAfter that, he immediately dashes at us,\n\n“But it’s true!”\n\nWithout listening at all, he swipes his claws at both of us at once. I jumped back in order to avoid it, but just when I thought I avoided it, the claws shot off a black slash hitting both of our bodies at the same time knocking us back.\n\nSlowly we got up from the ground, but the shadow guy did not follow up. He just stood there staring at us.\n\n“…what…”\n\nWatching us get up, I could clearly see his eyes getting wider and wider.\n\n“What the hell are you two!?”\n\nI’d like to say the same to you. What kind of creature has those type of wings and hair god dammit, I haven’t even heard of anything like him in light novels!\n\nIf you encounter this tale on Amazon, note that it's taken without the author's consent. Report it.\n\nAfter I checked my health…\n\nSeriously?\n\nOnly around 5%?\n\nYou know, I kind of expected better from a guy who looks like a mid or final boss type of character…\n\nJust as I was about to take out my weapons from my inventory, I noticed something weird from the edge of my vision.\n\n…\n\nThat did not happen in the game…\n\nFrom Sei, white fluids oozed out of the slash across her body, and from Yuiitsu, black fluid oozed out instead of blood.\n\nLooking at my status, there wasn’t any debuffs, so I had no idea what this thing was either and as I watched, the cut across the body started to close itself up.\n\nStanding here isn’t going to get me anywhere, so\n\nI decided to take advantage of the dazed enemy and quickly equipped the combat gear that I removed, which left him in a bigger daze.\n\n“You… you two are angels!?”\n\nWait what?\n\n“Those wings, the white wings of an angel and the black wings of a fallen, there’s no mistake.”\n\n“Sorry, but we’re not angels or fallen, we’re balancers.”\n\n“Wha?”\n\nGuess there’re no balancers in this world? Weird, they were a pretty popular class in the game. The fire and water balancer which has one body fighting like a berserk, while the other healing him from behind. The earth and wind balancer, which has a strong tank with an fast archer supporting him. And lastly, the light and dark balancer, which has one negating attacks, while the other one has controlling abilities.\n\nAlthough they were a popular class, people did suck playing them, since you had to control two bodies which takes skill. But those that master it are really strong, since they take two rolls with one character, but the stats are linked, so the player has to make either one strong and the other weak or both average. In the case where they make one strong and the other weak, the enemy can just focus on attacking the weak one, since the health and mana is linked.\n\nOh right, I’m no longer a balancer, now the job’s changed to something called a balance god? Wonder what new skills I get.\n\n“fu, fua… It matters not what you are, all that matters is you aren’t supposed to be in this world, so either leave quietly, or we will be forced to kill you.”\n\n“Why am I not supposed to be in this world though?”\n\n“We the low and mid gods watch over the people, and a few days ago, the power of a being above S rank appeared in this world in a pillar of light. It did not match any of the beings we knew of, so of course we thought it was the new high god that appeared. I came here to find it, but before I could, it masked its own status and instead of finding one person, I found two. So don’t you think it’s time to drop the act Outsiders”\n\n“Outsiders?”\n\n“Yes, you”\n\n“You?”\n\n“No, YOU!”\n\n“Me?”\n\n“YES! ME!”\n\nThis is kind of fun…\n\n“You?”\n“UGHHHHHH enough talking! If you two won’t leave, I’ll force you!”",
            "comments": [
                {
                    "comment_id": "675085",
                    "username": "KK2",
                    "comment_text": "Hey its alive! Thanks for the chapter!",
                    "time": "2016-06-02T05:08:16.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "675092",
                    "username": "kydomos",
                    "comment_text": "thanks for the chapter!!!",
                    "time": "2016-06-02T05:13:10.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "675093",
                    "username": "Ivanator The Great",
                    "comment_text": "You're back! and don't leave us again please~",
                    "time": "2016-06-02T05:19:39.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "675096",
                    "username": "Shiki",
                    "comment_text": "Welcome back and thanks for the chapter~\nReally, quite a letdown. He said the they mid and low gods are tasked to watch the world and here we are, an idiot watcher who's dumb enough to attack their superior. Intead using brains and try to talk(pry) them, he just attack out of nowhere not knowing that he attacked is newly appointed high god... Good grief. He and the others should've known that there's a new high god.\nI hope that the others aren't watchers(lol) like him",
                    "time": "2016-06-02T05:20:59.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "675109",
                    "username": "Quapple",
                    "comment_text": "Thanks for the chapter~",
                    "time": "2016-06-02T05:35:20.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "675111",
                    "username": "Aileri",
                    "comment_text": "✋ ✌? ☹✌☪✡",
                    "time": "2016-06-02T05:38:59.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "675123",
                    "username": "ArchmageNaoki",
                    "comment_text": "Watchers? More like stalkers with immature and emotion driven minds that easily got into wrong conclusions. Tch tch tch, what a god they are.",
                    "time": "2016-06-02T06:00:14.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "675132",
                    "username": "Wayang Emperor 'The First'",
                    "comment_text": "Moaaarrrrrrr",
                    "time": "2016-06-02T06:10:55.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "675138",
                    "username": "xacual",
                    "comment_text": "Yeah for a god he's pretty immature and impatient.\nIs this low/mid god going to summon the one dragon god and then get forced into bowing for forgiveness when he learns his mistake?",
                    "time": "2016-06-02T06:28:23.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "675245",
                    "username": "Sddg97",
                    "comment_text": "i feel bad for the inhabitants if these are their goods.......",
                    "time": "2016-06-02T09:58:28.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "675270",
                    "username": "Astra19",
                    "comment_text": "MORE MORE Must Have MORE!!\nThanks for the chapter",
                    "time": "2016-06-02T10:55:09.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "675274",
                    "username": "cronie",
                    "comment_text": "02/06/2016 09:58:28Sddg97 Wrote: [ -> ]\ni feel bad for the inhabitants if these are their goods.......\nNo wonder this world was going down the drain and needs a new god of balance.",
                    "time": "2016-06-02T11:00:56.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "676191",
                    "username": "udin-san",
                    "comment_text": "you're back! Thank you for the chapter~",
                    "time": "2016-06-03T05:46:30.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "715383",
                    "username": "wraith26",
                    "comment_text": "well all of them are dumb!! maybe this is as far as the intelegence of the author can go.. im really disappointed... really stupid.. i dont even know why im reading this stupid shit",
                    "time": "2016-07-06T23:43:23.0000000+00:00",
                    "replies": []
                }
            ]
        },
        {
            "id": "75110",
            "name": "Chapter 12: Fight",
            "url": "https://www.royalroad.com/fiction/5580/yuiitsu-and-sei/chapter/75110/chapter-12-fight",
            "content": "Sorry for being late.\n\nI was lazy :V AND I STILL AM.Oh yea if anyone has something to say that might improve my novel please do, since I'm still a novice @>@\n\nBasically HALP MEH!---\n\nChapter 12: Fight\n\nThe moment the man rush in, I took a stance. The one I always used in the game to test out my opponent’s level to find the best approach to deal with them.\n\nI let Yuiitsu stand to the left while holding the black sword in her right hand facing towards the enemy, and holding the white sword in a reverse grip to the left side. At the same time, I let Sei stand on the right side holding the black sword in her left hand, while also holding the white sword in a reverse grip.\n\nThis is my usual stance for combat, since the white blade has a special effect on it called [Parry]. The ability is hard to use, but it mitigates damage up to 100% and deflect it, however, using it requires a lot of skill. I mean seriously, try to deflect a fireball flying at you at like 6000000000000km/h, ok not that fast, but it’s still hard. Even I haven’t mastered it yet, that’s how hard the ability is and, not to brag but, I was one of the most skilled players in the game! Ok maybe I was bragging, just a little… a litttttttleeeeee…\n\nThe ability itself is not a very rare ability, however it can only be found on weapons above epic rank, and since there’s so many players in the game, epics aren’t really epics anymore… They’re more like rares now?\n\nBefore equipments were separated into common, uncommon, rare, epic, legendary, ancient and origin, but due to the popularity of the game, there were so many players even ancient became common. Because of that, whoever the maker was decided to make an update and the drop rate decrease by the population size of the whole game.\n\nAfterwards, the new weapons were a lot stronger than the old ones and special effects appeared in them, so everyone had to restart getting their equipment. It was funny watching one of my guild friends who got a weapon with parry in the past, he tried to parry everything everywhere and because he kept hitting his allies by accident, no one wanted to party with him after for weeks. One time in the middle of a boss run, he parried this [Unholy Spear] into the tanks, ummm, ‘LOWER AREA’ and of course the tank just had to have his pain setting on and man did he regret that. Everyone fell on the floor, one due to pain, others due to laughter. Of course we got whipped out, but it was worth it.\n\nBreaking out of memory lane, I think the sudden change in stance must have surprised the man and made him think more carefully before rushing in because right away, he stopped his charge and started to go around us.\n\nWhen he tried to get around, I make Yuiitsu turn over and stand back to back with Sei to ensure there are no blind spots.\n\nI stood there ready to counterattack, but he just circled around me. Although he started off running pretty fast, either because he’s not a speed type character or he’s not high enough level, I can clearly see him circling me…\n\nThis looks cool in anime and all, but being in the middle of it… feels kind of stupid…\n\nI mean all he’s doing is tiring himself out…\n\nBut the weird thing is, although I can see him clearly, why are there two of him now?\n\nAnd just as I was confused about whether I’m hallucinating or he has a twin brother, another one arose from the shadows.\n\n…\n\nSHADOW CLONE!?\n\nWhat the hell!? There’s no shadow clone skill in the game!?\n\nBut that’s going to be awesome if I can learn that!\n\nEven though I do have the basic city teleportation skill that everyone has, I would still love to be able to be at multiple places at once.\n\nJust think about it!\n\nHaving the taste of hamburgers, beef noodle soup, fries, pizza and a bunch of others in your mouth at the same time instead of going to each town eating them one after the other.\n\nA case of literary theft: this tale is not rightfully on Amazon; if you see it, report the violation.\n\nIt’d either turn into a heavenly tasty or disgusting as hell, but I’d kind of want to try that.\n\nWaking myself up from my trance, I noticed we were completely surrounded. The four of them stood in all four directions blocking us off, and as if that wasn’t bad enough, we were surrounded in a lack dome. It seems the darkness from rose from the grounds hardened creating an area just for us to fight. I didn’t even notice when it formed, since I could see in the dark, but this might be bad due to not knowing what effects this dome has.\n\nThe four of them slowly raised their claws at the same time and started to emit killing intent from all four directions. With the same looks, aura and actions, I really can’t tell which is the real body.\n\n“”””I did warn you to leave quietly, but now, it’s too late.””””\n\nHuh, so that’s what talking at the same time sounds like to others. It sounds kind of nice…\n\nAs I was debating whether to talk in sync or one after the other, the two shadowmen on the side made shadow spikes erupt from the ground flying towards them trying to split Yuiitsu and Sei apart.\n\nHowever, I had other plans.\n\nMaking Yuiitsu leap forward, while Sei leaping back, I separated the single enemy from his group and since Sei’s specialization was in negation, she should be able to hold out long enough for Yuiitsu to test the enemy’s strength and weaknesses to figure out a fighting style.\n\nSeeing my movement either infuriated them or surprised them greatly because all of a sudden they had a panicking look on their face.\n\nAs the three of them rushed at us, I had Sei stop and stand her ground.\n\nAlthough I want to conserve as much mana as possible, I had to make sure Sei doesn’t die since the two bodies are linked, so I decided to use some of my higher end spells at the start.\n\nThe three enemy leaped at Sei, but I’m not sure if they’re using abilities or not since no one yells out the ability’s name unless they’re inexperienced with the skill and still need the chant words to activate it.\n\nAt the same time as the three enemy reached Sei, Yuiitsu seems to have reached the enemy. With clenched teeth and pure rage showing on his face, he was attacking with one claw across the body as well as the other going around to attack Yuiitsu’s back.\n\nFrom the claw going around the back oozing out a dark aura, I can say for certain he activated some skill.\n\nAt the same time, the three engaging Sei also had a dark aura ooze out one of their claws. Not taking any chances, I decided to use [Demonic Extraction] and [Balanced Blow] combo.\n\nThe skill [Demonic Extraction] sucks in mana from the enemy using physical contact based on damage dealt, while [Balanced Blow] sends a shockwave outwards in every direction based on all the mana gained while it’s charging with a maximum of 5 second charge.\n\nWhile I had Sei prepare to defend herself, I made sure Yuiitsu would deflect the claw going to her back with the white blade and attack the front claw head on with the black blade.\n\nSeeing Yuiitsu’s movements, the man made a smirk on his face having full confidence in his abilities, but at the same time, so did I. Killing that giant golden RETARDED lizard must’ve given me some kind of power up, plus he probably couldn’t insta kill me since he already failed once and he got 2 hits on me at that time! One on each body at the same time! That kind of hit does 500% damage due to my jobs weakness!\n\nAs the two swords clashed with the two claws, something unexpected for both of us occurred.\n\n“Eh?”\n“”Huh?””",
            "comments": [
                {
                    "comment_id": "683346",
                    "username": "AnarchyDev",
                    "comment_text": "This is seriously low blow cliffhanger. Thanks for the chapter",
                    "time": "2016-06-09T08:20:50.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "683349",
                    "username": "Wayang Emperor 'The First'",
                    "comment_text": "Noooooo",
                    "time": "2016-06-09T08:23:22.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "683352",
                    "username": "kydomos",
                    "comment_text": "Why the cliff hanger!!!!!\nAhhhhhhh!!!!!!!",
                    "time": "2016-06-09T08:25:38.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "683353",
                    "username": "Aileri",
                    "comment_text": "I always cliffhanger people (屮｀∀´)屮\nOk, I'll try to get the next one out faster, but PREPARE TO BE CLIFFHANGERED AGAIN!!!! (屮｀∀´)屮\nor not, :V maybe I'll get lazy, who knows.\nEdit: Since i promised for the next one to be out faster, I'll do it, so expect it soon, but not like next few hours soon >.>",
                    "time": "2016-06-09T08:26:51.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "683375",
                    "username": "KK2",
                    "comment_text": "Sadist.",
                    "time": "2016-06-09T09:04:29.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "683403",
                    "username": "R3B3lMilco",
                    "comment_text": "Low Blow man..Low Blow..",
                    "time": "2016-06-09T09:54:53.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "683425",
                    "username": "sad860",
                    "comment_text": "Are you a god of temptation because I won't give in to it I won't eat that suspicious apple (he says with his hand already in the basket) oh well thanks for the chapter I hate to admit it but that was a pretty good cliff hanger I didn't expect it coming and it's left me wanting more",
                    "time": "2016-06-09T10:21:52.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "683443",
                    "username": "Shiki",
                    "comment_text": "... Low blow man... low blow\nStill, It kinda irks me that a low level watcher(lol) getting overconfident like an arse... even though in reality, he is the one who has the disadvantage. This feels like seeing Overlord(LN) all over again...\nAlso,  [I was one of the most skilled players in the game! Ok maybe I was bragging, just a little… a litttttttleeeeee…] Even she's bragging... the truth is still the truth :D. She did solo kill the highest boss in the game ~\nEDIT: Oh... Seeing the ending... either another high god showing up, or the superior of watcher(lol) is showing and will reprimand him(watcher(lol)) for being stupid, or lastly, superior showing up stopping the fight.",
                    "time": "2016-06-09T10:54:37.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "683511",
                    "username": "Ivanator The Great",
                    "comment_text": "That's just... author, why? why do you punish us with these cliffhangers?",
                    "time": "2016-06-09T12:21:16.0000000+00:00",
                    "replies": []
                }
            ]
        },
        {
            "id": "75827",
            "name": "Chapter 13: Rip 'Ere-chan'",
            "url": "https://www.royalroad.com/fiction/5580/yuiitsu-and-sei/chapter/75827/chapter-13-rip-ere-chan",
            "content": "It seems I'm getting worse at writing as the story goes on :X\n\nWho knew ~.~----\n\nChapter 13: Rip ‘Ere-chan’\n\n*Crack*\n\nAs the swords and claws were about to clash, the dark dome that surrounded us started to crack. And from the cracks, vines squirmed in slowly, wrapping around the dome and slowly crushing the dome to pieces.\n\nI was thoroughly confused seeing the turn of event, but upon seeing the vines, the light in the man’s eyes seemed to shine and a big grin appeared on his face.\n\nTurning his face back towards Yuiitsu, he slowly mouthed words for me to read.\n\n‘You Lost’\n\nHuh?\n\nAfter mouthing those words, the claw that was about to meet my blade head on changed its target and instead went for my open chest. As the claw went for my chest, the darkness in it seems to have diminished and instead of pure black, it turned semi-transparent.\n\nI was contemplating on what this meant, but with no time, I decided to continue my course of action. The black blade and the black claws will still collide mid-air due to the adjustments being made too late.\n\nAs the claw from the back was parried to the side, only causing a minor scratch on Yuiitsu’s arm, which was as predicted, however, when the black blade and black claws was about to clash, the black claw phased right through.\n\nI could not help but let out a surprised noise seeing the unexpected situation.\n\n“”Wha?””\n\nThe grin on smirk on the man’s face grew even wider seeing my predicament.\n\n“Guard me!”\n\nAt the same time the word flew out of his mouth, the vine nearest to him expanded at an incredible pace, wrapping around his chest and a small diamond shape appeared from the tip of the vine. From the diamond’s four sides, silver petals expanded outwards in all direction.\n\nShimmering under the moonlight, a steel flower bloomed in front of my enemy, defending him.\n\nHowever, unfortunately for me, I only had my equipment with a giant cut through it while he had a black armour and a metal flower set up as his defense.\n\nTo be honest, I kind of expected better from my equipment due to them being ancient rank, but since it doesn’t boost defense at all, I guess it makes sense.\n\nAs his claws once more cut diagonally across Yuiitsu’s body, my blade slashed across his. With a clank, the blade ripped through the armour and metallic flower.\n\nWhen my blade cut through his defenses, leaving a giant gash across his body, he also let out a bewildered sound.\n\n“!?”\n\nDue to the force from the exchange, I was able to send him flying, but his blow did cleanly cut through Yuiitsu’s body.\n\nFrom Yuiitsu’s wound, black fluid oozed out once more, but the body did not separate. Although I wasn’t able to cut him in half, my sword still did leave a large gash on his body and from it, blood spewed out nonstop.\n\nUnlike last time where it barely hurt, this time it hurt like crazy! The pain was so bad I almost fainted, but if I faint now, I’ll be as good as dead. Using all of my strength to hold onto my consciousness, I make Sei quickly blow the enemies to pieces before jumping in front of Yuiitsu to defend her.\n\nWith a wounded body like that, I doubt I can move Yuiitsu much anymore.\n\n*Sigh* I guess this is what I get for underestimating my opponent, thinking they’re just some weak mob…\n\n“How…”\n\nI tilt my head to the side because I seriously have no idea what he’s talking about.\n\n“How did you cut through a Bastion flower and my armour made from a shadow dragon’s scale!”\n\nFufufu, I flexed up my arm showing the… um… muscle? On it.\n\n“”We are strong!””\n\n“With those weak skinny arms? What trick did you use!”\n\n…\n\nThought I can’t really deny that… I did make this character based on cuteness, but as a man, it still hurts on the inside…\n\nEven though I wouldn’t consider myself buff before, but\n\nThis tale has been pilfered from Royal Road. If found on Amazon, kindly file a report.\n\n“Ara ara, Ere-chan, how many times did I tell you not to command my p…”\n\nThe voice was enchanting, it was the voice of a mature woman. Yet at the same time, the killing intent behind the words she said was frightening.\n\nLooking towards the owner of the voice, I was stunned.\n\nThe woman had quite the tall figure and had a big bust. But that was not what stunned me. She wore a beautiful green dress that covered most of her body, long silky green hair cascaded down her back and her gorgeous face combined with her beautiful pink eyes made her look like a pink flower in a sea of grass.\n\nI was literally standing there with my mouth wide open staring at her.\n\nShe looked towards the man I was fighting and instantly, the killing intent behind her voice disappeared with the wind.\n\n*Sigh* “I guess it couldn’t be helped, seeing you took so much damage. Whelp, let’s go then.”\n\n“Wait what!?”\n\n“We’re leaving.”\n\n“Why?”\n\n“Quit questioning me, let’s go.”\n\nWith that, she grabbed ‘Ere-chan’’s arm and pulled him along, dragging him on the ground.\n\n“AHHHHHHH!!!!”\n\n“Quit whining like a little girl!”\n\n…\n\nI don’t think you should be doing that, the wound opening and more blood spewing out though… now I actually feel bad for him…\n\nShe turned around and smiled at me.\n\n“Bye bye Yui-chan and Sei-chan, sorry for my little kouhai here causing trouble, we’ll take our leave now.”\n\nWith that, she flew away dragging the poor guy along…\n\n…\n\nYou know at first I thought I’d like her as my girlfriend, but now… not so much…\n\nWhile I was looking in the direction where the two left from, a voice called out from in front of Sei, the same place where the plant woman came from.\n\n“Quite a shrewd one isn’t she.”\n\n“”Eh, headmaster? Why are you here?””\n\n“Why wouldn’t I be here after the huge mess you two caused?”\n\n““Mess?””\n\n“Look around you and tell me what you see.”\n\n…\n\nIt’s a pretty flat land, with a stone road nearby?\n\n“”land?””\n\n“Yes land, and what was here before?”\n\nBefore? I think I was in a flower…\n\n…\n\nOh…\n\n“Remember now? *Sigh* Someone has to clean up the mess you guys made.”\n\nWell technically it wasn’t my fault…\n\nBut if I say that now, I bet he’d snap. So yup, probably should hold it in…\n\nWith a snap of his fingers, the grass started to grow repopulating the barren land again. And after a while, flowers bloomed once more.\n\nWait…\n\nIt was that easy!?\n\nI stared at the headmaster with a blank look on my face.\n\n“What? You expect me to replant them one by one? I’m a very busy person you know.”\n\n*Stare*\n\n*Stare*\n\n*Stare*\n\n*Stare*\n\n“Alright, alright, I’ll take you to your room.”\n\nWait, that’s not what I wanted! But it’s a good idea too since I have no idea where I am.\n\nThe headmaster started to walk towards a building, so I just followed behind him daydreaming.\n\nWell, it’s night now, so I guess nightdreaming?\n\nBut seriously, that was a pretty exciting day, but it did help me realize,\n\nEither sitting in the cave for a month has made me rusty, or I’m too careless…\n\nEverything feels so real now, so it’s not the same as the game. Also, I can feel pain, not the little amount in the game, but real pain…\n\nI better practice and more and stop relying on the fact that Daeneries told me I can’t die… I still haven’t confirmed it yet, and I don’t think I want to.\n\n“”By the way headmaster.””\n\n“Yes?”\n\n“”Who were those two and why did they leave?””\n“Ah, that was the mid God of Plants, Erashera and a new low god called Erexia, the God of Shadows.”",
            "comments": [
                {
                    "comment_id": "687911",
                    "username": "Quapple",
                    "comment_text": "Thanks for the chapter~",
                    "time": "2016-06-13T02:47:05.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "687960",
                    "username": "Astra19",
                    "comment_text": "you know I don't really say this much BUT I WANT MORE CHAPTERS!\nThanks for the chapter though",
                    "time": "2016-06-13T03:31:23.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "687975",
                    "username": "overpalada",
                    "comment_text": "Thanks for the chapter",
                    "time": "2016-06-13T03:52:26.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "687991",
                    "username": "Shiki",
                    "comment_text": "Oh... Poor Ere-chan. He's gonna get a severe scolding... Deserves him right, though. Idiot Watcher(lol).",
                    "time": "2016-06-13T04:07:29.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "688020",
                    "username": "Ivanator The Great",
                    "comment_text": "Punish the smug lowly god of plants hahahaha!",
                    "time": "2016-06-13T04:37:34.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "688031",
                    "username": "AnarchyDev",
                    "comment_text": "But what halogens to her wound? Thanks for the chapter",
                    "time": "2016-06-13T04:54:36.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "688052",
                    "username": "R3B3lMilco",
                    "comment_text": "I am just curious...but what about the new race?? I mean..if they are gods or the people should have long ago realised that Yuuitsu and Sei are either an extremely strong member of them or their god.\nOr what?",
                    "time": "2016-06-13T05:30:36.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "688074",
                    "username": "Aileri",
                    "comment_text": "to answer some of your questions,\n#1 Yuiitsu and Sei do not look like their race remember, since they are more advanced version of the Byosu race, remember description of weaker Byosus from before and description of higher ranked Byosus when she left her cave?\n#2 her wound is still there, remember she's highly injured, able to move, but not much so can't fight.\n#3 Sei was standing infront of Yuiitsu to defend her remember, blocking off the headmaster from seeing her\nI think that's about it :X\nEDIT: I added a line to make it less confusing for you guys sorry >.<\nWhile I was looking in the direction where the two left from, a voice called out from in front of Sei, the same place where the plant woman came from.",
                    "time": "2016-06-13T06:15:32.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "688903",
                    "username": "[Deleted]",
                    "comment_text": "[Account Deleted]",
                    "time": "2016-06-13T20:57:42.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "715389",
                    "username": "wraith26",
                    "comment_text": "13/06/2016 05:30:36R3B3lMilco Wrote: [ -> ]\nI am just curious...but what about the new race?? I mean..if they are gods or the people should have long ago realised that Yuuitsu and Sei are either an extremely strong member of them or their god.\nOr what?\ndont expect anything.. they are all dumb ... really stupid..illogical bullshit",
                    "time": "2016-07-06T23:53:27.0000000+00:00",
                    "replies": []
                }
            ]
        },
        {
            "id": "77492",
            "name": "Chapter 14: Servant",
            "url": "https://www.royalroad.com/fiction/5580/yuiitsu-and-sei/chapter/77492/chapter-14-servant",
            "content": "My apologies for being late, by 1-2 days >.\n\nUnauthorized use: this story is on Amazon without permission from the author. Report any sightings.\n\nThey probably had room to spare in that fight seeing as how Sei isn’t reacting at all to that horrendous wound on Yuiitsu’s body.\n\nEven thinking about it is causing me a headache… *Sigh*\n\nAs we walk along, suddenly Yuiitsu took something out of thin air! This means they must know Space magic.\n\nMore and more questions are piling up, but at least I can be certain. If I am able to get the information they hold, our magic knowledge will increase by leaps and bounds!\n\nThey’re creatures from a different world, and with their strength, it’s impossible they know nothing.\n\nEven studying their bodies can probably lead to revolutions.\n\nBut the real questions is how do I get them to share the knowledge they know.\n\nOne way is to trade, but I won’t be certain they’d truthfully give us their information.\n\nSure they’re kind hearted before, but this knowledge can determine their life and death, so I doubt they’d truthfully give that kind of information out.\n\nAnother way is to get them to take a disciple I guess.\n\nIt’d be nice if I can get them attached to my son and have them take him in as a disciple, then teach him their knowledge. Even if it’s not my son, any other student is fine, at least their knowledge circulates in our world.\n\nBut for either one to happen, I still have to get on their good side…\n\nWhile acting like I don’t know about their injuries and what they were just doing, we walked along. But after Yuiitsu drank whatever was in that glass bottle, she covered her mouth and ran behind a tree?\n\nAh it seems she’s barfing!?\n\nAfter she barfed whatever it was all out…\n\n*Rumble*\n\nThe tree…\n\nHoly goddess!!!\n\n!?\n\nIt grew!\n\nIt frigging grew like crazy!\n\nBefore it was a tree around 4 meters tall.\n\nBut now, it grew around 10 times its previous size!\n\nSure there might be magic that does this, but even that’d be extremely advanced magic!\n\nBut instead of super advanced magic, she made it happen just by barfing!\n\nI don’t know what I currently look like, but I know my poker face is gone right now and I’m probably standing there with my mouth agape looking like an idiot.\n\nBut I can’t help myself, since from the tree, I can feel a huge amount of magic power radiating outwards.\n\nAnd that’s not the end of it.\n\nFrom the base of the tree, a dryad slowly emerged!\n\nA dryad for pete sakes! An B rank sentient monster!\n\nShe herself is has enough power to destroy a whole city or two!\n\nNormally this only happens when a tree has collected mana for over ten thousand years and even then the mana might be not pure enough for them to evolve, but this one isn’t even a hundred years old!\n\nWhat in the world did she barf!?\n\n---\n\nLooking at the tree from Sei’s angle a woman was literally pushing herself out of the tree.\n\nFirst two arms formed from the trunk and slowly they pushed on the tree. From in between the arms a young woman wearing leaves emerged.\n\nAs she got out, she slowly knelt before Yuiitsu?\n\n“To thank you for your gift, this one is willing to serve.”\n\n…\n\nWhat just happened?\n\nI was standing there, staring at the woman not knowing how to reply…\n\nI mean… she just emerged from a tree...\n\nThe tree I just barfed on...\n\nInstead of complaining, she's willing to serve me?\n\nWhat kind of situation is this!?\n\nI looked at the headmaster for help wanting to ask him how to deal with this, but instead of seeing the dignified headmaster from before, I see an old man with their mouth open agape and even a little bit of drool coming out from the side.\n\nI follow his line of sight…\n\n…\n\nYup he’s watching her chest…\n\n…\n\nGee, I wonder why…\n\nGlaring at the old man,\n\n“”Pervert.””\nYour that old already! Don’t you have any shame? And with your age, I doubt you’ve never seen a woman before, so you have to be exaggerate so much?",
            "comments": [
                {
                    "comment_id": "698142",
                    "username": "Balmik",
                    "comment_text": "I think your missed the perfect time for the servant to come out and say \"mama.\"\nIf I remember right the MC can't eat or drink now that she is a god so it would make sense the potion doesn't work.",
                    "time": "2016-06-22T01:55:01.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "698159",
                    "username": "yuki ookami",
                    "comment_text": "haha thank you for the chapter. was pretty funny. short but funny",
                    "time": "2016-06-22T02:30:06.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "698186",
                    "username": "kydomos",
                    "comment_text": "thanks for the chapter!!!",
                    "time": "2016-06-22T03:00:45.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "698195",
                    "username": "Zemophobia",
                    "comment_text": "I think the story is entertaining but, I kind of get tired of an MC's idiotic nature after a while. I mean, he was obviously a gamer and I would not be surprised if he read fictions, but too many things are taking him by surprise. I guess it might be a different story if this was happening in real life, but meh . . . I read this story for the cancer.",
                    "time": "2016-06-22T03:16:32.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "698223",
                    "username": "AnarchyDev",
                    "comment_text": "Yup... It's like the Mc lacks common sense of fantasy and only knows a little bit of their power.\nThanks for the chapter",
                    "time": "2016-06-22T03:55:31.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "698232",
                    "username": "overpalada",
                    "comment_text": "Thanks for the chapter",
                    "time": "2016-06-22T04:06:33.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "698240",
                    "username": "Ivanator The Great",
                    "comment_text": "He lack imagination and a playful side that a gamer should have, i mean if you've played games, even a casual would be all giddy experimenting with their newfound powers or explore a new world! Something weird should not even surprise him i think because he's literally the most mysterious being in that world with his ego on two bodies and being a god to boot~",
                    "time": "2016-06-22T04:22:24.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "698247",
                    "username": "MikeyTheMaster",
                    "comment_text": "Thanks for the chapter! Looking forward to more",
                    "time": "2016-06-22T04:31:58.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "698382",
                    "username": "cronie",
                    "comment_text": "22/06/2016 04:22:24Wrote: [ -> ]\nHe lack imagination and a playful side that a gamer should have, i mean if you've played games, even a casual would be all giddy experimenting with their newfound powers or explore a new world! Something weird should not even surprise him i think because he's literally the most mysterious being in that world with his ego on two bodies and being a god to boot~\nI think he foolishly expects everything to be the same as the game. He should have corrected this belief when he noticed that balancers do not exist.",
                    "time": "2016-06-22T09:08:37.0000000+00:00",
                    "replies": []
                }
            ]
        },
        {
            "id": "79139",
            "name": "Chapter 15: Food?",
            "url": "https://www.royalroad.com/fiction/5580/yuiitsu-and-sei/chapter/79139/chapter-15-food",
            "content": "This ones longer than usual\n\nMore boring too.As for being late >.\n\nLove this novel? Read it on Royal Road to ensure the author gets credit.\n\nBoth fallen and angels are at least B+ rank monsters, so these two must be strong to be alive after being persecuted.\n\nAs I watched them following behind the headmaster, trying to figure out why they’re here, the black one suddenly took a bottle out of thin air and moved away from the white one revealing the hideous wound across her body.\n\nAcross her body, there was a gash that went the whole way through!\n\nHow is she alive!?\n\nShe chugged the bottle of red liquid and immediately covered her mouth. With a clearly unhappy face, she ran in my direction.\n\n‘I’m sorry! I don’t know what I did wrong, but I’ll apologize. PLEASE DON’T KILL ME!’\n\nIgnoring my pleas, she continued to run at me.\n\nNot wanting to see my own end, I looked away, waiting for my dark end to come…\n\n…\n\nStill waiting…\n\nGeez woman, can you hurry it up!\n\nLooking back, I saw she just standing there. Standing over a pool of red liquid that was beside me emitting a healing aura. Just by being near it, I can feel it's power slowly healing my soul.\n\nIs that for me?\n\nFree stuff, so why not.\n\nI slowly absorbed the liquid, but the moment I touched it, I felt a giant wave of mana washing over me.\n\nIt was a massive amount of pure mana giving off a healing presence.\n\nThe more I took in, the better I felt.\n\nI couldn’t help myself, it felt so good absorbing it!\n\nI kept absorbing not even caring about my surroundings because absorbing this weird red liquid felt that good!\n\nAfter I finished absorbing it all, I felt weird.\n\nI felt as if I was in a cage, it was a soft cage that felt good to be in, but I suddenly had an urge to go out of it.\n\nReaching my arms out, I slowly pushed myself out of the cage.\n\nAhhhh the feeling of wind on my skin feels so good.\n\n…\n\nWait skin?\n\nI looked down only to notice that I actually had a body now!\n\nAfter I checked my status, I was amazed!\n\nBefore I was just a tree, a normal everyday tree that’s G rank. Even a normal human child is F rank since they can attack, but being a tree I couldn’t do anything.\n\nBut now, I’m B+ rank!\n\nNot only that, I’m even a variant!\n\nThen chances of being a variant is like one in thousands or more, it’s extremely rare!\n\nI’m amazing now!\n\nThis person has bestowed me with such a blessing I will serve her for life!\n\nI immediately knelt before her to show my loyalty, but only to be asked back after the white one kicked the headmaster. Poor guy, I could feel as if a bone broke, I don’t know how, but I just can.\n\n“”Can you cook?””\n\n…\n\n…\n\nMistresses, I think you’re forgetting I was a tree right? OF COURSE I CAN’T COOK!\n\nBut they had an expression that was like, ‘if you can’t, then we do not need you’.\n\nIn order to repay them, I lied through my teeth, saying I could, but the moment I did, they stopped talking and just stood there.\n\nAnd I waited…\n\nI could clearly feel cold sweat pouring down my back…\n\n\"\"Are you okay?\"\"\n\nHearing that, I instantly make an excuse.\n\nPlease don’t find out, please don’t find out, please…\n\nLike a mantra I chanted it in my mind, but reality is harsh.\n\nIn a low and menacing voice, they asked,\n\n“”What are you hiding?””\n\n“Eeep”\n\nThey know!\n\nWhat do I do!\n\nOk don’t panic everything is going to be okay, I’ll just tell them the truth and beg for forgiveness.\n\nBut before I could, they said,\n\n“”Well, it’s fine, we don’t need to know, you just have to be able to cook.””\n\nEeeeeeeeeeeeeeeeeep\n\nWhat do I do!\n\nMistresses I can’t cook!\n\n“”Come follow us.”\n\nTurning around, they went back to the headmaster, and I followed, as he slowly explained to them about the misunderstanding of him being a pervert.\n\nI could see them having an embarrassed face while looking down!\n\nIT WAS CUTE BEYOND COMPARE!\n\nAhhh I felt like I was in heaven again, as good as drinking that red stuff.\n\nToday I have learned, cuteness is justice.\n\nI wanted to just go up and hug them, but I controlled myself, since they are my mistresses.\n\nAs I was daydreaming, it seems we have arrived at our destination.\n\n---\n\nFu… it seems I misunderstood.\n\nConsidering his old age, I guess it makes more sense that he was surprised by what happened just like me and not staring at her chest for personal reasons.\n\nAfter his explanation, I was extremely embarrassed, so we passed the rest of the way in awkward silence.\n\nFollowing behind me is that dryad girl, I have to do something about her, since she’s wearing just leaves.\n\nThankfully currently it’s in the middle of the night, so we didn’t get caught up in any trouble along the way.\n\nAfter a while, we arrived at a castle…\n\n…\n\nThat’s right a castle…\n\nYou know, the academy itself was modest in appearance, but this, this takes the cake.\n\nIt was three times taller than the academy itself, and just as big too.\n\n“Come, I’ll show you to your room.”\n\nFollowing behind the headmaster, my face cramped more and more looking at the inside.\n\nCompared to the hallways in the academy, this is insane!\n\nThere was a red carpet, chandeliers of glass? Or is that diamond? With the walls painted gold filled with paintings and flower vases on both sides.\n\n…\n\nI was curious beyond compare,\n\n“”Why…””\n\nBefore I could finish the sentence, the headmaster answered in a matter of fact manner,\n\n“Nobles.”\n\n…\n\nCan confirm, fantasy setting is in full throttle right now…\n\nFollowing behind the headmaster, I know I’ll get lost again, I just know it… *Sigh*\n\nTurning around multiple corners, going up and down multiple stairs, we finally stopped in front of a door that was also painted gold…\n\n“Well, here we are, room 248. There’s a maid inside that will help you settle down and teach you what you need to know.”\n\nI took the key out of the inventory and hid both my wings and swords. I left the clothing because I still haven’t gotten my uniform yet.\n\nAnd as for the headmaster, he just teleported away leaving us there.\nWait! I still don’t know where the cafeteria is!",
            "comments": [
                {
                    "comment_id": "708346",
                    "username": "kydomos",
                    "comment_text": "thanks for the chapter!!!",
                    "time": "2016-07-01T06:20:58.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "708350",
                    "username": "AnarchyDev",
                    "comment_text": "Did her body heal? Why does this dryad girl know so many things about God?\nThanks for the chapter",
                    "time": "2016-07-01T06:24:34.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "708356",
                    "username": "overpalada",
                    "comment_text": "Thanks for the chapter",
                    "time": "2016-07-01T06:33:49.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "708359",
                    "username": "Shiki",
                    "comment_text": "Aaah... Poor duo... At least give them food.\nAnyway, what happened to the council ? Does the misunderstanding still ongoing there? As much I loved the comedy but I just can't stand those watchers(lol) attacking their superior... Heck, it's even worse because they act like 3rd rate cliche villains who's biting more they could chew. Oh well, I'll just wait for the time that the watcher(lol) who attacked them will suddenly appear to them and go dogeza like the world's ending.\nThanks for the chapter~",
                    "time": "2016-07-01T06:37:35.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "708365",
                    "username": "Aileri",
                    "comment_text": "well that's more like common knowledge and the tree sitting in the middle of an academy with nothing to do, probably learns some stuff from overhearing people talking about it.",
                    "time": "2016-07-01T07:01:10.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "708457",
                    "username": "yuukiw",
                    "comment_text": "01/07/2016 07:01:10Aileri Wrote: [ -> ]\nwell that's more like common knowledge and the tree sitting in the middle of an academy with nothing to do, probably learns some stuff from overhearing people talking about it.\nor maybe they absorb the knowledge from the earth itself?",
                    "time": "2016-07-01T09:53:36.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "708600",
                    "username": "beanender",
                    "comment_text": "Genetic memory?",
                    "time": "2016-07-01T13:59:47.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "708658",
                    "username": "Zhalfirin",
                    "comment_text": "01/07/2016 05:51:28Aileri Wrote: [ -> ]\nIs that for me?\nFree stuff, so why not.\nFree vomit! Get your free vomit here! We got red, we got blue, we even have cotton candy pink (though I think its watermelon flavored)! Get it while its hot, errr, luke warm!",
                    "time": "2016-07-01T14:39:09.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "817663",
                    "username": "Astra19",
                    "comment_text": "So is this dropped? or hatius?",
                    "time": "2016-10-09T11:44:13.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "833507",
                    "username": "Luna Star",
                    "comment_text": "10/9/2016 11:44:13 AMAstra19 Wrote:\n\nSo is this dropped? or hatius?\n\nSame... It's been a while since the last update.   Can I plz get more???  I really love this book,  it would be a shame if the author-san just left us here.   Wuu~",
                    "time": "2016-10-30T12:27:51.0000000+00:00",
                    "replies": []
                }
            ]
        }
    ]
}