{
    "id": "64990",
    "name": "I wanted to be a Vampire! Not a Mosquito! [Monster Evolution LitRPG]",
    "url": "https://www.royalroad.com/fiction/64990/i-wanted-to-be-a-vampire-not-a-mosquito-monster",
    "cover_image": "data\\images\\64990_cover.jpg",
    "author": "lemonleapoard",
    "category": "Original",
    "status": "DROPPED",
    "tags": [
        "LitRPG",
        "Non-Human Lead",
        "Adventure",
        "Fantasy",
        "High Fantasy"
    ],
    "description": "Steven lived a nice life. He had a job, a one room apartment, and even a cat. It was all going so well. So why did he die from a heart attack? But it's not all bad, he gets to reincarnate, and can even choose a special skill for himself! He'll be a vampire, and gain powers from drinking blood! Wait, why is everything so big? He's a mosquito?",
    "stats": {
        "score": {
            "overall_score": "",
            "style_score": "",
            "story_score": "",
            "grammar_score": "",
            "character_score": ""
        },
        "views": {
            "total_views": "79,410",
            "average_views": "1,654",
            "followers": "114",
            "favorites": "36",
            "ratings": "29",
            "page_views": "126"
        }
    },
    "reviews": [
        {
            "review_id": "1625143",
            "title": "Mostly the MC yelling at his system.",
            "username": "fredthebadger",
            "at_chapter": "29. Spiders Suck",
            "time": "4/8/2023, 1:14 PM",
            "content": "Mostly the MC yelling at his system.\nREVIEWED AT: 29. Spiders Suck\nBY fredthebadger\n4/8/2023, 1:14 PM\n\nThe main content of this story is the MC complaining about his system-granted abilities and quests, TO his system, and having his system and/or various gods operating through his system screw with him in response.\n\n \n\nThere's a lot of skill reading, but instead of sitting there thinking about how to min-max he complains and then has to deal with the consequences of his complaints being heard.  Once you're past the first few chapters the character is mostly established and you'll start getting an idea how all future conflicts will be handled, which means you'll know whether you want to keep reading.\n\n Report",
            "score": {
                "overall": "Overall",
                "style": "",
                "story": "",
                "grammar": "",
                "character": ""
            }
        }
    ],
    "chapters": [
        {
            "id": "1123742",
            "name": "1. I Wanted a Vampire",
            "url": "https://www.royalroad.com/fiction/64990/i-wanted-to-be-a-vampire-not-a-mosquito-monster/chapter/1123742/1-i-wanted-a-vampire",
            "content": "Day 0\n\nSteven was having a nice day. His boss let him go home early because a snowstorm was coming down from the north, and he didn't want anyone to be stuck there for the night. Now, if you hadn’t seen the weather report, you’d assume Steven’s boss was going crazy. It was a bright day. The sun was shining, birds were chirping, sure it was a little chilly, but that happens every now and then.\n\nSo, Steven was happy. Even if he knew his power was probably going to go out tonight, it didn’t really matter, he’d live. Therefore, Steven got in his car with a smile on his face, and started it. He got on the highway, heading back into town. The road was kind of empty, so it was going to be a relaxing ride. Steven turned on his —\n\nI felt a pain in my chest, not a really bad pain, but it still hurt. Next came the squeezing, it felt like my chest was being compressed. Then nothing, it was over in an instant. I slammed on my breaks. I tried to slam on my breaks? My breaks were gone. Wait, my car was gone, and the Earth was gone? I looked around to see nothing but a white, all encompassing void. It seemed to go on forever, with nothing else around for miles.\n\nDING!\n\nCongratulations! For being the 100,000th person to die this year, you will be reincarnated to another world!\n\nCalculating Points…\n\nWhat? I died? HOW?!? I was in my car with nobody else around!. I was going home to feed my cat! Let me go back! I want to at least make sure someone feeds Smoky!\n\nProcessing Request. Request Granted. Informing Someone to Feed Smoky.\n\nDue to Limited Processing Capabilities Rewards are based on Country instead of World\n\nName: Steven Smith (Epic)\n\nGender: Male(Uncommon)\n\nJob: Janitor (Rare)\n\nCause of Death: Heart Disease (Rare)\n\nAge of Death: 21 (Legendary)\n\nAdditional Traits:\n\nAdopted (Very rare)\n\nPoints:\n\nCommon (1 point) * 0 = 0\n\nUncommon (10 points) * 1 = 10\n\nStolen story; please report.\n\nRare (100 points) * 2 = 200\n\nVery Rare (1000 points) * 1 = 1000\n\nEpic (10000) * 1 = 10000\n\nLegendary (100000 points) * 1 = 100000\n\nTotal: 111210 points\n\nCalculating Rewards…\n\nWhat was that? First of all, adopted? No way. My parents would have told me. And second, how the hell is dying from heart disease rare? It’s literally one of the most common causes of death! Well, at least I can rest assured that Smoky was fed. Wait, can I? What if this thing just told someone in China to feed Smoky!. Smoky! Are you okay?\n\nRewards Calculated:\n\nDue to Limited Processing Ability Reward Choices are Limited\n\n1 Unique Skill\n\n2 Legendary Skills\n\n22 Epic Skills\n\n111 Very Rare Skills\n\n222 Rare Skills\n\n2242 Uncommon Skills\n\n111210 Common Skills\n\nWhoah, what’s this? I get skills? Does this mean it was telling the truth about being reincarnated? Wait, why do I get so many? Is this right? Does this mean I lived a good life? Fuck yeah, I am the best. Alright, how do I do this? Do I just tell it to give me my options? Alright! Let’s start with the unique Skill! System! Let me see my unique Skill options.\n\nReward Selected: 1 Unique Skill. Please Choose Skill.\n\nWait what? NO! I only get one?!?! Can I go back! I want all the Common skills then! Who needs a unique skill when I can get thousands of Common ones! I’ve seen webnovels before! I know the seemingly stupid option always leads to me being OP! C’mon!\n\nPlease Choose Skill\n\nWhat skill? Can I have a list of options? How am I supposed to choose without seeing my options? What is this? Hello?\n\nUnique Skills are made by the host's desire. As such the host must provide a wish that will be used to make a Unique skill.\n\nWhat the hell? Well, at least that gives me options. At least this way I can still be OP. Let me think. What do people wish for? Eternal youth? That could be cool. Maybe to fly, or take other people’s powers. Hmm… What do I want? You know, as a kid I really liked those old vampire movies. Vampires are strong, hot, and get all the girls. Yes, that's it! I wish to be a vampire.\n\nProcessing Request…\n\nSpecies Vampire Unknown, scanning hosts memories…\n\nWait what? It doesn’t know what a vampire is? Are there no vampires in this other world, uh oh. Wait, I take it back! I don’t want to be the only vampire! Give me another choice!\n\nDING!\n\nUnique Skill Bloodsucker created. Rewards finalized, deciding species based on skill compatibility…\n\nSpecies Mosquito(Tier 0) found.\n\nDoes that say mosquito? At least I won’t be alone.\n\nReincarnating… Enjoy your new life!",
            "comments": [
                {
                    "comment_id": "8091463",
                    "username": "LilFang",
                    "comment_text": "Ty for the chapter",
                    "time": "2023-03-02T21:35:16.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8253850",
                    "username": "Yuuhi",
                    "comment_text": "the novel already begins in tragedy",
                    "time": "2023-03-24T14:02:08.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8685049",
                    "username": "GodAxe",
                    "comment_text": "Question, why does dying at age 21 give a legendary of all things? It can't be because he's young, because people from back in medieval times died way younger and living to 21 was an accomplishment even, and even now thousands, hundreds of thousands of young people die every month at the very least.\n\nJust confused why the age itself is why he got the legendary feat?",
                    "time": "2023-05-17T00:04:12.0000000+00:00",
                    "replies": [
                        {
                            "comment_id": "8685313",
                            "username": "lemonleapoard",
                            "comment_text": "it's because of how far it is from the current life expectancy.",
                            "time": "2023-05-17T00:50:36.0000000+00:00",
                            "replies": [
                                {
                                    "comment_id": "8686112",
                                    "username": "GodAxe",
                                    "comment_text": "Wouldn't living longer be more a feat then? Why would dying way earlier than you should be a Legendary feat?",
                                    "time": "2023-05-17T03:22:39.0000000+00:00",
                                    "replies": []
                                },
                                {
                                    "comment_id": "8839028",
                                    "username": "NickXenix",
                                    "comment_text": "The moment Heart Attack counts as Rare, you should turn your brain off while reading this novel.",
                                    "time": "2023-06-03T15:36:59.0000000+00:00",
                                    "replies": []
                                },
                                {
                                    "comment_id": "9062331",
                                    "username": "SoVerySleepy",
                                    "comment_text": "the author literally said its because of how FAR from the life expectancy that it's legendary.",
                                    "time": "2023-06-30T08:09:41.0000000+00:00",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "comment_id": "8686112",
                            "username": "GodAxe",
                            "comment_text": "Wouldn't living longer be more a feat then? Why would dying way earlier than you should be a Legendary feat?",
                            "time": "2023-05-17T03:22:39.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "8839028",
                            "username": "NickXenix",
                            "comment_text": "The moment Heart Attack counts as Rare, you should turn your brain off while reading this novel.",
                            "time": "2023-06-03T15:36:59.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "9062331",
                            "username": "SoVerySleepy",
                            "comment_text": "the author literally said its because of how FAR from the life expectancy that it's legendary.",
                            "time": "2023-06-30T08:09:41.0000000+00:00",
                            "replies": []
                        }
                    ]
                },
                {
                    "comment_id": "8727531",
                    "username": "ChildConsumerServices",
                    "comment_text": "Thanks for the chappy!",
                    "time": "2023-05-22T04:52:42.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8812656",
                    "username": "Daniel the chalabaia",
                    "comment_text": "Right to the point how i like",
                    "time": "2023-05-31T19:59:34.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8889637",
                    "username": "Dude88",
                    "comment_text": "Tftc",
                    "time": "2023-06-09T13:55:20.0000000+00:00",
                    "replies": []
                }
            ]
        },
        {
            "id": "1124894",
            "name": "2. War",
            "url": "https://www.royalroad.com/fiction/64990/i-wanted-to-be-a-vampire-not-a-mosquito-monster/chapter/1124894/2-war",
            "content": "Day 1\n\nI woke up to a ringing in my ear? and a blue screen in front of my face. It was full of columns of strange, shifting shapes. They looked like an unstable alien alphabet, clearly containing meaning, but never the same meaning for long. I watched, mesmerized, as the letters morphed, and the columns turned to rows, until they eventually settled into something I could recognize. English, with my name near the top.\n\nDue to being 100% compatible with body, Bloodsucker has been upgraded.\n\nName:\n\nGender: Male\n\nLevel: 0/5\n\nExperience: 0/5\n\nAge: 0 days\n\nExpected Lifespan: 10 days\n\nRace: Mosquito(Tier 0)\n\nStats:\n\nHealth: 1/1\n\nMana: 0/0\n\nStrength: 0 .1\n\nAgility: 0.2\n\nDexterity: 0.1\n\nIntelligence: 100\n\nConstitution: 0.05\n\nCharisma: 1\n\nSkills:\n\nBloodsucker+1(Lv 1)\n\nTraits:\n\nBlood Born\n\nSuper Fertile\n\nWell, those are stats. And if I do say so myself I may be dead sooner rather than later. 10 days to live, if I even last that long. How do mosquitoes do it back on Earth? They just mate then die, right? Maybe I should look for a mate. Where even am I? At that thought, the screen slowly faded from view, and I saw the world around me for the first time.\n\nI was surrounded by an ocean of red. All around me there were ripples in the ocean, from each one I saw a mosquito rising from red, the sun glistening off the droplets stuck on their bodies. One by one, they took off into the sky, and flew off into the distance.\n\nUnauthorized use: this story is on Amazon without permission from the author. Report any sightings.\n\nThat looks so cool. Why did I ever want to be a vampire? Mosquitoes are so cool. I bet my skill is OP too, unique should be good, right? Alright let’s see it. System! What’s my skill do?\nPlease select skill to inspect\n\nI only have one… Are you trying to mock me? Whatever, what does Bloodsucker do?\n\nBloodsucker+1(Lv 1):\n\nGain experience from consuming the blood of creatures, and when enough blood of a single species has been consumed, gain a random skill from their species.\n\n+1 Can store 10x more blood. Blood is digested 30x faster.\n\nNow this, this is what I call OP! HA! HAHAHAHAHA! I am a god! I will be a mosquito overlord! Nobody shall stop my triumphant rise! Except maybe fly swatters, or hands, or anything that can hit me… Alright, maybe there are a few kinks to work out, like that 10-day lifespan, but it’ll be fine! I’ll just get an eternal youth skill… In ten days… Whatever. These will be the best 10 days of my life! Or would it be my death? Wait… Hmmm.\n\nAs I stood contemplating whether or not this was considered the afterlife, I saw something from the corner of my eye. I saw my brother? sister? I’ll figure it out eventually, disappear. They were there for one second, and a flash of blue later and they were gone. Before I could figure out what was happening. A new screen popped up in my face.\n\nNEW QUEST AVAILABLE!!\n\nSurvive the Swarm of Birds!\n\nSuccess:\n\nSurvive until the swarm of birds has passed or have died.\n\nFailure:\n\nDeath\n\nReward(s):\n\n1 Common Skill\n\nAccept Quest(Y/N)?\n\nWhat the fuck?!?! Birds! I was just born! How am I supposed to survive a swarm of birds! They are practically built to kill mosquitoes! Oh, and wait, I accept! It’s not like I have any choice in the matter… I had to do this quest anyways.\n\nAll around me birds were picking mosquitoes out of the air one by one. Those who died got lucky, for it was better than the one that lived. Some managed to partially dodge the birds’ attacks, but never completely. Those who dodged always lost at least half their body and fell back down into the ocean. They came crashing down, twitching, and falling on the ocean. It was a massacre. It was war.\n\nSo, I did what all good soldiers do, I booked it. I started flapping my wings, only to realize one crucial mistake; I didn’t know how to fly! I struggled, flapping one wing then the other, but it was to no avail. So, I tried the next best thing, and luckily for me it was something I had practice with. I ran. I mean, it was a little different from running as a human, having six legs and not being on solid ground didn’t help. But I did pretty good if I do say so myself. I stumbled at a pace akin to a crawling baby. Wait, a crawling baby it was the size of mosquito, whatever.\n\nSlowly but surely, I made it out of the death zone. With mosquitos dying all around me, I prayed to the mosquito god to help me survive this, I was just reborn, I didn’t need to die already. I just wanted to find a mate. Eventually, after what felt like hours, I heard the ding that warned me of my impending doom.\n\nQuest “Survive the Swarm of Birds!” Completed\n\nReward(s):\n\nCommon Skill Fly(Lv 1)\n\nThat would have been useful earlier.\n\nThanks to actions taken during quest, additional reward(s) obtained.\n\nCommon Skill Pray(Lv 1)\n\n…",
            "comments": [
                {
                    "comment_id": "8091464",
                    "username": "LilFang",
                    "comment_text": "Ty for the chapter",
                    "time": "2023-03-02T21:35:42.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8101427",
                    "username": "Daniel Z",
                    "comment_text": "Nosferatu has nothing on our hero!",
                    "time": "2023-03-04T04:46:55.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8253879",
                    "username": "Yuuhi",
                    "comment_text": "this absurd intelligence is clearly not reflected, no sense! omg",
                    "time": "2023-03-24T14:07:31.0000000+00:00",
                    "replies": [
                        {
                            "comment_id": "8685857",
                            "username": "Superc80",
                            "comment_text": "I understand you might be joking, but just in case, I think the intelligence is relative to his current form, and thus it is required for him to have higher thought.",
                            "time": "2023-05-17T02:39:55.0000000+00:00",
                            "replies": []
                        }
                    ]
                },
                {
                    "comment_id": "8889805",
                    "username": "Dude88",
                    "comment_text": "Tftc",
                    "time": "2023-06-09T14:16:35.0000000+00:00",
                    "replies": []
                }
            ]
        },
        {
            "id": "1125692",
            "name": "3. Flying?",
            "url": "https://www.royalroad.com/fiction/64990/i-wanted-to-be-a-vampire-not-a-mosquito-monster/chapter/1125692/3-flying",
            "content": "Day 1\n\n…Well, at least I can fly now, right? What do these skills do anyways? System! Show me my skill descriptions!\n\nPlease select skill to inspect\n\nOh, right, let’s start with the good one! Show me Fly!\n\nFly(Lv 1)\n\nGives users with wings knowledge on how to use them.\n\nAlright, pretty basic but lots of potential. Maybe I can learn to do tricks eventually. That’d be hilarious, a mosquito doing loop de loops. I bet someone would give me food for that. Or maybe squash me for being a devil bug… Oh well, a man —wait mosquito— can dream! So, what does pray do?... Hello? System? What does pray do?\n\nPray(Lv 1)\n\nSends the thoughts to a deity in hopes for interference or a boon.\n\nCurrent Target: Mosquito God(+)\n\nThat doesn’t seem ominous at all… Ooo, there’s a plus sign, what does that do?\n\nMosquito God(Unborn):\n\nPatron god of mosquitos.\n\nWell, that makes everything clear. Yes, the unborn patron god of mosquitos. I know exactly what they do. Thanks a lot, system. Whatever, I’ll figure it out eventually. More importantly, time to test out these wings of mine. I did what came(mostly) naturally to me and started almost beating my wings. Except, oddly enough, I didn’t just beat them. Right near the top and bottom of my strokes, I gave them a bit of a rotation, weird. Well, it just goes to show that I am clearly superior to birds(I don’t mean it please don’t hurt me birds).\n\nPray level up. Charisma multiplier is now 1.01x\n\nOOOO, awesome! System, show me my stats!\n\nName:\n\nGender: Male\n\nLevel: 0/5\n\nExperience: 0/5\n\nAge: 0 days\n\nStolen content warning: this tale belongs on Royal Road. Report any occurrences elsewhere.\n\nExpected Lifespan: 10 days\n\nRace: Mosquito(Tier 0)\n\nStats:\n\nHealth: 1/1\n\nMana: 0/0\n\nStrength: 0 .1\n\nAgility: 0.2\n\nDexterity: 0.1\n\nIntelligence: 100\n\nConstitution: 0.05\n\nCharisma: 1.01\n\nSkills:\n\nBloodsucker+1(Lv 1)\n\nFly(Lv 1)\n\nPray(Lv 2)\n\nTraits:\n\nBlood Born\n\nSuper Fertile\n\nHahaha. HAHAHAHAHA! I have become stronger! Thank you, Mosquito God! I shall continue to pray to you every day! (No level?) If this is how this works, I’ll be OP in no time. I’ll just level my skills to the max and then nobody can stop me! Even if I’m a mosquito! Alright! Let’s get back to flying!\n\nWhere was I? Oh right, rotating my wings.Yes, I rotated my wings at the top and bottom of my strokes, and… Liftoff? Hmm… Maybe I just need some energy, yes that’s it, I haven’t eaten since my death. Alright, let’s find some sucker to snack on. Where can I find blood?\n\nBlood Born activated\n\nWhat? In an instant my senses changed. The ocean around me went from a dark, brooding red to a blinding blue in an instant. It was like when you’re trying to sleep and someone turns on the lights. TURN IT OFF!!! OFF I SAY!!!\n\nBlood Born deactivated\n\nWhat was that? Blood Born? Oh right, my trait. I probably should have checked that earlier. System! What does Blood Born do?!?!\n\nBlood Born:\n\nRequirements - Born in a pool of blood.\n\nIncreases attunement to blood by 10%. Highlights nearby sources of blood.\n\nWhat a second… Does that mean what I think it means? This ocean… is blood? That’s… a lot of blood. How the hell do you even get this much blood in one place!?!?! There has to be gallons upon gallons of it here! And how doesn’t it all just evaporate and dry up?!?!?!?! Alright, calm down, Let’s think about this positively. At least I have an unlimited source of food. RIght. Yeah, yeah/ Just think of it as an all you can eat buffet… of blood… possibly human… NO! NO! NO! There’s no guarantee of that! Maybe this is just where a city leaves the blood after butchering animals, unsanitary sure, but it’s better than having it all in one place.\n\nAlright, where was I? Oh yes, a drink. Right. Let me just… How do I drink?\n\n20 minutes later\n\nAlright, I think I’ve got this. So, I take these spears attached to my face. I stick them in the pool. And then I suck. I said I suck. SUCK GODDAMMIT! And we’re sucking! Alright, all it needed was a little yelling. Now how does this taste… You know what? This isn’t that bad. It kind of tastes like iron. I could get used to this… And I think.. I’m.. done.\n\nBloodsucker+1 activated. Human(Lv MIXED) blood(old) consumed. + 8 exp. 0.002% progress to human skill.\n\nLevel up!\n\n+5 stat points\n\nI’m sorry, what? That was what type of blood? Fuck.\n\nGained Status Poisoned(Minor).\n\nDouble fuck.",
            "comments": [
                {
                    "comment_id": "8091468",
                    "username": "LilFang",
                    "comment_text": "Ty for the chapter",
                    "time": "2023-03-02T21:36:05.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8101446",
                    "username": "Daniel Z",
                    "comment_text": "Edit suggestions:\n\nI did what came (mostly) naturally to me and started almost beating my wings.\n\nWell, it just goes to show that I am clearly superior to birds (I don’t mean it please don’t hurt me birds).\n\nOh right, rotating my wings. Yes, I rotated my wings at the top and bottom of my strokes, and… Liftoff?\n\nAlright, I think I’ve got this/. So, I take these spears attached to my face.",
                    "time": "2023-03-04T04:51:01.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8363022",
                    "username": "Singularis",
                    "comment_text": "Mosquitoes being able to level is terrifying",
                    "time": "2023-04-07T13:30:37.0000000+00:00",
                    "replies": [
                        {
                            "comment_id": "8685874",
                            "username": "Superc80",
                            "comment_text": "I will rep to that my friend",
                            "time": "2023-05-17T02:43:17.0000000+00:00",
                            "replies": []
                        }
                    ]
                },
                {
                    "comment_id": "8839056",
                    "username": "NickXenix",
                    "comment_text": "This novel is the author's fever dream after getting bitten by too many mosquitoes.",
                    "time": "2023-06-03T15:41:58.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8889874",
                    "username": "Dude88",
                    "comment_text": "Tftc",
                    "time": "2023-06-09T14:24:21.0000000+00:00",
                    "replies": []
                }
            ]
        },
        {
            "id": "1126594",
            "name": "4. Dragonfly",
            "url": "https://www.royalroad.com/fiction/64990/i-wanted-to-be-a-vampire-not-a-mosquito-monster/chapter/1126594/4-dragonfly",
            "content": "Day 1\n\nPoisoned(MInor):\n\nLose 2% of max health per hour.\n\nThere goes my 10 days… That gives me what, 50 hours? Alright… Still better than nothing. Who am I kidding? This sucks. I died to what I can only assume was a freak of nature heart attack, then after being given a chance to start anew, got stuck in the body of a mosquito, which only had 10 days to live, may I add. Where is the justice here? Where is my OP skill?\n\nAlright, actually, I’ll give, I do have an OP skill, but… WHAT USE IS IT IF I CAN’T EVEN LIVE LONG ENOUGH TO USE It?!?!? You know what? I am going to fulfill my duty! I will find a mate! After figuring out how to fly… Alright, I’ve got this!\n\nSlowly, I started beating my wings again. Doing what came naturally (Is it natural if the system had to give me a skill for it?). And, after another five minutes, I flew! Okay, maybe flew is a little generous. I got a good 3 inches off the ground (which is way higher than I am tall) and started plummeting back to the ground? (blood?) Is it considered ground since I can walk on it? Not the point! The point is, I was flying! Now, to repeat, and find some of my brethren!\n\n4 minutes later and I made a very upsetting realization. I was lost. I may or may not have run (more like waddled) in a random direction away from those bloodthirsty birds. And I also may or may not have seen another mosquito for a few hours now. But, on the bright side, I am an expert in flying. I can make it up a total of 3 feet, reliably, and another foot unreliably.\n\nFly level up. Dexterity multiplier is now 1.01x.\n\nWOOOO!!!! What the hell is that!?!?!\n\nOff in the distance, a green blur was rushing towards me. It was moving way faster than me, and charging me like a train. And me, being the amazing, upstanding genius that I am, acted in a way befitting only the bravest of heroes. I turned around and flew at max speed. Which, while not very quick, was a decent bit quicker after my new level in Fly. Not that it helped. This thing was on me in an instant.\n\nIn an instant, there was a flash of green, and a soaring pain across my leg. Realizing I would never be able to escape, I used my amazing agility, and performed a maneuver about as gracefully as a dying cat. I turned around, stabbed my spears into its abdomen, and started sucking. Now, I would like to say that the stupid bug turned to a shriveled raisin in an instant under my superior powers of bloodsucking.\n\nThis narrative has been purloined without the author's approval. Report any appearances on Amazon.\n\nBut it did not. Sure, it slowed down a little, but, uhh… Let’s just say seeing how well that was working, I learned first hand what a slasher movie looks like. When sucking its blood didn’t work, the bug tried to get its mandibles around my body. It leaned its head up and started to close them like lightning.\n\nBarely dodging the blow that would have undoubtedly cut my short life even shorter,I flew a little higher and landed on its back. What occurred next was nightmare fuel. I took my spears and stabbed at it again, and again, and again. Green blood squirted out of it like a bucket with a hole in it, until it eventually stopped moving.\n\nDragonfly(Lv 3) killed. + 5 exp.\n\nSkill Aerial Combat obtained.\n\nAnd I finally had my first kill under my belt. And, even though I had never heard of a mosquito eating a dragonfly before, I couldn’t waste my chance at some free xp, so, I did what had to be done and sucked that dragonfly dry.\n\nBloodsucker+1 activated. Dragonfly(Lv 3) blood(fresh) consumed. + 2 exp. 10% progress to dragonfly skill.\n\nLevel up!\n\n+5 stat points\n\nOh yeah! Another level up! And some stat points which I completely forgot to use last time… oops. Well then, you live and you learn. System! I wanna use my stat points! And, lo and behold, I finally got a chance to get stronger.\n\nPlease select stats to put points into. (10 Available)\n\nStrength: 0 .1\n\nAgility: 0.2\n\nDexterity: 0.101\n\nIntelligence: 100\n\nConstitution: 0.05\n\nCharisma: 1.01\n\nHey uh, system, out of curiosity, could you tell me what each stat does? I don’t want to make a stupid mistake.\n\nStrength: Increases damage of physical skills and slightly increases max health.\n\nAgility: Increases maneuverability and effectiveness of movement skills.\n\nDexterity: Increases fine motor controls and the ability to hit a target with all skills.\n\nIntelligence: Increases max mana and ability to store and recall information\n\nConstitution: Increases defense against physical attacks and max health.\n\nCharisma: Increases likability to creatures perceived as friends. Increases intimidation against enemies. Improves effectiveness of all speech related skills.\n\nSo, that’s a lot… But what do I need the most? Looking back at myself, and my most recent debacles. Something becomes clear. I lost my leg in that fight. AND IT FUCKING HURTS! OW OW OW OW OW! Wait, no it doesn’t? It’s back? Huh? Cool. Let’s chalk that up to level up shenanigans and move on. Now then. In theory, with more max health I can survive the poison for longer, and maybe not lose a leg? (I think I lost it at least). So! System! Put them all into constitution!\n\nProcessing Request…\n\nConstitution: 10.05\n\nWait, that’s a big increase. Maybe I can become a god… Or at least as strong as a human.\n\nERROR! Attribute Point cannot increase a stat by more than 10% of its base value.\n\nCompensating…\n\nConstitution: 0.1\n\nOh…",
            "comments": [
                {
                    "comment_id": "8091498",
                    "username": "LilFang",
                    "comment_text": "Ty for the chapter",
                    "time": "2023-03-02T21:39:12.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8101506",
                    "username": "Daniel Z",
                    "comment_text": "Edit suggestions:\n\nDoing what came naturally (Iis it natural if the system had to give me a skill for it?).\n\nI got a good 3 inches off the ground (which is way higher than I am tall) and started plummeting back to the ground?\n\nI got a good 3 inches off the ground( which is way higher than I am tall) and started plummeting back to the ground?\n\nb Blood? Is it considered ground since I can walk on it?\n\nI may or may not have run (more like waddled) in a random direction away from those bloodthirsty birds.\n\nBarely dodging the blow that would have undoubtedly cut my short life even shorter, I flew a little higher and landed on its back.",
                    "time": "2023-03-04T05:02:33.0000000+00:00",
                    "replies": [
                        {
                            "comment_id": "8104250",
                            "username": "lemonleapoard",
                            "comment_text": "Thanks for the suggestions, I will look them over!",
                            "time": "2023-03-04T15:57:09.0000000+00:00",
                            "replies": []
                        }
                    ]
                },
                {
                    "comment_id": "8128857",
                    "username": "Whatisthemeaningoflife",
                    "comment_text": "Edit suggestions:\n\nAriealAeiral",
                    "time": "2023-03-08T04:11:54.0000000+00:00",
                    "replies": [
                        {
                            "comment_id": "8130537",
                            "username": "lemonleapoard",
                            "comment_text": "Thanks for the suggestion! I will look it over.",
                            "time": "2023-03-08T11:10:19.0000000+00:00",
                            "replies": []
                        }
                    ]
                },
                {
                    "comment_id": "8353580",
                    "username": "Lord Rune",
                    "comment_text": "Edit suggestions:\n\nSo! System! Put them all into constitution Okay so this is just suicidal. You have 0.1 on most of your stats a single point will increase said stats by ten! The only good option is spreading them out between all the physical stats with focus on agility. You are a mosquito you will never be as tough as a human but you will always be faster and more maneuverable\n\nERROR! Attribute Point cannot increase a stat by more than 10% of its base value. Compensating…\n\nConstitution: 0.1\n\nOh…\n\nOh indeed",
                    "time": "2023-04-06T06:43:52.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8392030",
                    "username": "Octaeon",
                    "comment_text": "Edit suggestions:\n\nStrength: Increases strength and damage of physical skills and slightly increases max health.",
                    "time": "2023-04-11T04:53:48.0000000+00:00",
                    "replies": [
                        {
                            "comment_id": "8394116",
                            "username": "lemonleapoard",
                            "comment_text": "Thanks for the suggestion! I'll look it over.",
                            "time": "2023-04-11T12:36:14.0000000+00:00",
                            "replies": []
                        }
                    ]
                },
                {
                    "comment_id": "8889973",
                    "username": "Dude88",
                    "comment_text": "Tftc",
                    "time": "2023-06-09T14:38:04.0000000+00:00",
                    "replies": []
                }
            ]
        },
        {
            "id": "1127401",
            "name": "5. Sleep",
            "url": "https://www.royalroad.com/fiction/64990/i-wanted-to-be-a-vampire-not-a-mosquito-monster/chapter/1127401/5-sleep",
            "content": "Day 1\n\nName:\n\nGender: Male\n\nLevel: 2/5\n\nExperience: 0/15\n\nAge: 0 days\n\nExpected Lifespan: 10 days\n\nRace: Mosquito(Tier 0)\n\nStats:\n\nHealth: 1.5 / 1.5 Poisoned(Minor)\n\nMana: 0/0\n\nStrength: 0 .1\n\nAgility: 0.2\n\nDexterity: 0.101\n\nIntelligence: 100.\n\nConstitution: 0.1\n\nCharisma: 1.01\n\nSkills:\n\nAerial Combat(Lv 1)\n\nBloodsucker+1(Lv 1)\n\nFly(Lv 2)\n\nPray(Lv 2)\n\nTraits:\n\nBlood Born\n\nSuper Fertile\n\nSo, let me get this straight. I get stuck into the body of a mosquito, have abysmal stats, then when I get a chance to improve them… I’M TOO WEAK FOR THEM TO GIVE ME FULL BENEFITS!?!?! That’s about as fair as everything else has been though… DEMAND A REFUND!!!\n\nRefund of Attribute Points available for 5 Attribute Points. ALRIGHT, DOESN’T MATTER! I was going to find a mate! But, before that. That fight kinda took a bit out of me.\n\nStolen content warning: this content belongs on Royal Road. Report any occurrences.\n\nHow long do mosquitoes need to sleep anyways? It feels like I’ve only been awake for a few hours and already, it’s getting a bit more difficult to move my legs. Though that might be because I lost one of them… (I swear I did, I’m not crazy). Anyways, it’s probably time to say goodbye to this world.\n\nI need to sleep. In this open field(pond?), with nobody to protect me from birds, or dragonflies, or… are there fish here? Doesn’t matter! So, as this will most likely be my last day on… Planet 2? Unless….\n\nOh dear mystical Mosquito God, please keep me alive for another night! I promise to serve and believe in you with all my heart if I don’t die! So, sleep… does it work the same as how humans do it? I’ll just close my eyes… close my eyes… CLOSE MY EYES!!!! It’s not working…\n\nAlright, what am I missing? Am I tired? I’d say yes. Next, can I close my eyes? Nope. Hmmm, I’m halfway there… Alright, so I can’t close my eyes. Let’s see… how else do people get to sleep? They pass out if they’re exhausted, right? So, I just need to tire myself out!\n\nSo, getting back in the air, I spend the next ten minutes doing my best to do a loop de loop. And if I do say so myself, I think I did pretty good. I made it a full half a loop! I went down, then came back up to the height I was at to begin with (That’s definitely not the easy part. Going upside down will be the easy part, just wait.).\n\nFly level up. Dexterity multiplier is now 1.02x.\n\nYeah! Wait, no, trying to sleep, don't get excited… don’t get excited. I can’t do it! WOOOO! Level 3 fly! Alright, so, sleeeeep.\n\nYeah, no, this is not gonna work. Other options? Well, if I can’t close my eyes, there are other ways to make it dark out…\n\nThis is gross. Really. Really. Gross. I went over to the dragonfly husk that was floating where I left it. Proof of my conquest against the inferior bug. And then I… I… I stabbed a hole into its exoskeleton, and crawled inside. Now, I think I should make it clear what I just did. I opened up a hole in, and then crawled inside a gooey, oddly warm, exoskeleton. It was disgusting. The insides got stuck to my wings, and my legs were cramped from the tight space. And, worse yet, I actually fell asleep in there. In the body of a dead dragonfly that I sucked the life from.\n\nBut, overall, it was a decent rest, other than the fact that my wings were sticky and I could barely move my legs. And better yet, I woke up to a new notification.\n\nTrait Blanket Of Enemies unlocked.\n\nSYSTEM! SHOW ME MY NEW TRAIT!\n\nBlanket Of Enemies:\n\nRequirements - Use the body of an enemy as a blanket.\n\nIncreases the effectiveness of intimidation effects by 50%\n\nThat’s… not creepy at all. I am totally normal, I did nothing weird to gain this… rare was it? trait.\n\nLife expectancy decreased to 9 days.\n\nAge increased to 1 day.\n\nYeah, wait, who cares?!?! I’ll be dead in 9 days anyways! Now! Back to my mission! To find a mate! But first... What way should I go?",
            "comments": [
                {
                    "comment_id": "8092673",
                    "username": "RailCannonLiebe",
                    "comment_text": "MEAT SUIT MEAT SUIT MEAT SUIT",
                    "time": "2023-03-03T01:13:06.0000000+00:00",
                    "replies": [
                        {
                            "comment_id": "8092753",
                            "username": "Senpai of Ducks",
                            "comment_text": "Oh no...",
                            "time": "2023-03-03T01:28:07.0000000+00:00",
                            "replies": []
                        }
                    ]
                },
                {
                    "comment_id": "8194044",
                    "username": "Omegawerewolf",
                    "comment_text": "OH. I think I know how he's gonna infiltrate human society...",
                    "time": "2023-03-16T20:43:12.0000000+00:00",
                    "replies": [
                        {
                            "comment_id": "8968226",
                            "username": "RegretFullChief",
                            "comment_text": "Please confide in me your toughts",
                            "time": "2023-06-18T19:54:54.0000000+00:00",
                            "replies": []
                        }
                    ]
                },
                {
                    "comment_id": "8890016",
                    "username": "Dude88",
                    "comment_text": "Tftc",
                    "time": "2023-06-09T14:43:22.0000000+00:00",
                    "replies": []
                }
            ]
        },
        {
            "id": "1128400",
            "name": "6. Flying Master",
            "url": "https://www.royalroad.com/fiction/64990/i-wanted-to-be-a-vampire-not-a-mosquito-monster/chapter/1128400/6-flying-master",
            "content": "Day 2\n\nSo, if the sun is behind me, then that means that it is… A direction that I definitely know. But, just to make it easier, I will call it sun up. So, using sun up as my guide, I will go sun down! And maybe find the end of this pool, and a mate! I will leave my mark on the world! In the form of baby mosquitoes! And possibly malaria, how would I know if I have malaria? Hmmmmmm…. Perhaps I do since I’m poisoned? Is that how it works? Is poison transferrable? Well, I’ll find out later! For now, I will go sun down!\n\nAnd, after fifteen minutes of mind numbing flying, I got a new notification, well, one I’ve seen before but.\n\nFly level up. Dexterity multiplier is now 1.03x.\n\nWoo! But honestly not that useful! Continue!\n\nBut, 20 minutes later, something much more interesting happened.\n\nFly level up. Dexterity multiplier is now 1.04x.\n\nPlease choose level 5 specialization for Fly.\n\nI get a specialization! Alright, granted, I have no idea what that means, but it sounds powerful! It better be powerful! I’ll bet it’s powerful. O’ almighty Mosquito God, please give me good options!\n\nPray level up. Charisma multiplier is now 1.02x\n\nAlright System! Show me my options!\n\nFly(Lv5):\n\nThrusters:\n\nRequirements - Fly(Lv5)\n\nIncreases the amount of thrust generated by wings.\n\nAcrobatics:\n\nRequirements - Fly(Lv5), Attempt to do mid-air tricks\n\nProvides knowledge of basic mid-air tricks when Fly levels up.\n\nSlicers:\n\nRequirements - Fly(Lv 5), Have wings with thin edges\n\nProvides knowledge on how to slice objects with the edge of wings when Fly levels up.\n\nThis story originates from Royal Road. Ensure the author gets the support they deserve by reading it there.\n\nCurrent Sensors:\nRequirements - Fly(Lv 5), Survive an ambush by a flying predator\n\nCan sense the currents caused by flying objects within fifteen feet of wings.\n\nFlying Combatant:\n\nRequirements - Fly(Lv 5), Aerial Combat Skill, Beat an opponent in aerial combat\n\nIncreases the ability to precisely maneuver in air. Aerial Combat provides more knowledge when leveled up(Does not Apply Retroactively).\n\nHoly Flight:\n\nRequirements - Fly(Lv5), Pray(Lv 3), Pray skill targeted at a god that can fly\n\nIncreases the amount of thrust generated by wings. Pray skill is 5%(Level of Fly) stronger. Wings are imbued with holy energy and become 3%(Level of Pray) sharper and harder.\n\nIf I don’t pick Holy Flight, is that blasphemy? I did just pray, and get the level up that would make me able to get it thanks to that… and it isn’t that bad. But… MY DREAMS OF LOOP DE LOOPS!!! It’s fine! I can just practice! Yes! I can do this! It’s fine! Besides! I just need to think of this realistically, this is a good thing. My wings are gonna become super weapons! All I need to do is pray, and I will turn them into blades of death! Yes! It’s all good! I have no regrets!\n\nSYSTEM! Give me Holy Flight!\n\nSpecialization Holy Flight chosen.\n\nMosquito God 0.0000000001% to birth.\n\nYou have obtained the attention of higher beings, beware, for they do not like the birth of new gods!\n\nI’m sorry, what? Did I just do something wrong!?!?! WHAT DO YOU MEAN PERCENTAGE TO BIRTH? SYSTEM! SHOW ME THE DESCRIPTION OF MOSQUITO GOD AGAIN, PLEASE!\n\nMosquito God(Growing, 0.0000000001%):\n\nPatron god of mosquitos.\n\nThat… seems different. DIdn’t that say Unborn before? Uh oh, did I just start a religion? No no no no. I did not. I did not such thing. All I did was pray to a god that apparently did not exist before. Yes, that’s it, I did nothing wrong.\n\nTrait Blasphemy(Major) unlocked.\n\nI did mostly nothing wrong? This can’t be that bad, right? It’s just a new god, why would they care so much? I’m sure the trait is nothing weird. System, show me blasphemy, please.\n\nBlasphemy(Major):\n\nRequirements - Commit a major act of defiance against the world’s most powerful group of higher beings.\n\nIncreases the effectiveness of holy skills targeted at gods against the world's most powerful group of higher beings by 50%.\n\nHahahahaha. HAHAHAHAHAHAHA! I’VE BEEN HERE FOR BARELY OVER A DAY! HOW DID I MANAGE TO STUMBLE ONTO A MAJOR ACT OF DEFIANCE!?!?! WHAT IS THIS!?!?! I WOULD LIKE A REFUND! LET ME BE DEAD! I DON’T NEED TO BE REVIVED!\n\nThis world sucks. I pray to a fake god and it causes nothing but problems, how is that fair!?!?! THEY DIDN’T EVEN EXIST!!! You know what? Those major gods can go disappear for all I care! I won’t have to deal with them for very long anyways!\n\nStatus Poisoned(Minor) removed.\n\nSee? Look? Everything’s going well. The sun is shining, I’m not poisoned, there are dark clouds looming over the horizon… Dark clouds getting closer… Dark clouds getting closer alarmingly fast.\n\nGained Status Disaster Magnet(Major).\n\nAww fuck.",
            "comments": [
                {
                    "comment_id": "8101924",
                    "username": "chaos_swan_king123",
                    "comment_text": "This shit's funny.",
                    "time": "2023-03-04T06:33:35.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8103976",
                    "username": "RailCannonLiebe",
                    "comment_text": "He shall rise\n\nAND NONE WILL HAVE ENOUGH BLOOD TO SATE HIS HUNGER\n\nALL HAIL THE MOSQUITO GOD",
                    "time": "2023-03-04T14:55:15.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8109413",
                    "username": "LilFang",
                    "comment_text": "Ty for the chapter",
                    "time": "2023-03-05T10:32:16.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8890070",
                    "username": "Dude88",
                    "comment_text": "Tftc",
                    "time": "2023-06-09T14:49:34.0000000+00:00",
                    "replies": []
                }
            ]
        },
        {
            "id": "1130870",
            "name": "7. Storm",
            "url": "https://www.royalroad.com/fiction/64990/i-wanted-to-be-a-vampire-not-a-mosquito-monster/chapter/1130870/7-storm",
            "content": "Day 2\n\nIn an instant, the clouds were upon me. They pelted me with rain the size of cars(Okay maybe not, but compared to me they were the size of cars.). Actually, maybe I am human sized and everything else is too. This is a fantasy world… RAIN! Right, right, the deadly rain. It was pouring from the sky faster than an oil truck with a 3 foot hole in it.\n\nThe water all around me shook like an earthquake, drenching me even further. I took to the sky in an attempt to flee, my new levels in fly already pulling their weight. But the moment I got a few feet up, I realized my mistake. I went from being pelted on most of my sides to being attacked on all of them. I bobbed and weaved through the trucks of rain, barely skating through some of them.\n\nBut it was all for naught; I was struck by a droplet that the wind rushed up from below. It hit me like a hungry bear with nothing else to lose. I was smashed upwards into the sky, losing all control of my path. I plummeted back towards the water with nothing to brace my fall.\n\nWith nothing else to lose, I decided to try a desperate gamble, do the very same thing that got me into the mess, pray to the Mosquito God for help.\n\nOH MIGHTY MOSQUITO GOD! PLEASE BLESS ME WITH YOUR BEAUTIFUL WINGS AND SHARP MOUTH SPEARS! I NEED TO MAKE IT OUT OF THIS ALIVE!\n\nAll around me, the world flashed in a brilliant red light, and a new notification appeared in front of me, this one just as concerning as the ones that appeared in the last few minutes, but on a much more fundamental level.\n\nCongratulations! Job System unlocked!\n\nAvailable Job(s):\n\nHead Cultist of the Mosquito God\n\nBlasphemer(Major)\n\nDissector\n\nSpearman\n\nPeasant\n\nI don’t have a choice here, do I? I’m already committed… and it’s unique… aww hell. SYSTEM! MAKE ME A CULTIST!\n\nJob Head Cultist of the Mosquito God chosen, as a Unique Job it is unable to be removed. Head Cultist of the Mosquito God locked into first job slot. Beware, the ire of higher beings is not to be taken likely.\n\nMosquito God 0.0000000005% to birth.\n\nTrait Monster?(Legendary) unlocked.\n\nThis tale has been unlawfully lifted from Royal Road. If you spot it on Amazon, please report it.\n\nSkill Messenger of the Mosquito God unlocked.\n\nSkill Protection of Blood obtained.\n\nSkill Bloody Ritual unlocked.\n\nSkill Member Initiation unlocked.\n\nSkill Lead Prayer unlocked.\n\nAll around me screens flashed before my eyes then disappeared within an instant. Vaguely still aware of what was happening, I felt the impulse to activate one of my new skills. All around me the blood from the pool rose up, and started to take shape around me. It formed into a cocoon that protected me from the wind and rain, and finally, all seemed calm again. I layed there, at the bottom of the dome, trying to understand what had just happened.\n\nI sat there for what felt like hours, until I eventually just fell asleep, my brain too tired to even begin comprehending what had led to these events.\n\nI woke up with a start as my protective dome fell around me. The blood around me was calm again, and I had time to think. The storm had passed, the only proof of its existence being that the blood had somehow become an even darker shade of red, as if the rain only purified it. I imagine if this had been a forest, the trees all around me would have been toppled and flown off into oblivion. So, to figure out what had happened, I called upon my trust status screen.\n\nSYSTEM! SHOW ME MY STATUS!\n\nName:\n\nGender: Male\n\nLevel: 2/5\n\nExperience: 0/15\n\nAge: 2 days\n\nExpected Lifespan: 8 days\n\nRace: Mosquito(Tier 0)\n\nStats:\n\nHealth: 0.25 / 1.5\n\nMana: 0/47\n\nStrength: 0.1\n\nAgility: 0.2\n\nDexterity: 0.104\n\nIntelligence: 100\n\nConstitution: 0.1\n\nCharisma: 1.02\n\nSkills:\n\nAerial Combat(Lv 1)\n\nBloodsucker+1(Lv 1)\n\nFly(Lv 5)\n\nPray(Lv 3)\n\nJobs:\n\n1. Head Cultist of The Mosquito God(Lv 1)\n\n2. EMPTY\n\n3. LOCKED\n\n4. LOCKED\n\nJob Skills (Head Cultist of The Mosquito God):\n\nBloody Ritual(Lv 1)\n\nLead Prayer(Lv 1)\n\nMember Initiation\n\nMessenger of the Mosquito God(Lv 1)\n\nProtection of Blood(Lv 1)\n\nTraits:\n\nBlanket Of Enemies\n\nBlasphemy(Major)\n\nBlood Born\n\nMonster?(Legendary)\n\nSuper Fertile\n\nSo… I’m a cultist now. Of a God that doesn’t even exist yet, but appears to be able to mess with me anyways. That’s… Not creepy whatsoever. Yup. I have no problems with this new development.\n\nStatus Disaster Magnet(Major) removed.\n\nGained Status Disaster Magnet(Max).\n\nYup, that sounds about right.",
            "comments": [
                {
                    "comment_id": "8121321",
                    "username": "chaos_swan_king123",
                    "comment_text": "Thank you for the chapter. Will he ever evolve into a vampire? If so, it would be very funny if a vampire prayed to a mosquitoe God. Or will the God them self be a God of all things that suck blood?",
                    "time": "2023-03-07T02:58:55.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8124305",
                    "username": "Real_Erebos",
                    "comment_text": "TFTC. I feel myself entertained",
                    "time": "2023-03-07T15:00:43.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8194065",
                    "username": "Omegawerewolf",
                    "comment_text": "Bro this is hella funny lol.",
                    "time": "2023-03-16T20:45:56.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8890117",
                    "username": "Dude88",
                    "comment_text": "Tftc",
                    "time": "2023-06-09T14:55:21.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "9398903",
                    "username": "znaeb",
                    "comment_text": "It says intelligence is 100. Is that a typo?",
                    "time": "2023-08-07T23:41:43.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "10114444",
                    "username": "Death's gaze",
                    "comment_text": "Would have chosen dissector or am I the only one that consider his choices not well thought out like vampire why will you want those weaknesses (ps: this is not for the author you doing a great job )",
                    "time": "2023-11-01T18:57:28.0000000+00:00",
                    "replies": []
                }
            ]
        },
        {
            "id": "1131912",
            "name": "8. I hate the Gods",
            "url": "https://www.royalroad.com/fiction/64990/i-wanted-to-be-a-vampire-not-a-mosquito-monster/chapter/1131912/8-i-hate-the-gods",
            "content": "Day 3\n\nDisaster Magnet(Max):\n\nBecome a harbinger of disasters. Wherever you go disasters of all nature will follow, be it storms or wars. Skills related to disasters (Storms, plagues, etc…) will be 10% more effective. Due to the immense pressure on the body and soul brought by this status, no other statuses can be obtained while it is active.\n\nDuration: This ought to make things interesting, Mr. Reincarnator, don't forget to choose a name! - Elly, Goddess of Chaos ;)\n\nDid… did I just get an emoticon wink from a goddess? What the hell?!?! Aren't gods supposed to be all knowing and vengeful or something? I know for certain they don't send emoticons. What is this Elly, a teenager?\n\nNEW QUEST AVAILABLE!!\n\nDon't Insult Elly, Goddess of Chaos, Pretty Much the Only God that can Mess with the Status of Reincarnators\n\nSuccess:\n\nDo not insult Elly\n\nFailure:\n\nInsult Elly\n\nReward(s):\n\n5 Xp per day successfully\n\nPenalty for Failure:\n\nLife Expectancy -5 days\n\nAccept Quest(Y)?\n\nNo? Where's my no options!?!?! What is this? Maybe if I ignore it, it will go away?\n\nQuest \"Don't Insult Elly, Goddess of Chaos, Pretty Much the Only God that can Mess with the Status of Reincarnators\" accepted automatically.\n\nSeriously? Is there no concept of free will here?!?! Non interference?!?! Don't I get to choose!?!?\n\nSkill Messenger of the Mosquito God Provides a new quest!!!\n\nExpand the Cult\n\nSuccess:\n\nExpand the Cult of The Mosquito God by 5 members before death.\n\nFailure:\n\nDie before expanding the Cult of The Mosquito God by 5 members.\n\nReward(s):\n\n1 level in Head Cultist of the Mosquito God job.\n\nPenalty for failure:\n\nSoul will be given to the higher being with the most grudges against you.\n\nCurrent Target: Illinois, God of Insects(+)\n\nAccept Quest(Y/N)\n\nSee? This is how you ask a quest. With a choice, that I am most definitely going to say no to.\n\nMessenger of the Mosquito God activated. Quest accepted.\n\nI was complimenting you Mosquito God, and you do this!?!?! WHERE IS THE JUSTICE IN THIS WORLD!?!?! I DEMAND TO BE COMPENSATED! Besides the fact that I don't even remember doing anything to Illinois! I didn't even know they existed until now! Unless they don't exist… SYSTEM! I WANNA SEE THAT PLUS ON ILLINOIS!\n\nIf you encounter this tale on Amazon, note that it's taken without the author's consent. Report it.\n\nIllinois, God of Insects\n\nPatron God of all insects (Ants, wasps, mosquitoes, etc…) and bringer of insect based disasters.\n\nAlright, maybe I do know what I did, but it wasn't on purpose! It's not my fault it's so easy to start making a god!\n\nAlright, this is going to be fine, I bet those new skills will keep me alive, please Mosquito God, I hope you gave me something good.\n\nPray level up. Charisma multiplier is now 1.03x\n\nAlright! I'm being listened to!\n\nMosquito God 0.0000000006% to birth.\n\n…SYSTEM! PLEASE SHOW ME MY JOB SKILL DESCRIPTIONS! Oh, and that new trait with a question mark in it.\n\nJob Skills (Head Cultist of The Mosquito God):\n\nBloody Ritual(Lv 1):\n\nSacrifice blood to the Mosquito God in order to empower it. If pleased, the Mosquito God may give a boon.\n\nLead Prayer(Lv 1):\n\nLead a congregation in prayer to a higher being. Those praying provide 3%(Level of Pray • Level of Lead Prayer) more faith to the higher being. Those who witness a prayer led with this skill become 1.01% (Sqrt(Charisma)) easier to convince to embrace the higher being.\n\nCurrent Target: Mosquito God(+)\n\nMember Initiation:\n\nInitiate a member into a religious order. Prayers to the primary higher being of the religious cult are 0.01%(Members/100) more effective.\n\nCurrent Target: Cult of the Mosquito God\n\nMessenger of the Mosquito God(Lv 1):\n\nCan be used as a conduit for the Mosquito God in order to receive their wisdom. Can obtain passive help by the Mosquito God in dangerous situations.\n\nProtection of Blood(Lv 1):\n\nUse ambient blood as a shield to prevent damage. If no ambient blood is available, mana may be used to create some.\n\nCost of making blood: 100(100 / Level of Protection of Blood) mana per gallon.\n\nCost of Shield: 10 mana per gallon per minute.\n\nMonster?(Legendary):\n\nRequirements: Unlock the job system as a monster before tier 5.\n\nRewards increased based on the tier job system was unlocked at.\n\nTier 4 Increase intelligence multiplier by 1.1x.\n\nTier 3 Increase the leveling speed of job skills by 10%.\n\nTier 2 Open 1 additional job slot.\n\nTier 1 Job skills provide a 1.05 multiplier per level instead of 1.01.\n\nTier 0 Jobs require 50% Xp to level up.\n\nThat's… a lot of information. Alright, let's break this down. Bloody Ritual… will either get me killed from angering those stupid gods (Not you, Elly, please don't lower my life expectancy.) even more… or it could make me live longer by strengthening the Mosquito God… Whatever, I'll see how useful it is after I use it. Lead Prayer seems pretty useless as I would need someone to, you know, lead in prayer. I guess Member Initiation is supposed to help on that front. Messenger of the Mosquito God though… I'm pretty sure it activated Protection of Blood before I passed out in that storm… but it also forced me into this quest. It is a unique skill, which I thought were supposed to be made by my wishes but whatever?\n\nUnique Skills can be made from the wishes of any being, not just the one they were granted to.\n\nThat explains nothing… Whatever, at least protection of blood looks useful, I had a mana stat now, right? Though that cost seems unmanageable, except I'm a mosquito… LUCKY! I got a skill that seems useless for anything not as small as me. Hahaha! Unless that's not a lot of mana. System, how much mana do I have?\n\nMana: 1/57\n\nYup. I am the best. Ha! Not to mention my new OP trait that just makes my jobs pretty much legendary, wait, my job is unique, nice. Now, why did Elly say (write?) something about choosing a name? I already have one! It's… Huh. I don't remember. System, what's my name?\n\nNo name available, would you like to choose one?\n\nOoo, I get to choose a name, I'll make it something awesome. Yes, I would. What are my options? Mosquito Overlord, Mosquito of Death, or maybe just Tim.\n\nName \"Mosquito Overlord, Mosquito of Death, or maybe just Tim\" chosen.\n\nWAIT! NO! THAT'S NOT WHAT I MEANT! BRING ME BACK!\n\nTrait Self-Named unlocked.\n\nTrait Mocked by The Gods unlocked.\n\nI hate you gods… except you Elly…",
            "comments": [
                {
                    "comment_id": "8132977",
                    "username": "chaos_swan_king123",
                    "comment_text": "Thanks for the chapter.",
                    "time": "2023-03-08T18:51:04.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8411536",
                    "username": "SteakLord",
                    "comment_text": "thanks for the chapter",
                    "time": "2023-04-13T16:05:48.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8777233",
                    "username": "Ari Maor",
                    "comment_text": "Thanks for the chapter! This is hilarious 😂",
                    "time": "2023-05-27T18:24:56.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8890203",
                    "username": "Dude88",
                    "comment_text": "Tftc",
                    "time": "2023-06-09T15:03:59.0000000+00:00",
                    "replies": []
                }
            ]
        },
        {
            "id": "1132661",
            "name": "9. Expansion",
            "url": "https://www.royalroad.com/fiction/64990/i-wanted-to-be-a-vampire-not-a-mosquito-monster/chapter/1132661/9-expansion",
            "content": "Day 3\n\nWell, I guess this isn’t all bad… I am at least immune to status effects, including the positive ones… WAIT! DOES THIS MEAN!?!?!\n\nSlowly, I dipped my spears down into the blood, and took a sip. Seeing nothing bad happening, I continued.\n\nBloodsucker+1 activated. Human(Lv MIXED) blood(old) consumed. + 8 exp. 0.004% progress to human skill.\n\nStatus Poisoned(Minor) resisted.\n\nHahaha, HAHAHAHA! I CAN DRINK TO MY HEART'S CONTENT! HAHAHAHAHA! I HAVE CONQUERED THIS LAKE’S POISON! I SHALL BECOME OP AND DRINK IT ALL!\n\nBloodsucker+1 activated. Human(Lv MIXED) blood(old) consumed. + 8 exp. 0.006% progress to human skill.\n\nStatus Poisoned(Minor) resisted.\n\nLevel up!\n\n+5 stat points\n\nYES! SYSTEM! I WANT TO USE MY STAT POINTS!\n\nPlease select stats to put points into. (5 Available)\n\nStrength: 0.1\n\nAgility: 0.2\n\nDexterity: 0.1\n\nIntelligence: 100\n\nConstitution: 0.1\n\nCharisma: 1\n\nAlright, what are my options? I could up my health some more, which would help me survive these upcoming disasters that were being promised (Thanks Elly). But if I up my agility I could run away… could I? How much agility would I need to run away from a tornado? Actually, it doesn’t matter. I couldn’t survive a tornado either way. So… what else matters to me? More than anything else… Isn’t it obvious? I STILL HAVEN’T FOUND A MATE! THAT IS ALL I HAVE WANTED FOR THE PAST 3 DAYS!\n\nOkay, maybe not the only thing… I may have also wanted to figure out a better way to live past 10 days… but bah! It’ll be fine! I just need more agility so I can fly faster. Then I can find out where they all went! They couldn’t have all died to those birds… or that god sent storm… ALRIGHT! All my points go into agility!\n\nYou might be reading a stolen copy. Visit Royal Road for the authentic version.\n\nProcessing Request…\n\nAgility: 5.2\n\nERROR! Attribute Point cannot increase a stat by more than 10% of its base value.\n\nCompensating…\n\nAgility: 0.3\n\nWait a second… I used all of my points on agility… and it increased by 50%, that makes sense. But… won’t that mean I’ll get more for the next 5 points? Or if I had used them one at a time… FUCK THAT! SERIOUSLY!?!?! WHY DO I NEED TO THINK ABOUT MATH NOW! THIS WAS SUPPOSED TO BE A RELAXING REINCARNATION!\n\nAlright, calm down… I can do it right next time, I can’t be that far from a level, right? System, what’s my level?\n\nLevel: 3/5\n\n…System how much Xp do I have?\n\nExperience: 1/20\n\nAlright, just 3 more drinks. Let’s do this… It isn’t working… I’m full, aren’t I? COME ON! THAT’S NOT FAIR! WHY DO MY LEVELS NEED TO BE STOPPED BECAUSE I HAVE A LIMITED STOMACH!?!?!?! It’s fine, I’ll just do this later… later, yes! Hahaha. I am fine! Instead, I shall go find a mate!\n\nAnd so! I continued my journey towards… sun up? Or was it sun down… Let’s go sun up! Sun up is most definitely the way to go!\n\nAnd so! I set off on my journey again! AND! 10 minutes later! I FINALLY FOUND SOMETHING! A MOSQUITO! A lone mosquito, sure, but that’s fine! This will do just fine! Except… what’s that? IS that… a male!?!?! I DON’T EVEN KNOW HOW I CAN TELL?!?! It’s fine… It’s fine… This means I must be getting close… Onwards! Towards a mate!\n\nI started flying past my newfound mosquito, only to be stopped. I felt a little tugging. Not a physical tugging, more like one on my mind. And it really wanted me to stay near that mosquito. Ignoring it, I continued forward! Toward the mosquito!?!?! Didn’t I just fly past it? It’s fine! GO! …Why is it in front of me again?!?!?!\n\nQuest: Expand the Cult\n\nAre you kidding me? Seriously? HOW!?!?! Wait, I remember! Member Initiation! Alright, how do I do this? Come on Member Initiation… Let’s make this quick. So, I need to… what? I need to DO WHAT!?!? HOW AM I SUPPOSED TO SUBMERGE HIM IN BLOOD!?!?! I DON’T HAVE HANDS! Wait! I know! I’ve got Protection of Blood! Alright! Protection of Blood!\n\nI activated the skill and felt something slowly trickle out of me. It kind of tickled. It was like a finger was being caressed up my back., but a really small finger, and not my back, but my insides.\n\nSo, flowing out of me, I watched a red mist start to form around me, slowly condensing into a solid sphere. And, I was surrounded in a sphere of blood. Which did not help in the slightest. I NEEDED THE OTHER MOSQUITO TO BE SURROUNDED!\n\nAlright, let’s try this again. I deactivated the skill, watching the blood fall back down into the pool below me. This time, I flew right up next to the mosquito, who did not seem to appreciate it. But whatever, it’ll be quick! I reactivated Protection of Blood, feeling that nice trickle again, and it surrounded both of us. SO, I let it go again, before my new friend got mad, and I think it worked?\n\nI can feel some kind of connection to him, but it’s weird, maybe because he’s a mosquito?\n\nForcefully Converted Unnamed Level 0 Mosquito to Cult\n\nQuest: Expand the Cult(1/5)\n\nHaha! Now I can leave!",
            "comments": [
                {
                    "comment_id": "8135020",
                    "username": "RailCannonLiebe",
                    "comment_text": "WOOOOOOO FORCEFUL CONVERSION\n\nTHIS CANT POSSIBLY GO WRONG",
                    "time": "2023-03-09T00:14:25.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8135596",
                    "username": "Kokomittens",
                    "comment_text": "All hail out hero, Mosquito Overlord, Mosquito Of Death, or maybe just Tim. May the cult grow ever stronger.",
                    "time": "2023-03-09T02:02:36.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8411576",
                    "username": "SteakLord",
                    "comment_text": "thanks for the chapter",
                    "time": "2023-04-13T16:09:30.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8890546",
                    "username": "Dude88",
                    "comment_text": "Tftc",
                    "time": "2023-06-09T15:44:33.0000000+00:00",
                    "replies": []
                }
            ]
        },
        {
            "id": "1133594",
            "name": "10. Disasters",
            "url": "https://www.royalroad.com/fiction/64990/i-wanted-to-be-a-vampire-not-a-mosquito-monster/chapter/1133594/10-disasters",
            "content": "Day 3\n\nSo, I tried to leave my new mosquito friend behind, but it wouldn’t leave me alone! It was following me! I guess that’s what it means to lead a cult. Such responsibilities. Wait a second… perhaps… Mosquito friend? Can you lead me to a mate?\n\nMy little friend seemed to understand me, and it started moving! Off to the mates we flew! And flew! And flew… AND, a solid hour later! I got a nice little welcome surprise.\n\nFly level up. Dexterity multiplier is now 1.05x.\n\nHahaha! It’s been a while since that happened! But where are those mates I’ve been promised? At that, my mosquito friend finally stopped. Below us was what appeared to be a red, bamboo raft on its side. There were cylinders sticking up from the water, all attached to each other who knows how? And it was huge. It spread all around me, probably able to fit 100 of me easily. And I knew what they were. Eggs! WHICH MEANS MATES! Probably… bah, hopefully.\n\nSo, I found my camp for the day. It was starting to get late. I mean, not really, but I was tired. I really had no stamina. So, first, a prayer.\n\nThank you almighty Mosquito God for keeping me alive and safe. I hope you are born safely and with enough power to keep me alive for longer than 10 days. And with that, I went back to bed for the\n\nSecond (third? Does passing out count?) time since my new life began.\n\nDay 4\n\nLife expectancy decreased to 7 days.\n\nAge increased to 3 days.\n\nQuest Don't Insult Elly, Goddess of Chaos, Pretty Much the Only God that can Mess with the Status of Reincarnators: + 5 xp\n\nI woke up to the water churning around me. Another storm!?!?! I looked skyward, and whew, safe for now. Looking around, I saw that those eggs were thrashing about, violently. Very violently. And then they started bulging, Which I do not think is natural. Right? I’m no mosquito biologist, but that seems weird. And then, it stopped. And they exploded. EXPLODED! WHAT THE HELL!?!?! THAT IS DEFINITELY NOT RIGHT!\n\nBright red mosquitoes flew out from them, and started rushing towards me.\n\nNEW QUEST AVAILABLE!!\n\nLead the Disaster Mosquitoes!\n\nSuccess:\n\nKill at least 100 creatures with the Disaster Mosquitoes\n\nFailure:\n\nKill less than 100 creatures with the Disaster Mosquitoes\n\nReward(s):\n\n10% resistance to damage from disasters.\n\nPenalty for Failure:\n\n-10 Xp\n\nAccept Quest(Y/N)?\n\nThe mosquitoes flew right past me, on their way to who knows where. Looking at that sweet reward… and that tiny little one drink penalty… YES! I WANT IT!\n\nThis story has been taken without authorization. Report any sightings.\n\nI chased after my mosquito brethren. And we set off on a journey of carnage. Well… a journey, just maybe without any carnage. We flew for a solid 2 hours. I got another level in fly; I assume they all got a specialty, I did by then, and then they just stopped.\n\nWhat happened next was a horror show, and I only have one thing to say about it. I no longer want to find a mate. With that completed, we continued on our journey. And, an hour of mind numbing flying later, something appeared off in the distance, something I had never seen before in my life (my mosquito life). DIRT! I mean, it was a pretty dark red, but DIRT! I was finally free from the lake of blood! Oh merciful Mosquito God, thank you.\n\nPray level up. Charisma multiplier is now 1.04x\n\nPlease choose level 5 specialization for Pray.\n\nCan I do this later? I have a band of ravenous mosquitoes to look after.\n\nIf a specialization is not chosen within 24 hours, one will be chosen automatically.\n\nThe rarest one?\n\nThe specialization chosen will be randomized.\n\nFuck. Alright, I bet I can do this while flying. System, what are my options?\n\nPray(Lv5):\n\nIt’s the Thought that Counts:\n\nRequirements - Pray(Lv5)\n\nPrayers that are not responded to level the class 2x faster.\n\nEmpowered Prayer:\n\nRequirements - Pray(Lv5), Have a religious class that targets a god\n\nPrayers to your god are 2x clearer to them and seem more convincing.\n\nGrowing Prayers:\n\nRequirements - Pray(Lv5), Pray is targeted to a god that is not yet born\n\nPrayers to unborn gods are 5x more effective at making them grow.\n\nEncompassing Prayers:\n\nRequirements - Pray(Lv5), Have a religious class targeted towards leading\n\nIf a temporary boon is given thanks to a prayer, it will be given to all allies within 100ft too.\n\nWho Needs the Gods?:\n\nRequirements - Pray(Lv5), Have the Blasphemy trait at Major or higher\n\nIt is 5%(Level of Pray) harder for gods to interfere with you, but also 10%(Level of Pray • 2) easier for other higher beings to interfere with you.\n\nThey Answered!:\n\nRequirements - Pray(Lv5), Have a prayer answered\n\nWhen prayers are answered the results are 3x better\n\nOnly My God Matters!:\n\nRequirements - Pray(lv5), Have the Blasphemy trait, Have a religious class that targets a god, Have the Mocked by The Gods trait\n\nLocks all religious skill targets to current god (Mosquito God). All religious skills level 2x quicker and are 4x more effective. Against members of other religions, all skills are 3x more effective.\n\nIs this even a question…? GIVE ME THE LEGENDARY ONE!\n\nMosquito God 0.000000001% to birth.",
            "comments": [
                {
                    "comment_id": "8143136",
                    "username": "AshroBugger",
                    "comment_text": "Instantly bad book, the mc is mosquito. I have a burning rage to all mosquitos!",
                    "time": "2023-03-10T02:01:51.0000000+00:00",
                    "replies": [
                        {
                            "comment_id": "8143164",
                            "username": "AshroBugger",
                            "comment_text": "Im’a write a book about a mosquito slayer now!",
                            "time": "2023-03-10T02:08:36.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "8143242",
                            "username": "lemonleapoard",
                            "comment_text": "Perhaps the mc will change your mind. :) We'll have you loving mosquitoes sooner or later.",
                            "time": "2023-03-10T02:24:47.0000000+00:00",
                            "replies": [
                                {
                                    "comment_id": "8143255",
                                    "username": "AshroBugger",
                                    "comment_text": "No! They must be purged!",
                                    "time": "2023-03-10T02:28:00.0000000+00:00",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "comment_id": "8143255",
                            "username": "AshroBugger",
                            "comment_text": "No! They must be purged!",
                            "time": "2023-03-10T02:28:00.0000000+00:00",
                            "replies": []
                        }
                    ]
                },
                {
                    "comment_id": "8360498",
                    "username": "LightNovelNovice",
                    "comment_text": "Edit suggestions:\n\nBut warehousewhere are those mates I’ve been promised?\n\nThis was an amusing typo :P",
                    "time": "2023-04-07T04:03:50.0000000+00:00",
                    "replies": [
                        {
                            "comment_id": "8362559",
                            "username": "lemonleapoard",
                            "comment_text": "Thanks for the suggestion!",
                            "time": "2023-04-07T12:03:38.0000000+00:00",
                            "replies": []
                        }
                    ]
                },
                {
                    "comment_id": "8890674",
                    "username": "Dude88",
                    "comment_text": "Tftc",
                    "time": "2023-06-09T15:58:40.0000000+00:00",
                    "replies": []
                }
            ]
        },
        {
            "id": "1134392",
            "name": "Interlude: The Church of Illinois",
            "url": "https://www.royalroad.com/fiction/64990/i-wanted-to-be-a-vampire-not-a-mosquito-monster/chapter/1134392/interlude-the-church-of-illinois",
            "content": "The Goddess of Chaos, REDACTED, is most commonly known by just her title. This is because members of her church only refer to her, affectionately, as Elly around others. It is unknown why, but her name is a very closely guarded secret. When people outside of the church manage to learn it, holy quests by all gods are given to destroy them.\n\n—Sir Elias the Second, Head of the Church of Illinois\n\nIt was starting out to be a peaceful day. The sun was shining, and the gardens were thriving. The ants had just made a new hill, the grasshoppers found food, and the new enchantments on the scarecrows were doing their jobs.\n\nThat was never a good sign. Florida, God of the Weather, was never in a mood this good unless one of the other gods were upset, and usually a big one.\n\nI got out of my nightwear and into my official robes. They were a piece of lime green silk that trailed behind me as I walked. The image of a praying mantis was stitched into the back, and along the arms, making it seem alive as I walked.\n\nAn hour later, I was called for a meeting with one of the cardinals, Cardinal Beer Belly, as was his unofficial title (I have heard rumors it was put on his status, though.). Soon, I was standing in front of two large, oaken doors. A mural was carved into it, so lifelike it felt like it would reach out and touch me.\n\nThis story originates from a different website. Ensure the author gets the support they deserve by reading it there.\n\nIt was of a praying mantis, the same majestic creature that was on my back, eating a prey much larger than itself. It was sitting on top of a mountain of mice, with the largest of them in its grasp.\n\nThe mice around it were all killed brutally. Some had their heads lopped off; while others’ eyes had bite marks in them, blood oozing and spraying out.\n\nA grim seem like usual, as battles involving insects normally are. People don’t realize it, but battles with insects can be the bloodiest of all.\n\nI knocked on the door thrice, as was tradition, and got called inside.\n\nI walked in to a large man sitting at a desk. He looked decent, middle-aged, a scraggly beard, and a bit of a belly on him. Behind him were rows of beers, ordered by their price, which probably helped him with that last trait. Cardinal Jared, head of this section of the Lyre Empire.\n\n“Hunter Circle, I have a new job for you,” and right to business, as usual. “There is a new heretic that popped up near the Red Massacre. Supposedly he has a Mocked by The Gods trait, so I expect this one will be easy for you.”\n\nAh yes, my Illinois’s Dog job will come in handy for this one.\n\n“Supposedly they’re trying to birth a new god, crazy bastard.”\n\nOh? Perhaps someone from another church will come along too.\n\n“Don’t expect any backup though, Elly is apparently putting some pressure on the others for this one, so they are refraining from interfering.”\n\nWell, at least this will be interesting.",
            "comments": [
                {
                    "comment_id": "8151526",
                    "username": "chaos_swan_king123",
                    "comment_text": "Oooh interesting.",
                    "time": "2023-03-11T05:55:48.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8890757",
                    "username": "Dude88",
                    "comment_text": "Tftc",
                    "time": "2023-06-09T16:06:42.0000000+00:00",
                    "replies": []
                }
            ]
        },
        {
            "id": "1136979",
            "name": "11. Swarm",
            "url": "https://www.royalroad.com/fiction/64990/i-wanted-to-be-a-vampire-not-a-mosquito-monster/chapter/1136979/11-swarm",
            "content": "Oh wait fuck, I’m losing them! They started flying faster after leaving the blood, personally, I think it should’ve been the other way around though. What kind of mosquitoes get faster away from the presence of blood?!?! That is most definitely not right! Whatever! Off to the unknown! We flew past what I would generously call a wasteland. It was barren of all signs of life. We passed nothing but dirt and rocks, and dirt and rocks, and MORE DIRT AND ROCKS! I WANNA GO BACK TO THE POOL OF BLOOD! At least there I had something to eat! How bad would it be to lose this quest? System, how much xp do I have?\n\nExperience: 6/20\n\nWould going into negative xp be bad? It’s not like they can take back my levels. Actually… after everything that happened they probably could… ALRIGHT! OFF TO THE UNKNOWN!!! We flew for a while longer, AND WE CAME UP TO SOMETHING! Something that does not look nice, in fact it looks pretty bad…\n\nWe came across a bright red boar. I mean, it looked just like any other boar, fur, hooves, those weird tusks. Except it was bright red… and huge! That thing was the size of a large hill! I couldn’t even see over it! WHAT IS WRONG WITH THIS WORLD!?!?!\n\nOh wait… I’M A MOSQUITO! I… really hope this world doesn’t have elephants. Oh wait, oh no, please don’t!\n\nThe Mosquitos had the bright idea to attack it! THE HILL SIZED BOAR!\n\nThe mosquitos all landed on it, and started sucking. Now, I imagine 100 mosquitos on my must be rather annoying, and I think the board agreed. It started thrashing and kicking all around it. I watched in horror as it started crushing the mosquitos on it, one by one, until it… stopped? Wait what!?!?\n\nIT STOPPED!?!?!\n\nQuest: Lead the Disaster Mosquitoes!(1/100)\n\nWhat the hell? THEY KILLED IT!?!?! HOW?!?! NO! THAT’S NOT FAIR! HOW IN THE!?!?! I COULD NEVER KILL IT WITH 100 OF ME! WHAT ARE THE STATS ON THESE THINGS!?!?! I CALL CHEATS! LET ME BE A DIFFERENT MOSQUITO! I DEMAND A REDO!!!!!!!!\n\nUnauthorized use of content: if you find this story on Amazon, report the violation.\n\nOh wait, they’re off again! NO WAIT, WE’RE OFF AGAIN!\n\nAnd this happened again, with another 2 boars, really driving home how much the world hates me, making me a regular mosquito. Stupid world.\n\nAnd then they came. They flew in like a storm high on cocaine. They were everywhere, hopping along the ground, flying through the air, I’m pretty sure I even saw a few come out from the ground. It was a swarm, of locusts. They came crashing through like a plague, and got utterly massacred by my fellow mosquitos.\n\nIt was like watching ants try to survive a hurricane, and that’s putting it lightly. The mosquitos blurred from my vision as they attacked, each spearing at least 3 locusts a second. The battle was over almost before it even had a chance to begin. In a few seconds there were thousands of locusts lying dead on the ground, I think I finally understood why they were called disaster mosquitos.\n\nQuest “Lead the Disaster Mosquitoes!” Completed\n\nReward(s):\n\n10% resistance to damage from disasters.\n\nAnd so, I left my mosquito friends to go do their own thing, as I had something much more important to do. I had locusts to eat! I went up to the first of what I assumed would be many bodies, and got to work sucking.\n\nBloodsucker+1 activated. Locust(Lv 1) blood(fresh) consumed. + 1 exp. 10% progress to locust skill.\n\nAnd, 9 mosquitos and 9 more xp later! I finally did it!\n\nBloodsucker+1 activated, Locust Skill Swarm Tactics unlocked\n\nBloodsucker+1 level up. Constitution multiplier is now 1.01x.\n\nHaha, my first group battle that I totally participated in! And it comes with a handy dandy rewards! System! Show me what Swarm Tactics does!\n\nSwarm Tactics:\n\nIncreases constitution multiplier by .01(Members of Swarm / 100).\n\nI have a swarm member…? And sure enough, from the distance, my cult member came flying in at a leisurely pace.",
            "comments": [
                {
                    "comment_id": "8169598",
                    "username": "void squid",
                    "comment_text": "Honestly loving the story🤭",
                    "time": "2023-03-13T22:25:40.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8231935",
                    "username": "3SlicesOfBread",
                    "comment_text": "Edit suggestions:\n\nThe mosquitos blurred from my vision as they attacked, each spearing at least 3 m locusquitos a second.",
                    "time": "2023-03-21T22:07:01.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8890846",
                    "username": "Dude88",
                    "comment_text": "Tftc",
                    "time": "2023-06-09T16:14:22.0000000+00:00",
                    "replies": []
                }
            ]
        },
        {
            "id": "1137907",
            "name": "12. Status Catchup",
            "url": "https://www.royalroad.com/fiction/64990/i-wanted-to-be-a-vampire-not-a-mosquito-monster/chapter/1137907/12-status-catchup",
            "content": "Day 4\n\nWell then, now what? I guess I could look over the things on my status. I think I skipped over a few traits. System, show me my status, please.\n\nName: Mosquito Overlord, Mosquito of Death, or maybe just Tim\n\nGender: Male\n\nLevel: 3/5\n\nExperience: 16/20\n\nAge: 3 days\n\nExpected Lifespan: 7 days\n\nRace: Mosquito(Tier 0)\n\nStats:\n\nHealth: 1.52/ 1.52\n\nMana: 47/47\n\nStrength: 0.1\n\nAgility: 0.3\n\nDexterity: 0.106\n\nIntelligence: 110\n\nConstitution: 0.102\n\nCharisma: 1.04\n\nSkills:\n\nAerial Combat(Lv 1)\n\nBloodsucker+1(Lv 2)\n\nFly(Lv 7)\n\n(Lv 5)Holy Flight\n\nPray(Lv 5)\n\n(Lv 5)Only My God Matters!\n\nSwarm Tactics(Lv 1)\n\nClass Skills:\n\nBloody Ritual(Lv 1)\n\nLead Prayer(Lv 1)\n\nMember Initiation\n\nMessenger of the Mosquito God(Lv 1)\n\nProtection of Blood(Lv 1)\n\nTraits:\n\nLove this story? Find the genuine version on the author's preferred platform and support their work!\n\nBlanket Of Enemies\n\nBlasphemy(Major)\n\nBlood Born\n\nMocked by The Gods\n\nMonster?(Legendary)\n\nSelf-Named\n\nSuper Fertile\n\nAlright, so what haven’t I seen before? I think I forgot to check Aerial Combat, so let’s start with that. System! Show me Aerial Combat!\n\nAerial Combat(Lv 1):\n\nGives the user knowledge on how to fight while midair.\n\nAlright cool, that means literally nothing. At all. It gives me knowledge?!?! HOW AM I SUPPOSED TO QUANTIFY THAT!?!?! Alright, it’s fine (not really). I bet the Fly makes more sense, System, show me what Fly does.\n\nFly(Lv 5):\n\nGives users with wings knowledge on how to use them.\n\nLv 5 Holy Flight:\n\nRequirements - Fly(Lv5), Pray(Lv 3), Pray skill targeted at a god that can fly\n\nIncreases the amount of thrust generated by wings. Pray skill is 5%(Level of Fly) stronger. Wings are imbued with holy energy and become 3%(Level of Pray) sharper and harder.\n\nAlright fuck you too. Seriously?!?! I get the holy flight, but more knowledge!?!?! WHAT DOES IT MEAN!?!?! GIVE ME NUMBERS! THEY ACTUALLY MAKE MORE SENSE THAN WORDS FOR ONCE! GRRRRRRRR! It’s fiiiiine (really not really)! I still have one more! SYSTEM! PLEASE (and you better make it good) SHOW ME… Super… Fertile…\n\nSuper Fertile\n\nRequirements - Born with less than 30 days to live.\n\n10x more fertile.\n\nAm… AM I BEING MOCKED FOR MY SHORT LIFESPAN!?!?! THAT IS A LOW BLOW! NO! NOT FAIR! I HAD FINALLY (kinda) GOTTEN OVER IT! ALRIGHT! WHO DID THIS?!?! I WILL FIGHT YOU! Alright, alright, calm down, it’s okay. There is nothing I can do about this. Wooo. Calm. Like a… rock. Yes, calm like a rock.\n\nSkill Like a Rock obtained.\n\nThat’s a skill? Okay? That’s cool… probably… Hopefully… System, what does Like a Rock do?\n\nLike a Rock:\n\nTake on the properties of a rock.\n\nSo… I complain about bad skill descriptions… and I GET THIS?!?!?! I am totally being made fun of here, aren’t I? Haha Elly, really funny.\n\nWasn’t me - Elly ;)\n\nAlright, I will shelf this for now. Back to business. What was I doing oh? Oh yeah, checking my skills. I’m done with that. What’s next? Finding a meal? I could go back to the bloody lake… Yeah fuck that. Even if I starve I am never going back. Ever. That place is way too boring… and the only thing to drink is… doesn’t matter! Oh wait, I haven’t checked Mocked by the Gods or Self-Named yet. Alright, let’s make this a two for one. SYSTEM! Show me Mocked by the Gods and Self-Named, please.\n\nMocked by The Gods:\n\nRequirements - Have something about you mocked by at least 10 Gods.\n\nAll beings with holy jobs at a higher level than the owner of this trait (Lv 1) can see what the gods are mocking them for (Name).\n\nSelf-Named:\n\nRequirements: Pick your name yourself.\n\n10% harder to be forced into a soul contract without your consent.\n\nI’m sorry… how many gods are mocking my name!?!?! WHAT DO YOU MEAN AT LEAST 10! DO THEY NOT HAVE ANYTHING BETTER TO DO !?!?!?! YOU GODS SUCK! ALL OF YOU! GO DIE IN A HOLE!\n\nQuest “Don't Insult Elly, Goddess of Chaos, Pretty Much the Only God that can Mess with the Status of Reincarnators” failed.\n\nLife Expectancy - 5 days\n\n...I'm sorry?",
            "comments": [
                {
                    "comment_id": "8177752",
                    "username": "A reader627152783",
                    "comment_text": "Thank you for the chapter",
                    "time": "2023-03-15T00:15:44.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8178798",
                    "username": "chaos_swan_king123",
                    "comment_text": "I've been meaning to ask this, but why is he not drinking from the lake to get to lvl 5 as soon as possible.",
                    "time": "2023-03-15T04:06:54.0000000+00:00",
                    "replies": [
                        {
                            "comment_id": "8182142",
                            "username": "lemonleapoard",
                            "comment_text": "He has a limited stomach capacity.",
                            "time": "2023-03-15T16:45:49.0000000+00:00",
                            "replies": []
                        }
                    ]
                },
                {
                    "comment_id": "8411660",
                    "username": "SteakLord",
                    "comment_text": "thanks for the chapter",
                    "time": "2023-04-13T16:21:24.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8890892",
                    "username": "Dude88",
                    "comment_text": "Tftc",
                    "time": "2023-06-09T16:19:02.0000000+00:00",
                    "replies": []
                }
            ]
        },
        {
            "id": "1138917",
            "name": "13. System",
            "url": "https://www.royalroad.com/fiction/64990/i-wanted-to-be-a-vampire-not-a-mosquito-monster/chapter/1138917/13-system",
            "content": "Day 4\n\nI… I didn’t mean it… Elly…? Please!?!?! I WANT MY DAYS BACK!!!!!! ELLLLLYYYYY!!!!!!!!!!!!!! I’m… no… my days… System, what’s my life expectancy…?\n\nExpected Lifespan: 2 days\n\nI-I… okay. I can deal with this! I just need to up my life expectancy, right? Yeah, that’ll work just fine. I’ll just eat a turtle or something. They live long, I bet they have a skill for that, right? RIGHT?!?! NOW WHERE DO I FIND A TURTLE!?!?! WAIT! GETTING STRONGER MAKES PEOPLE LIVE LONGER, RIGHT?!?! Wait no, that depends on the genre. But maybe?!?! Alright, I bet I can eat some more locusts, yes, I can do that.\n\nBloodsucker+1 activated. Locust(Lv 1) blood(fresh) consumed. + 1 exp. 5% progress to locust skill.\n\nHEY!?!?! IT WENT UP BY 10% LAST TIME! THIS IS NOT FAIR! WHY IS IT WEAKER NOW?!?!THIS WAS NOT IN THE DESCRIPTION! I DEMAND RECOMPENSE!\n\nDescription of Bloodsucker+1 updated.\n\nSYSTEM! SHOW ME THE DESCRIPTION OF BLOODSUCKER!\n\nBloodsucker+1:\n\nGain experience from consuming the blood of creatures, and when enough blood of a single species has been consumed, gain a random skill from their species. Each subsequent skill gained from the species requires more blood.\n\n+1 Can store 10x more blood. Blood is digested 30x faster.\n\nAt least it isn’t for everything… WHAT AM I KIDDING?!?! FIX THIS! I DEMAND MY SKILL BE MADE BETTER! SYSTEM! I WAS LIED TO! FIX THIS!!\n\nProcessing Request…\n\nDue to uncovering a previously unknown aspect of skill Bloodsucker+1 rewards will be granted.\n\nRewards:\n\n10 xp\n\n2 levels in Bloodsucker+1\n\nTrait Skill Researcher\n\nLevel up!\n\n+5 stat points\n\nBloodsucker+1 level up. Constitution multiplier is now 1.03x.\n\nBloodsucker+1 level up. Constitution multiplier is now 1.04x.\n\nTrait Skill Researcher unlocked\n\nWho said complaining never gets you anything? Clearly it does! Thanks, system. Now, to abuse you. Let me level up!\n\nUnauthorized use of content: if you find this story on Amazon, report the violation.\n\nLevels can only be obtained by gaining experience.\n\n…haaaa. System, I want to use my stat points.\n\nPlease select stats to put points into. (5 Available)\n\nStrength: 0.1\n\nAgility: 0.3\n\nDexterity: 0.1\n\nIntelligence: 100\n\nConstitution: 0.1\n\nCharisma: 1\n\nAlright, I know what I need to do. System! Put 1 point into agility!\n\nPlease select stats to put points into. (4 Available)\n\nStrength: 0.1\n\nAgility: 1.3\n\nDexterity: 0.1\n\nIntelligence: 100\n\nConstitution: 0.1\n\nCharisma: 1\n\nThat will be all, thanks.\n\nWARNING! If available stat points are not added, they will be removed! Confirm Action?\n\nWAIT WHAT NO?!?! I DO NOT CONFIRM!\n\nPlease select stats to put points into. (4 Available)\n\nStrength: 0.1\n\nAgility: 1.3\n\nDexterity: 0.1\n\nIntelligence: 100\n\nConstitution: 0.1\n\nCharisma: 1\n\nWooo. I guess I won’t be abusing you quite yet, system, put another 4 points into agility, please.\n\nProcessing Request…\n\nAgility: 5.3\n\nERROR! Attribute Point cannot increase a stat by more than 10% of its base value.\n\nCompensating…\n\nAgility: 0.45\n\nI feel like you should add something so I don’t get an error message whenever I try to level up! This is getting annoying! Alright, let’s get down to business! What does Skill Researcher do?\n\nSkill Researcher:\n\nRequirements - Show the system something new about a skill, Have an overseer assigned for your system\n\n50% easier to obtain skills.\n\nI don’t like that. I don’t like that AT ALL! SYSTEM! WHAT’S AN OVERSEER!?!?!\n\nProcessing Request…\n\nInformation Redacted\n\nOh fuck you! NO! I DON’T WANT AN OVERSEER! I WANT MY PRIVACY! STOP WATCHING ME! GO AWAY! THIS IS AGAINST MY HUMAN RIGHTS!!! Except I’m not a human… do animals have rights…? You know what, as an animal, I say we do!\n\nProcessing Request…\n\nWARNING! Upon removing the overseer, access to the system will be revoked.\n\nYou know, I like my overseer. Yup. They’re a great guy (gal?). They’ve been so nice to me. It would be a waste to make them leave over a tiny issue like privacy. Who needs privacy anyways? Yeah privacy’s for losers. I prefer my lack of privacy; it makes me cool.\n\nNEW QUEST AVAILABLE!!\n\nChange your Overseer to Elly, Goddess of Chaos!\n\nSuccess:\n\nRequest a change of your overseer to Elly, Goddess of Chaos\n\nFailure:\n\nDo not change your overseer before death.\n\nReward(s):\n\nHave the magnificent Goddess of Chaos as your overseer.\n\n5 Xp.\n\nPenalty for Failure (Or not Accepting):\n\nElly’s Wrath\n\nAccept Quest(Y/N)?\n\n…I think I’m gonna accept that quest… Because Elly is the best. My favorite Goddess, yup, that’s why. And system? I would like to request a change of my overseer. Can you make it Elly?\n\nProcessing Request…\n\nRequest Accepted! Overseer changed to Elly, Goddess of Chaos.\n\nQuest “Change your Overseer to Elly, Goddess of Chaos!” completed!\n\nReward(s)\n\nHave the magnificent Goddess of Chaos as your overseer.\n\n5 Xp.\n\nCool, awesome. I am going to have a great… What’s my current life expectancy?\n\nExpected Lifespan: 2 days\n\nThese are going to be a great 2 days… I can feel it.",
            "comments": [
                {
                    "comment_id": "8184558",
                    "username": "RailCannonLiebe",
                    "comment_text": "My dude just made the worst mistake of his life",
                    "time": "2023-03-15T22:17:08.0000000+00:00",
                    "replies": [
                        {
                            "comment_id": "10114556",
                            "username": "Death's gaze",
                            "comment_text": "Yh he doesn't learn",
                            "time": "2023-11-01T19:10:14.0000000+00:00",
                            "replies": []
                        }
                    ]
                },
                {
                    "comment_id": "8411686",
                    "username": "SteakLord",
                    "comment_text": "thanks for the chapter",
                    "time": "2023-04-13T16:24:51.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8891123",
                    "username": "Dude88",
                    "comment_text": "Tftc",
                    "time": "2023-06-09T16:40:22.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "13903628",
                    "username": "True reader",
                    "comment_text": "How many stats do you need to waste",
                    "time": "2024-11-12T20:53:06.0000000+00:00",
                    "replies": []
                }
            ]
        },
        {
            "id": "1139858",
            "name": "14. Blood",
            "url": "https://www.royalroad.com/fiction/64990/i-wanted-to-be-a-vampire-not-a-mosquito-monster/chapter/1139858/14-blood",
            "content": "The term overseers is a strange one. There are mentions of it in a few historical texts, and it is occasionally said to be uttered by the mad. Not much is known about it, as the records found appear to contradict each other greatly. Some describe them as benevolent angels that help to make people stronger, while others say they are mischievous devils, hampering growth or trying to collapse nations whenever possible. All that is certain is that the people who mention them were all people of great power.\n\n-Unknown Historian, Three days before death\n\nDay 4\n\nI decided the best course of action was to finish my meal, and then deal with my impending doom…\n\nBloodsucker+1 activated. Locust(Lv 1) blood(fresh) consumed. + 1 exp. 20% progress to locust skill.\n\nAnd three mosquitoes later I was done. System, how much experience do I have?\n\nExperience: 15/25\n\nSo… there’s only one way I’m gonna get that last level isn’t there… But I really don’t want to… I was finally on dry land… I’m gonna have to go back to the sea, aren’t I? This is not fair! I wanna see the world! You know what, I can’t even guarantee I will be able to live longer if I do level up. I’m gonna go exploring!\n\nA method to increase life expectancy may appear at level 5 -Overseer Elly\n\n…Should I be thankful for that information? Alright. So I have two options. I can either trust the cryptic message by the goddess that has done pretty much nothing but threaten and harm me… Or I could go and explore and have some fun… but if I don’t increase my life expectancy… and I die… my soul will be given to Illinois… Huh. THAT’S NOT FAIR! I WANT TO HAVE FUN! NOT SIT AROUND SOME STUPID BLOOD LAKE! GRRRRRRRRRR! WHY CAN’T SOMETHING GO MY WAY FOR ONCE!?!?!\n\nA case of literary theft: this tale is not rightfully on Amazon; if you see it, report the violation.\n\nALRIGHT! BACK TO THAT STUPID LAKE WITH NOTHING TO DO BUT WAIT AND SLEEP! Except… where is it? I kind of wasn’t paying attention… Hmmm. Alright! I shall go the opposite of the way the mosquitoes left! That makes sense! Yes! I shall go… sun down?\n\nYES! SUN DOWN! OFF INTO THE UNKNOWN… Wait, the known, I've been there before! I CAN’T EVEN SAY THE LINE NOW! C’MON! Wait, I couldn’t say it before, only think it…\n\nOff into the known…\n\nTwenty minutes later and I came to a harrowing conclusion. I was definitely lost. I was pretty certain I had seen this football shaped rock at least three times, and how many football shaped rocks can there be, right? So… What next? Clearly my sun based navigation did not work. Perhaps I can smell it? Didn’t Blood Born do something like that? System, what does Blood Born do?\n\nBlood Born:\n\nRequirements - Born in a pool of blood.\n\nIncreases attunement to blood by 10%. Highlights nearby sources of blood.\n\nMaybe it will be highlighted? System! Activate Blood Born!\n\nBlood Born activated\n\nAlright, so I looked around, only to see absolutely nothing was highlighted. Of course it isn’t! Why would there be an easy source of xp nearby? Yup. So, I decided there was clearly only one course of action. More loop de loop practice! So I started my loop and— WHAT THE HELL IS THAT!?!?!?! IT’S SO BRIGHT! OH GOD! TURN IT OFF! PLEASE! FOR THE LOVE OF GOD!\n\nBlood Born deactivated\n\nWhat? Aren’t those… clouds?!?!?! WHY ARE THE CLOUDS FULL OF BLOOD!?!?! WHAT IS WRONG WITH THIS WORLD!?!?! FIRST A LAKE OF BLOOD AND NOW SOME CLOUDS!?!?! I SWEAR! THIS MAKES NO SENSE! HOW DOES BLOOD GET INTO THE CLOUDS!?!?! HAS NOBODY THOUGHT ABOUT HOW EVAPORATION WORKS?!?! IT CAN’T EVEN CARRY SALT!",
            "comments": [
                {
                    "comment_id": "8194759",
                    "username": "Omegawerewolf",
                    "comment_text": "TFTC",
                    "time": "2023-03-16T20:58:08.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8891193",
                    "username": "Dude88",
                    "comment_text": "Tftc",
                    "time": "2023-06-09T16:49:15.0000000+00:00",
                    "replies": []
                }
            ]
        },
        {
            "id": "1141046",
            "name": "15. Clouds",
            "url": "https://www.royalroad.com/fiction/64990/i-wanted-to-be-a-vampire-not-a-mosquito-monster/chapter/1141046/15-clouds",
            "content": "Curious things tend to happen in areas where massacres occur, and they can be very interesting. The most common occurrence, as most people would think, is the creation of a field of undead. If the bodies are not taken care of quickly, they will quickly attune the ambient mana to death and start to rise again. This phenomenon is also the easiest to deal with. The second most common occurrence would be what happens around the sites of Godly Interference, the lingering holy mana stops the undead from rising, but is also too strong to let any but the most pious live there for long without seriously suffering. The final occurrence which I am going to mention is a much more curious one. It tends to happen when people are killed for great rituals or too much of their blood seeps into the ground. It will help attune the ambient mana to the blood property, making entire ecosystems that thrive on blood instead of water.\n\n-Excerpt from The Environmental Impacts of Mana, by Professor Lamia\n\nAlright, I’ve gotten plenty of levels in fly, right? Maybe if I can fly up to the clouds I can drink the clouds! Alright, they can’t be that high, right? TO THE CLOUDS! And so, I started climbing. Up and up I went, getting way higher than I could before. Only to come nowhere near the height I needed to reach. At all. I mean, let me make a comparison. If my goal was to fly to the top of a tree, I probably just made it past the roots that aren’t quite in the ground for whatever reason. Alright, but I have an idea, and based on the the description I got from pray, it might just work. OH MAGNIFICENT AND GREAT MOSQUITO GOD! PLEASE GRACE ME WITH YOUR PRESENCE AND ALLOW ME TO FLY ALL THE WAY TO THE CLOUDS!\n\nPray level up. Charisma multiplier is now 1.05x\n\nMosquito God 0.0000000011% to birth.\n\nAlright, but that doesn’t really he-\n\nA huge gust of wind shot up at me from below and sent me tumbling through the air. Up I went, tossed around like a mosquito in the wind, literally. It was horrible. I was turning over and over, unable to control my ascent even slightly. I watched the ground disappear from beneath me over and over, as it went in and out of my view. Until I hit something. It was hard, moist, and oddly red. And completely stopped my momentum, mostly. I went through it first. Feeling gravity about to take its hold over me again, I did the most obvious thing. I flapped my wings, hard and fast, and in thirty seconds I was upright again! And right there below me was an inconspicuous looking cloud… and my cult member? WHAT THE HELL WAS HE DOING HERE!?!?! HUH!?!?! Oh, wait… I guess it was a strong gust of air, and he was right next to me… Alright! Journey with a friend! Perhaps we can eat clouds together!\n\nThis story originates from a different website. Ensure the author gets the support they deserve by reading it there.\n\nSo, I flew down to the cloud’s level, and went right into it. And there was a small problem. How do you eat damp air? I basically have a straw attached to me and that’s it. This is not very conducive to drinking… How does one eat a cloud? Hmmm…. What a conundrum… This was totally a waste of time, wasn’t it? I prayed to get sent flying up here, only to be unable to do a thing! IF I HAD A MOUTH AT LEAST I COULD TRY TO BITE IT!!!!! BUT I’M STUCK WITH THIS STUPID SPEAR? WHAT CAN I DO WITH IT?!?! STAB!?!?! HERE I’LL STAB!!! And, of course, I stabbed, a few times, then got a cool new skill.\n\nSkill Spear Handling obtained.\n\nDescription of Spear Handling updated.\n\nWhat? I just got that!?!?! System, what’s Spear Handling?\n\nSpear Handling\n\nGives users knowledge on handling their big spears. ;)\n\n…Ummm. Is that an emoticon…? Elly…? What did you do!?!?!\n\nOverseers have the right to modify personal skill descriptions.\n\n…ELLY!?!?! FIX IT! I WANT MY SKILL DESCRIPTIONS! THAT WAS MY LIFEBLOOD! THAT WAS THE ONE THING THAT WAS MOSTLY FINE! AAAAAAAAAAAAAAAAHHHHHHHHHHHHHH! I SHOULD’VE JUST ACCEPTED YOUR WRATH! THIS IS NOT FAIR! SYSTEM! I WANT TO REQUEST A CHANGE OF OVERSEER!\n\nProcessing Request…\n\nOverseer must be requested by name.\n\nSystem, I would like to request a change of overseer to the Mosquito God…?\n\nProcessing Request…\n\nRequest Denied.\n\nWhat do you mean denied!?!?! YOU CAN’T DENY ME! I DEMAND TO SEE YOUR MANAGER!\n\nProcessing Request…\n\nRequest Denied.\n\nDenied? DENIED!?!?! I WILL BE THE ULTIMATE KAREN! THIS IS NOT THE LAST YOU WILL HEAR OF ME!",
            "comments": [
                {
                    "comment_id": "8203082",
                    "username": "RailCannonLiebe",
                    "comment_text": "Mosquitoes are annoying.\n\nKarens are also annoying.\n\nIowa help those who meet both.",
                    "time": "2023-03-17T22:11:01.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8891241",
                    "username": "Dude88",
                    "comment_text": "Tftc. Lol",
                    "time": "2023-06-09T16:54:31.0000000+00:00",
                    "replies": []
                }
            ]
        },
        {
            "id": "1143844",
            "name": "16. Level 5",
            "url": "https://www.royalroad.com/fiction/64990/i-wanted-to-be-a-vampire-not-a-mosquito-monster/chapter/1143844/16-level-5",
            "content": "Day 4\n\nSYSTEM!?! How would someone go about filing a complaint?\n\nProcessing Request…\n\nRequest Denied.\n\nAlright, alright. That’s fiiiine. THAT’S FINE! I have more options! Such as… OH ALMIGHTY MOSQUITO GOD! Please smite Elly for me, you can do that, right? Smite another god?\n\nSkill Messenger of the Mosquito God Provides a new quest!!!\n\nCompliment Elly\n\nSuccess:\n\nGive Elly, Goddess of Chaos, a compliment.\n\nFailure:\n\nInsult Elly, Goddess of Chaos.\n\nReward(s):\n\n10 xp\n\nPenalty for failure:\n\nLife expectancy -2 days\n\nAccept Quest(Y/N)\n\nNot you too Mosquito God… WHAT DOES SHE HAVE ON YOU!?!?! ANSWER ME!?!?! MOSQUITO GOD!!! Oh, and I’ll accept this quest. Elly, you’re great at spreading chaos. In fact, you’re probably the best at it!\n\nQuest “Compliment Elly” completed!\n\nReward(s)\n\n10 Xp.\n\nLevel up!\n\n+5 stat points\n\nMax Level obtained! Evolution is now possible!\n\n…I’m sorry what? Does that say evolution!?!?! HAHAHA! I WILL NOT HAVE TO BE A WEAK MOSQUITO ANYMORE! IS THIS THE OPPORTUNITY ELLY PROMISED!?!?! I AM ALIVE! I CAN LIVE! I DON’T HAVE TO DIE SO SOON! THANK YOU ELLY! I LOVE YOU! YOU REALLY ARE MY FAVORITE GODDESS!\n\nALRIGHT SYSTEM! I WANT TO EVOLVE!\n\nWARNING! UNUSED ATTRIBUTE POINTS WILL BE REMOVED! Continue?\n\nUhh, no, just put them all into agility please, system.\n\nProcessing Request…\n\nAgility: 5.45\n\nERROR! Attribute Point cannot increase a stat by more than 10% of its base value.\n\nCompensating…\n\nAgility: 0.675\n\nALRIGHT! NOW I WANT TO EVOLVE!\n\nProcessing Request…\n\nEvolution Options:\n\nPoison Mosquito(Tier 0):\n\nMosquitoes born in areas bathed in poisonous mana. Poison Mosquitoes are not very strong physically, but are mildly poisonous. Their poison gets stronger the longer they live, but it is generally considered only mild as their lifespan is not long.\n\nRequirements - Be a mosquito, Willingly ingest poison\n\nExpected Lifespan: 10 days\n\nMax Level: 5\n\nStats:\n\nStrength: 0.1\n\nAgility: 0.2\n\nDexterity: 0.1\n\nIntelligence: 0.05\n\nConstitution: 0.05\n\nCharisma: 1\n\nSkills:\n\nFly\n\nPoisonous Bite\n\nAged Poison\n\nTraits:\n\nSuper Fertile\n\nHoly Mosquito(Tier 0):\n\nA species of mosquito created by Illinois, God of Insects. Holy Mosquitoes are much longer lived than most other types, but relatively harmless. Their looks make people confuse them with fireflies, as they appear to consume darkness instead of blood, making them seem to glow.\n\nEnsure your favorite authors get the support they deserve. Read this novel on the original website.\n\nRequirements - Be a mosquito, Have a holy job\n\nExpected Lifespan: 1 year\n\nMax Level: 5\n\nStrength: 0.0001\n\nAgility: 1\n\nDexterity: 0.5\n\nIntelligence: 5\n\nConstitution: 10\n\nCharisma: 10\n\nSkills:\n\nFly\n\nHoly Flash\n\nTraits:\n\nConsumer of the Void\n\nDisaster Mosquito(Tier 0):\n\nMosquitoes born in areas where the fabric of the world is in chaos, or when a higher being wants to send a punishment. Disaster Mosquitoes are not that dangerous individually, being barely different from an ordinary mosquito. But as a group they are a force to be wary of. Disaster Mosquitoes can drink more blood when they are surrounded by others of their kind, and with a mere 10 they have the capacity to drain a full grown boar.\n\nRequirements - Be a mosquito, Survive at least 2 disasters as a mosquito,\n\nExpected Lifespan: 10 days\n\nMax Level: 5\n\nStats:\n\nStrength: 1\n\nAgility: 2\n\nDexterity: 1\n\nIntelligence: 0.5\n\nConstitution: 0.5\n\nCharisma: 10\n\nSkills:\n\nFly\n\nSwarm Tactics\n\nBloody Group\n\nAura of Fear\n\nTraits:\n\nSuper Fertile\n\nDemonic Insect\n\nNatural Disaster\n\nMosquito(Tier 8):\n\nThe evolution of a basic mosquito. A mosquito evolving is an event rarer than an eclipse, and when they do they are rewarded with power to match, causing short lived but disastrous consequences.\n\nRequirements - Reach evolution as a Mosquito(Tier 0).\n\nExpected Lifespan: 2 hours\n\nMax Level: 40\n\nStats:\n\nStrength: 50000\n\nAgility: 700000\n\nDexterity: 600000\n\nIntelligence: 1\n\nConstitution: 100000\n\nCharisma: 500\n\nSkills:\n\nFly\n\nAura of Blood\n\nCommand Species\n\nReplicate\n\nTraits:\n\nSuper Fertile\n\nDestroyer of Countries\n\nConsumer of Oceans\n\nSpecies Paragon\n\nThat’s a lot of text… Let’s go through this one at a time. Alright, so poison mosquito… Got it. That feels like it will be OP if I can live longer than 10 days. It can’t be that hard. It took me what, 3 days to reach level 5? I can’t imagine how OP I would be after a year! Alright, so good option.\n\nWhat’s next? Holy Mosquito? That sounds cool… They were made by Illinois? That might be a bad idea… I can’t imagine becoming something made by a God that hates me would be a good idea… but Consumer of the Void sounds awesome and it is a whole year of life… Let’s shelf that one for now.\n\nDisaster Mosquito? Weren’t those what I was in a group with?!?! THEY WERE OP! Alright… I’m sorry. What is that description!?!?! THE FABRIC OF THE WORLD IS IN CHAOS?!?! Were those mosquitoes my fault!?!?! DID I UNLEASH A MOSQUITO DISASTER!?!?! WAIT! NOPE! IT WAS ELLY! Yeah! She’s the one that put that stupid status on me! Mhmm! Nothing to do with me! …Almost nothing! But ahem! Yeah! This sounds OP! I won’t even need to worry about finding more disaster mosquitoes if my mere presence makes them too! This’ll go on top of the list!\n\nAlright! I think this is the last one! A TIER 8 MOSQUITO!?!?! AND WHAT ARE THESE STATS!?!? THEY’RE IN THE TENS OF THOUSANDS!!! I’M GOING. To.. be… OP…. That’s a 2 hour life expectancy… FUCK! I WANTED TO BE OP! Wait… maybe it’s worth it… 2 hours of being a god… Yeah who am I kidding? Of course it isn’t… I hate this stupid system! It just gives me something good then spits in my face! Every! Single! Time!\n\nNEW EVOLUTION OPTION(S) UNLOCKED!\n\nKaren Mosquito(Tier 0):\n\nMosquitoes born to annoy the gods. Karen Mosquitoes have the uncanny ability to speak to anyone’s manager, even if that manager resides on another plane. Their wings are formed in a shape that can cause a high pitched screeching when flapped in a specific way.\n\nRequirements - Be a mosquito, Annoy Elly, Goddess of Chaos so much she makes a new species\n\nExpected Lifespan: 10 days\n\nMax Level: 5\n\nStats:\n\nStrength: 10\n\nAgility: 10\n\nDexterity: 10\n\nIntelligence: 10\n\nConstitution: 10\n\nCharisma: 10\n\nSkills:\n\nFly\n\nAura of Irritableness\n\nPiercing Flight\n\nTalk To the Manager\n\nTraits:\n\nSuper Fertile\n\nYou know what? I did say I would be the ultimate Karen! Thank you, Elly. SYSTEM! MAKE ME A KAREN MOSQUITO!\n\nWARNING! EVOLVING TO A NEW SPECIES WILL REMOVE ATTRIBUTE BONUSES FROM LEVELS! As compensation 10% of current base attributes will be permanently added to attributes.\n\n…Whatever! I ACCEPT! EVOLVE ME!",
            "comments": [
                {
                    "comment_id": "8224595",
                    "username": "321cab",
                    "comment_text": "The gods will rue the day they crossed Mosquito Overlord, Mosquito of Death, or maybe just Tim.\n\nLove this story btw please continue it.",
                    "time": "2023-03-20T23:44:22.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8226703",
                    "username": "chaos_swan_king123",
                    "comment_text": "Damn, karen mosquitoe is too op.",
                    "time": "2023-03-21T06:30:18.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8232101",
                    "username": "3SlicesOfBread",
                    "comment_text": "What would \"consumer of oceans\" do?\n\nIt sounds like it would give him infinite stomach capacity, which in combination with \"Bloodsucker\" would allow him to consume the entire blood lake.\n\nThat might have given him enough Exp to reach lvl. 40 in time and evolve again.",
                    "time": "2023-03-21T22:33:44.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8891330",
                    "username": "Dude88",
                    "comment_text": "Tftc",
                    "time": "2023-06-09T17:02:29.0000000+00:00",
                    "replies": []
                }
            ]
        },
        {
            "id": "1144703",
            "name": "17. Crusade",
            "url": "https://www.royalroad.com/fiction/64990/i-wanted-to-be-a-vampire-not-a-mosquito-monster/chapter/1144703/17-crusade",
            "content": "Monster evolution is a strange topic. Not much is known about it, as research into it was banned in most cities. What little is known is that monsters get stronger with every tier they go up, and the harder the work the stronger their evolutions. There have been reports of ancient cities falling in nights, due to the evolution of simple creatures like worms. Luckily, most the time when those kind of monsters are created, they never last long enough to destroy too much, so if you see one, run.\n\n-The Bloody Axe, Day 1 of Adventurer Training\n\nI felt myself be detached from my body as I accepted, one limb at a time. First my legs, then my wings, until finally it got to my head and I popped out. I was popped out with so much force that I felt like I was flung in a catapult. Forward into the unknown darkness. I flew for what felt like hours, no control over where I went. Until I felt it. Waves of power flew off of it. I could feel its desires radiating across me, setting my path in stone. Grow. Mate. Consume. PAIN.\n\nI searched for the source of this new desire, looking frantically around the endless void. And I saw it. Hundreds of thousands of mosquito eggs. They glowed in void, the only hint of light for miles around. Except the very edge of it was being destroyed. The lights were slowly blinking out of existence, one at a time. I flew to the edge of the light, flying faster than ever before. Thousands of eggs flew past me as I went. At the edge, I saw it. There were insects, darker than the void. All around the eggs they were biting and scratching, destroying them, eating them. Out of pure instinct and rage, I started to flap my wings quicker. They sped up until they were faster than those of a hummingbird, until a high pitched scream came out. It pierced the void, causing the invaders to back up. Then something happened. All around me, the mosquito eggs hatched. Thousands upon thousands of disaster mosquitoes poured out, and launched themselves into the fray to protect the unborn eggs. And then I was gone.\n\nI was back in my body, laying on the…ground? Wasn’t I in the air?\n\nMosquito God 0.5% to birth.\n\nFly level up. Dexterity multiplier is now 1.07x.\n\nTrait Godly Caretaker unlocked.\n\nTrait Holy Crusader unlocked.\n\nERROR! As a sapient creature, intelligence cannot go below 100.\n\nCompensating…\n\nIntelligence + 90\n\nWhat just happened?\n\nSystem! Show me my status!\n\nDue to being 100% compatible with body, Bloodsucker+1 has been upgraded.\n\nUnauthorized duplication: this narrative has been taken without consent. Report sightings.\n\nName: Mosquito Overlord, Mosquito of Death, or maybe just Tim\n\nGender: Male\n\nLevel: 0/5\n\nExperience: 0/5\n\nAge: 3 days\n\nExpected Lifespan: 10 days\n\nRace: Karen Mosquito(Tier 0)\n\nStats:\n\nHealth: 154.304/ 154.304\n\nMana: 61.7/61.7\n\nStrength: 10.01\n\nAgility: 10.0675\n\nDexterity: 10.71\n\nIntelligence: 109\n\nConstitution: 10.41\n\nCharisma: 10.6\n\nSkills:\n\nFly(Lv 8)\n\n(Lv 5)Holy Flight\n\nLike a Rock(Lv 1)\n\nPray(Lv 6)\n\n(Lv 5)Only My God Matters!\n\nSpear Handling(Lv 1)\n\nAerial Combat(Lv 1)\n\nSwarm Tactics(Lv 1)\n\nAura of Irritableness(Lv 1)\n\nPiercing Flight(Lv 1)\n\nBloodsucker+2(Lv 4)\n\nTalk To the Manager(Lv 1)\n\nClass Skills:\n\nLead Prayer(Lv 1)\n\nBloody Ritual(Lv 1)\n\nMember Initiation\n\nProtection of Blood(Lv 1)\n\nMessenger of the Mosquito God(Lv 1)\n\nTraits:\n\nSuper Fertile\n\nHoly Crusader\n\nSelf-Named\n\nBlanket Of Enemies\n\nBlasphemy(Major)\n\nBlood Born\n\nGodly Caretaker\n\nMocked by The Gods\n\nMonster?(Legendary)\n\nSkill Researcher\n\nAlright, everything seems normal… those are some high stats… aren’t they? Hahaha. HAHAHAHA! I CAN DO IT NOW! I CAN DO IT! ALRIGHT SYSTEM! I WANT TO TALK TO YOUR MANAGER!\n\nTalk To the Manager level up. Charisma multiplier is now 1.06x.\n…It didn’t do anything? System, what does Talk To the Manager do?\n\nTalk to the Manager:\nPeople will feel compelled to grab their manager when you request it from them. Chance of success is based upon how much charisma each person has.\n\n…How much charisma does a system have? Wait. Does it count as a person? Uhhh, Elly? Does the system count as a person? Elly? Please?!?! I NEED TO KNOW! I MADE A PROMISE! TO BE A KAREN! C’MON! LET ME DO THIS! CURSE YOU ELLY! CURSE YOU SYSTEM MANAGER THAT WON’T SPEAK TO ME! SYSTEM! I WANT TO TALK TO YOUR MANAGER!\n\nRequesting Supervisor…\n\nYes..?",
            "comments": [
                {
                    "comment_id": "8233603",
                    "username": "chaos_swan_king123",
                    "comment_text": "F...",
                    "time": "2023-03-22T02:01:21.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8676253",
                    "username": "[Deleted]",
                    "comment_text": "[Account Deleted]",
                    "time": "2023-05-16T00:21:01.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8891386",
                    "username": "Dude88",
                    "comment_text": "Tftc",
                    "time": "2023-06-09T17:08:41.0000000+00:00",
                    "replies": []
                }
            ]
        },
        {
            "id": "1145706",
            "name": "18. Supervisor",
            "url": "https://www.royalroad.com/fiction/64990/i-wanted-to-be-a-vampire-not-a-mosquito-monster/chapter/1145706/18-supervisor",
            "content": "Is the System intelligent? That’s a question many scholars throughout the years have pondered upon. I, for one, believe it is. There are many instances where its intelligence can be seen. The creation of new skills, especially unique ones, updating skill descriptions, and when people level up. In all of these cases, the System needs to do stuff that instinct alone could not allow. No creature can just instinctually create things from nothing but a wish, Djinn notwithstanding.\n\n-An excerpt from ‘Peculiarities of the System’ by Doctor Reed\n\nSupervisor Obtained!\n\nAll around me, everything froze. There were no of the usual sounds you would expect in a barren wasteland. No howling winds, buzzing of my mosquito pal’s wings… not a lot happens here, does it? Either way, everything stopped. I couldn’t even feel my wings beating anymore. Suddenly, a huge pressure descended upon my mind. I felt a mass of anger pushing me aside in my own head. It felt like I was being crushed between an unbreakable wall and a constantly expanding balloon. Until I was just a small speck of dust being squeezed to the limit inside my own head.\n\nHello Mr… Mosquito Overlord, Mosquito of Death, or maybe just Tim, what can I help you with today?\n\nIn an instant the massive pressure upon my mind lifted, replaced with… elevator music? How does anger turn into elevator music!?!?!\n\nI apologize for this, but I am on a schedule, what would seem to be the problem?\n\nOh… Can I get a new Overseer? Mine fucking sucks. She ruined my skill descriptions!\n\nLet me see what happened… Ah I see, Extremely Lovely Lard of Yellow, yes, she can be a problem. I am sorry though, it appears she has not broken any rules or regulations so there is nothing else I can do about that. Did you need anything else?\n\nThe author's narrative has been misappropriated; report any instances of this story on Amazon.\n\nNo?\n\nBefore I go, I must tell you that you’ll get a survey after this, if you opt to take it a reward will be given. Alright, I hope you have a nice day, Mr. Mosquito Overlord, Mosquito of Death, or maybe just Tim.\n\n…What the hell just happened? Did I just meet with a customer service person!?!? WHO THE HELL WAS THAT?!?!\n\nNEW QUEST AVAILABLE!!\n\n5 Minute Survey\n\nSuccess:\n\nTake a short survey about your the help recieved.\n\nFailure:\n\nDo not take survey\n\nReward(s):\n\n3 levels in Like a Rock\n\nAccept Quest(Y/N)?\n\n…Yes? I’ll take a survey.\n\nThank you for agreeing to take a short survey. Please rate your experience on a scale of 1 - 5 Stars in each of the categories.\n\nProblem Solving\n\nCustomer Service\n\nAttitude of Supervisor\n\nUhh… 1 star in problem solving and 5 in the other two?\n\nQuest “5 Minute Survey” completed!\n\nReward(s)\n\n3 levels in Like a Rock\n\nLike a Rock level up. Constitution multiplier is now 1.05x.\n\nLike a Rock level up. Constitution multiplier is now 1.06x.\n\nLike a Rock level up. Constitution multiplier is now 1.07x.\n\nYay…? Wait, seriously, what just happened!?!?! I’M IN A FANTASY WORLD! With gods and magic mosquitoes! WHY DID I JUST TAKE A SURVEY!?!?! THIS IS TOTALLY BROKE MY IMMERSION! WAIT! FUCK! THIS IS REALITY! THERE’S NO IMMERSION TO BREAK!",
            "comments": [
                {
                    "comment_id": "8241182",
                    "username": "3SlicesOfBread",
                    "comment_text": "So Eli also messed up when naming herself/ getting named...\n\nHas her church seriously gone on multiple crusades out of embarrassment, or is there more to it?\n\nCause I can't think of any reason why the other gods would also wanna keep her name a secret unless she blackmailed them or they are ashamed for her as fellow gods.",
                    "time": "2023-03-22T23:33:50.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8243190",
                    "username": "Omegawerewolf",
                    "comment_text": "Lmao.",
                    "time": "2023-03-23T05:14:38.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8891423",
                    "username": "Dude88",
                    "comment_text": "Tftc",
                    "time": "2023-06-09T17:12:15.0000000+00:00",
                    "replies": []
                }
            ]
        },
        {
            "id": "1146675",
            "name": "19. Names",
            "url": "https://www.royalroad.com/fiction/64990/i-wanted-to-be-a-vampire-not-a-mosquito-monster/chapter/1146675/19-names",
            "content": "…What just happened? Really? I am so confused. Alright, let’s break it down. I think my new skill worked, and a supervisor was received… Who was really just some customer service representative, and they said my Overseer was Extre-\n\nNEW QUEST AVAILABLE!!\n\nNever Repeat that Name\n\nSuccess:\n\nNever repeat the name about to be thought about.\n\nFailure:\n\nRepeat THAT name.\n\nReward(s):\n\nPossibly Live for a while\n\nPenalty for Failure (Or not Accepting):\n\nStart of a Holy Crusade\n\nAccept Quest(Y/N)?\n\nMessenger of the Mosquito God activated. Quest accepted.\n\nShe really has something on you, doesn’t she? I thought so before but this all but confirms it!\n\nMessenger of the Mosquito God level up. Charisma multiplier is now 1.07x\n\nMOSQUITO GOD! ANSWER ME! WHAT DOES SHE HAVE!?!?! I’ll find out eventually! And when I do I’ll… hmmm. What would I do? Even if I know I can’t stop you from using that skill… I’LL FIGURE IT OUT LATER! BUT I PROMISE I’LL DO SOMETHING! Hmmm… is it safe to assume the holy crusade is against me?\n\nYes.\n\n…Alright. No repeating Elly’s name! Though I would like to say, it is an EXTREMELY LOVELY NAME! Hehehe. I wonder how gods are named… Mosquito God seems to have been named after my prayers, maybe that’s how? But then who would pray to… to Elly? Whatever, people are weird! Now! Moving on… I should probably check out my new skills… I only got two, right? Oh wait, three. Alright System! What does Aura of Irritableness and Piercing Flight do?\n\nThe tale has been stolen; if detected on Amazon, report the violation.\n\nAura of Irritableness:\nRelease an aura 0.36m (Charisma / 30) around the user that makes people who work at shops more irritable.\n\nPiercing Flight:\n\nGives user knowledge on how to flap their wings in a way that emits a piercing ring that has a chance to intimidate foes with a soul.\n\nI feel like those are way less useful than they originally sounded… That aura is so specific… and I don’t think I’ve seen a shop since I was reborn… Not to mention how I CAN’T BUY ANYTHING ANYWAYS! I CAN’T TALK! I. CAN’T. TALK! I KNEW I SHOULDN’T HAVE TRUSTED ELLY! SHE WAS JUST GETTING A NEW CHANCE TO MAKE FUN OF ME! But I couldn’t just not take it… it was unique…\n\nSpecies Karen Mosquito(Tier 0) rarity updated!\n\nSkill Talk to the Manager rarity updated!\n\nI JUST COMPLIMENTED THE RARITY! AND YOU GO AND DROP IT!?!?! DO YOU NOT LOVE ME!?!? AM I NOT LOVABLE ENOUGH FOR YOU!?!?! WHY DO YOU HAVE TO RUIN THE GOOD THINGS!?!?! Hey System… can I be compensated for this…?\n\nProcessing Request…\n\nAlright, I believe! PLEASE MOSQUITO GOD! HELP ME WITH MY REQUEST!\n\nRequest Denied.\n\n…Alright, that’s fine. I never really wanted it anyways (really). Yup, never, I don’t care in the slightest. Now! I am ready to move on! Like a rock, I have no qualms! So, my mosquito friend! Do you happen to know the way back to the blood pool? I kinda need more cult members. I wanna complete that quest… SO! Where are we going? Mosquito friend? Mosquito friend wasn’t going anywhere… Are you lost too? Fuck. I really hoped you were better with directions… it’s kinda hard to remember which way to go when you get ripped out of your body and then an almighty customer service representative forces its way into your mind. You know? I’m pretty sure most people would be lost after that (I definitely wasn’t lost before it. Not at all!). SO! I think it is fine… Now which way should I go…?\n\nLet’s go sun up! Because you always start the day with the sun going up? I think that makes sense. It’s good luck! Because the mornings are the best part of the day! Yeah that’s a lie. That is definitely a lie. Alright! Sun down! Because at night you finally get to go to bed! And! Off into the distance we go!",
            "comments": [
                {
                    "comment_id": "8252736",
                    "username": "Omegawerewolf",
                    "comment_text": "Damn it. I think I'm the only person to vote imperial lmao.",
                    "time": "2023-03-24T09:50:08.0000000+00:00",
                    "replies": [
                        {
                            "comment_id": "8256041",
                            "username": "321cab",
                            "comment_text": "lmao\n\n1cm=~0.4in\n\n1km=~0.62mi\n\n1m=~1.1yards / 3.2ft",
                            "time": "2023-03-24T19:06:03.0000000+00:00",
                            "replies": [
                                {
                                    "comment_id": "8256525",
                                    "username": "Omegawerewolf",
                                    "comment_text": "It makes sense if you don't compare it do Metric lmao.",
                                    "time": "2023-03-24T20:10:40.0000000+00:00",
                                    "replies": []
                                },
                                {
                                    "comment_id": "8257528",
                                    "username": "lemonleapoard",
                                    "comment_text": "I'll be honest, I grew up on Imperial but I still think metric is easier to use.",
                                    "time": "2023-03-24T22:22:33.0000000+00:00",
                                    "replies": []
                                }
                            ]
                        },
                        {
                            "comment_id": "8256525",
                            "username": "Omegawerewolf",
                            "comment_text": "It makes sense if you don't compare it do Metric lmao.",
                            "time": "2023-03-24T20:10:40.0000000+00:00",
                            "replies": []
                        },
                        {
                            "comment_id": "8257528",
                            "username": "lemonleapoard",
                            "comment_text": "I'll be honest, I grew up on Imperial but I still think metric is easier to use.",
                            "time": "2023-03-24T22:22:33.0000000+00:00",
                            "replies": []
                        }
                    ]
                },
                {
                    "comment_id": "8428017",
                    "username": "CEO of Bread",
                    "comment_text": "Metric is objectively better.",
                    "time": "2023-04-15T14:08:47.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8891888",
                    "username": "Dude88",
                    "comment_text": "Tftc",
                    "time": "2023-06-09T18:02:32.0000000+00:00",
                    "replies": []
                }
            ]
        },
        {
            "id": "1147664",
            "name": "20. Plants",
            "url": "https://www.royalroad.com/fiction/64990/i-wanted-to-be-a-vampire-not-a-mosquito-monster/chapter/1147664/20-plants",
            "content": "Four hours and one night later… WE FOUND IT! Not the blood pool, BUT PLANTS! BONAFIDE RED PLANTS! Alright, the color is a little weird, but PLANTS! Who needs the blood pool? I’VE GOT PLANTS! Bloody red plants, but whatever! And… something here smells really good. It smells delicious in fact, what is it? Mosquito friend? Where are you going?\n\nStatus Hypnosis(Minor) resisted.\n\nWait what? What just happened? MOSQUITO FRIEND? WHERE ARE YOU GOING!?!?! My friend was zooming right by me towards a weird looking plant. It had two massive flaps, connected by a thin line of white between them. On the edges there were hundreds of long, thin strands of plant. It was a grotesque creature, like nothing I’d ever seen before… IT WAS A VENUS FLY TRAP! WAIT! MOSQUITO FRIEND!\n\nMy mosquito friend started to slow down, but it was too late. He flew right into its mouth, and it shut closed in an instant…\n\nSwarm Tactics level up. Constitution multiplier is now 1.07x\n\nQuest: Expand the Cult(0/5)\n\n…My only friend… he… he was my only friend! MOSQUITO FRIIIIEEEEEND! I- I can’t do this! He was the only one I had! I- I NEED HIM BACK! PLEASE MOSQUITO GOD! I’LL DO ANYTHING! JUST BRING MOSQUITO FRIEND BACK! PLEASE! I‘M BEGGING YOU! I HAVE NOTHING ELSE! Even if he couldn’t speak and think… He was still my only friend! I need him back! Please! PLEASE!\n\nI landed on the ground and mentally sobbed the day away, and the next. I no longer wanted to do anything. At all. I stared at the plant that murdered my friend, and came to a conclusion. In a bloody forest, it probably has blood too. So, I started my plot for vengeance! I took my spear, and stabbed that stupid plant! And I sucked its blood! HAHAHAHA! TAKE THAT!\n\nBloodsucker+2 activated. Human(Lv MIXED) blood(old) consumed. + 4 exp. 0.008% progress to human skill.\n\nStatus Poisoned(Minor) resisted.\n\nHuman? Not plant monster!?!?! WHAT IS THIS!?!?! Oh wait… plants don’t have blood… SO I’LL HAVE TO CUT IT DOWN! What cutting materials do I have…? Wait! I remember, didn’t holy flight do something? System! Show me the description of Holy Flight!\n\nLv 5 Holy Flight:\n\nYou might be reading a pirated copy. Look for the official release to support the author.\n\nRequirements -  Fly(Lv5), Pray(Lv 3), Pray skill targeted at a god that can fly\n\nIncreases the amount of thrust generated by wings. Pray skill is 8%(Level of Fly) stronger. Wings are imbued with holy energy and become 6%(Level of Pray) sharper and harder.\n\nAlright that’s fucking useless. What difference does it make if my wings are harder when they start so weak anyways!?!?! Alr-\n\nSuddenly, I felt Messenger of the Mosquito God activate again, and my bloody shield popped up in an instant. Right afterwards, I could feel myself being flung far away into the distance. I was squished up against the side of my shield as I flew at breakneck speeds (Do I have a neck?). My shield splattered against a plant. THAT HURT! WHAT THE HELL WAS THAT!?!? AND SYSTEM, WHAT’S MY HEALTH?\n\nHealth: 50/157\n\nOH HELL NO! I turned around, trying to see what almost caused my untimely demise, and it was something I had not seen in a long time. A human! A bonafide, living human! With a very large sword that definitely did not match the rest of his outfit. He was wearing a robe decorated with images of all kinds of insects battling against each other. They were all over his outfit, the largest of them being a grand praying mantis, in the middle of decapitating a mouse. He locked his eyes on me, and I saw him smirk, as if he was making fun of me for a joke I hadn’t heard. I can’t believe him! He tried to kill me! Right after we met! I didn’t even do anything! And of course, when facing something that was probably 200x bigger than me,  did what everyone else would have done! I used my Piercing Flight and booked it!\n\nI saw the man stumble for a second presumably from that soul piercing sound I can emit. Heh, maybe not completely useless. Except he started chasing me in less than a minute. Because why would my skill be any good!?!?! As he caught up, I reactivated my Protection of blood, except I did something wrong and it started to envelope both of us! But before I could even do anything to stop it, it stopped itself and started raining… I ran out of MANA! I FUCKING RAN OUT OF MANA! I FINALLY USE IT IN A FIGHT AND DON’T EVEN HAVE ENOUGH!\n\nForcefully Converted UNKNOWN NAME Level 20 Human to Cult\n\nQuest: Expand the Cult(1/5)\n\n…We both stopped dead in our tracks, and I could feel the pure rage of this man coursing through our bond. It was way stronger than any feeling I ever got from my mosquito, but not quite as much as the customer service representative…\n\n“WHAT THE HELL DID YOU DO TO ME?!?!?!”\n\n…HE CAN SPEAK TO ME! WAIT! WHAT IS THIS!?!?! Am I… finally not alone?\n\n“ILLINOIS HAS ABANDONED ME YOU STUPID BUG! EXPLAIN YOURSELF!”\n\n“SHUT UP AND LET ME THINK! I CAN FINALLY SPEAK TO SOMEONE!”\n\nOops. That may be a bad first impression…",
            "comments": [
                {
                    "comment_id": "8261220",
                    "username": "Omegawerewolf",
                    "comment_text": "PFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFFF LMAO TFTC",
                    "time": "2023-03-25T11:20:31.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8891931",
                    "username": "Dude88",
                    "comment_text": "Tftc",
                    "time": "2023-06-09T18:09:17.0000000+00:00",
                    "replies": []
                }
            ]
        },
        {
            "id": "1150387",
            "name": "Interlude: Elly’s Domain",
            "url": "https://www.royalroad.com/fiction/64990/i-wanted-to-be-a-vampire-not-a-mosquito-monster/chapter/1150387/interlude-ellys-domain",
            "content": "There are many arguments on who the strongest god is, and if gods even are the strongest beings. Some people argue that their strength is based on their followers, as it is well known that praying to gods can empower them, while others argue it depends upon their title, as some titles hold much more weight than others. I think it is a bit of both. Take the Goddess of the Sun as an example. She has a very small following, but whenever she starts a holy crusade, all the other gods turn the other way. The sun is what gave life to all without mana, and is therefore very important to both history and the present.\n\n—Sir Elias the Second, Head of the Church of Illinois\n\n“PFFFFFT, YOU LOST HIM TO A BUG! HAHAHAHA!” Elly cackled at Illinois, watching the projection in front of them. She was absolutely thrilled at what was happening. It showed a mosquito flying next to a man in a full robe, which was losing its images by the second. Both parties were utterly drenched in blood, and the man was positively fuming.\n\nNext to Elly sat a mantis, Illinois, enraptured in the projection. Illinois appeared just as mad as the man on the screen, except he actually had smoke wafting off of him, he truly understood the meaning of fuming.\n\nLove what you're reading? Discover and support the author on the platform they originally published on.\n\n“Elly! Enough of this nonsense! That stupid bug is going to cause all of us problems and you know it! It always causes waves when reincarnators make gods, and never good ones!”\n“Oh you worry too much, I’ve got it handled. Just enjoy the show! This mosquito is about to do something good, I can tell!”\n\n“ELLY! DON’T YOU REMEMBER WHAT HAPPENED LAST TIME A GOD WAS MADE!?! WE WERE AT WAR FOR DECADES!”\n\n“I said I have it handled, understand?” The projection disappeared, and it was replaced with a new image. It was a great storm wafting across lands, changing everything in its path into pure gold. People, animals, plants, buildings, nothing was spared.\n\n“Al-alright! I understand! You’ve got it handled.” Illinois stopped fuming and seemed to turn blue as he stopped pushing. “I just hope you don’t make the same mistake as last time.” On that note, Illinois disappeared from sight, presumably off to gather some support.\n\n“I swear, you cause no disasters for a few centuries and they all forget why they listen to you. Kids.\" Elly turned the projection back on to what it was originally and sat down to have a look at it. But the screen was empty, no mosquito or person to be found.\n\n“Ugh, now I have to find them again, I swear, Illinois is such a baby.”",
            "comments": [
                {
                    "comment_id": "8892013",
                    "username": "Dude88",
                    "comment_text": "Tftc",
                    "time": "2023-06-09T18:17:54.0000000+00:00",
                    "replies": []
                }
            ]
        },
        {
            "id": "1151286",
            "name": "21. Mr. Newest Cult Member",
            "url": "https://www.royalroad.com/fiction/64990/i-wanted-to-be-a-vampire-not-a-mosquito-monster/chapter/1151286/21-mr-newest-cult-member",
            "content": "So… I met a person, finally, and they tried to kill me… And then better yet, I forcefully converted them into a cult, even though it sounds like they had some relation with Illinois. And my mosquito friend died. Yup everything’s looking up, everything's just wonderful!!\n\n“I’m going to kill you. Once I’m free from whatever you did, I’m going to kill you!”\n\nYup, everything's going great! You know what, I know what I need to do!\n\n“Hello Mr. Newest Cult Member, my name is Tim, who are you?”\n“I. Am. GOING. TO. KILL YOU!”\n\n“Sheesh, what is wrong with you!?!? Do you not know how to say anything else!?!?”\n\n“I’m going to murder you.”\n\n“Alright, something else, that's good. So, anything else to say?”\n\n“After I kill you I’ll murder your god too.”\n\n“HEY! RESPECT YOUR GOD!”\n\nAt that statement, I could feel Mr. Newest cult Member squirming, clearly struggling with something inside of him.\n\nHe started speaking (Is it speaking if it’s in your mind?) again, this time I could feel him actively resisting his own words though, weird. “Of course I respect… What’s their name?”\n\nStolen from its original source, this story is not meant to be on Amazon; report any sightings.\n\n“Ah yes, have you finally come to respect the almighty Mosquito God, who helped me triumph over you and the flimsy Illinois?”\n\n“Yes. I- I- I have the utmost respect for the almighty Mosquito God.”\n\nAt those words, Mr. New Cult member passed out sweating profusely. I stared at him for a solid thirty seconds, before deciding it was time to sleep too.\n\nAnd I woke up alone… WITHOUT MY CULT MEMBER! HE WAS FUCKING GONE! I searched around desperately, hoping for some sign of where he went, but the only thing there was the aftermath from yesterday's… battle. Yup, battle. It was a mighty battle. Where every participant's life was on the line.\n\nWAIT! HE DIDN’T DIE? DID HE!?!?! SYSTEM! HOW ARE MY QUESTS?\n\nQuest: Expand the Cult(1/5)\n\nQuest: Never Repeat that Name\n\nAlright, good, still alive. But why would he run…? What am I kidding? He seemed furious at me… but not attacking? Hmmm… maybe… I never tried this before. System, what does Head Cultist of the Mosquito God do?\nHead Cultist of the Mosquito God:\n\nThe leader of the entire Cult of the Mosquito God. Has absolute power over other cult members, as long as the Mosquito God wills it. This class can only be removed by death or the Mosquito God personally removing it.\n\nOh. Oh no… I definitely mind controlled my new member a little, didn’t I? Ahem. Well, it was an accident! I’m sure he’ll understand! Yes! I just need to see him and we can sort everything else. But where could he have gone…?\n\nMaybe he went back wherever he came from? I think he yelled something about Illinois abandoning him. Oh, he was definitely here to kill me, wasn’t he? Is Illinois still mad at me for Mosquito God taking some of his jurisdiction? I feel like sending a person after me is way too much! I am a mosquito for god’s sake! A MOSQUITO! I LITERALLY CAN’T DO ANYTHING BUT FLY AROUND AND SUCK SOME PEOPLE'S BLOOD! Oh, and apparently forcefully convert people into followers, but that’s it! Oh, and survive a strike from a giant sword… But that’s it? That is it, right? Oh, I can make mosquito eggs birth disaster mosquitoes. BUT OTHER THAN THAT! I am nothing but a normal, harmless mosquito… I’m definitely a problem.",
            "comments": [
                {
                    "comment_id": "8288138",
                    "username": "Omegawerewolf",
                    "comment_text": "TFTC, also is it REALLY mind control if they say they LIKE the mind control? (while under mind control but that's not the point.)",
                    "time": "2023-03-29T01:24:47.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8892176",
                    "username": "Dude88",
                    "comment_text": "Tftc",
                    "time": "2023-06-09T18:35:19.0000000+00:00",
                    "replies": []
                }
            ]
        },
        {
            "id": "1152373",
            "name": "22. Travel?",
            "url": "https://www.royalroad.com/fiction/64990/i-wanted-to-be-a-vampire-not-a-mosquito-monster/chapter/1152373/22-travel",
            "content": "Putting my matter aside… I think I know how to find him! We’ve got that mental link from him totally willfully joining the cult! I bet I can use it to feel him out! Alright! Here goes nothing! I can definitely feel it… It feels like a small strand of thought that’s been anchored int my brain. Maybe if I touch it (Touch feels like a weird word since it’s just in my head.)… OW! OW! OW! OW!\n\nWhat the hell was that!?!?! Touching it felt like when you touch a lightswitch that isn’t properly insulated. But about 5x worse. I’ll admit, not that bad, but still. Sheesh, that was weird. Alright! Next option! If I can’t touch it, maybe I can follow it? Alright, so it goes… in? Wait no, out. No, it… I can definitely tell where it goes. But, I’m ninety percent certain the direction doesn’t exist. It’s like when a 2d object moves in a third dimension, from its perspective, everything it can see changes for every miniscule movement it makes. IT MAKES NO SENSE! Though… I do think I can go that direction… I mean, worth a shot.\n\nSo, I tried to move… in but out..? And everything BROKE. I MEAN IT BROKE! I was sent spiraling through space that really just did not exist. I felt like I could see every part of me at once. From my wings, to my blood sac down to my very molecules themselves. Then I could see… my soul? The very essence of my being. It was red. Blood red, and in constant turmoil, I could see it decaying at an actually visible pace, and it was worrying.\n\nThen, I could see his. My cult member. His soul was the same color as my own, but it was quickly being tainted a vibrant green. Then next came his molecules, then his organs, until finally I saw him, and landed right in front of his face only to be immediately slammed into as he just kept on going with whatever he was doing before.\n\nSkill Space? obtained.\n\n“...Hello my cult member! How are you?”\n\nAt that, he stopped dead in his tracks and turned around. He stared at me incredulously for a solid ten seconds, and then he just stopped looking at me and moved on.\n\n“HEY! You can’t just ignore me!” I shouted at him through our beautiful space breaking mental link. Which he also ignored… “I WILL SUCK YOUR BLOOD IF YOU DON’T LISTEN TO ME…! Alright, here I come!”\n\nI flew closer to him, intent on sucking a little bit of blood from him, it’s not like he needed it all anyways, and he dodged! He freaking dodged! As I neared him, he suddenly jerked forward, keeping me away.\n\n“Hey! Don’t do that! Stop right there and let me suck your blood!”\n\nAt those words, I could see him start to slow down, not stop mind you, but whatever. Close enough. I went to suck his blood again, of course. And he jerked forward as I neared! He dodged again! I swear, people! He just doesn’t listen!\n\nSupport the author by searching for the original publication of this novel.\n\n“I SAID! Stop and let me suck your blood!”\n\nThis time he stopped. Heh, can’t ignore me forever. So! I flew right up on his face, and I speared him! And, honestly, he tasted sooo much better than everyone that stupid pool. Not that he tasted good… I would never say that human blood tastes good. Of course. Because it doesn’t. It’s just that he tasted better.\n\nBloodsucker+2 activated. Human(Lv 20) blood(fresh) consumed. + 10 exp. 0.01% progress to human skill.\n\nLevel up!\n\n+5 attribute points\n\nWait a second… System! Show me my status!\n\nName: Mosquito Overlord, Mosquito of Death, or maybe just Tim\n\nGender: Male\n\nLevel: 1/5\n\nExperience: 9/10\n\nAge: 7 days\n\nExpected Lifespan: 7 days\n\nRace: Karen Mosquito(Tier 0)\n\nStats:\n\nHealth: 157/ 157\n\nMana: 73/73\n\nStrength: 10.01\n\nAgility: 10.0675\n\nDexterity: 10.71\n\nIntelligence: 120\n\nConstitution: 10.71\n\nCharisma: 10.8\n\nSkills(+)\n\nClass Skills(+)\n\nTraits(+)\n\nOh cool, they shortened it. Thanks Elly, it was getting kinda long.\n\nNo prob, 👍\n\nOh no… SHE FIGURED OUT ACTUAL EMOJIS! WHO TOLD HER!?!?! Whatever, doesn’t matter! Like a rock! Yes! Like a rock! What was I doing? Oh yeah! Finally, it has happened! I can get full credit for my stat points! HAHAHAH! Now, for the moment of truth. System! I want to level up!\n\nPlease select stats to put points into. (5 Available)\n\nStrength: 10\n\nAgility: 10\n\nDexterity: 10\n\nIntelligence: 100\n\nConstitution: 10\n\nCharisma: 10\n\nAnd now! As we’ve been doing, put them all in agility!\n\nProcessing Request…\n\nAgility: 15\n\nHahaha! HAHAHAHAHA! FINALLY! YOU CAN NO LONGER SKIMP MY STAT POINTS OFF OF ME! I CAN FINALLY BECOME OP! MWAHAHAHAHA! So of course, with my new found agility, I did the most important thing ever. I finally had enough speed for it. I DID A FLIP! A FLIP! MWAHAHAHAHA! NOBODY CAN STOP ME NOW! I CAN BECOME THE BEST PART OF ANY SHOW! THE ONE THAT DOES THE TRICKS! Those elephants that do tricks have nothing on me! What’s a giant elephant when you compare it to a graceful mosquito? Nothing! That’s what!\n\nAnd now, back to the important stuff. Not that it’s really that much more important than doing a flip but whatever. Ever since I finally got him to stop, Mr. Cult Member has just been standing there.\n\n“So! I think you forgot about me when you got up this morning, not that I blame you, but you really shouldn’t be like that. You can’t just run off! Got it…? Hellooooo? Did you forget how to speak to me? C’mon?”\n\nAt that statement, I see what looks like grim determination in my cult member’s eyes. And the- OW OW OW! WHAT THE HELL WAS THAT!?!?! IT felt like something got ripped from my mind. It was like when someone pulls off a scab, except the scab was actually a piece of flesh!\n\nQuest: Expand the Cult(0/5)\n\nWait what?",
            "comments": [
                {
                    "comment_id": "8297722",
                    "username": "Omegawerewolf",
                    "comment_text": "TFTC",
                    "time": "2023-03-30T07:01:48.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8892237",
                    "username": "Dude88",
                    "comment_text": "Tftc",
                    "time": "2023-06-09T18:42:35.0000000+00:00",
                    "replies": []
                }
            ]
        },
        {
            "id": "1153144",
            "name": "23. Bloodsucker+2",
            "url": "https://www.royalroad.com/fiction/64990/i-wanted-to-be-a-vampire-not-a-mosquito-monster/chapter/1153144/23-bloodsucker2",
            "content": "Alright! It’s fine! I just need to convert him again! Right!?!? Alright, I got this! Mr. New- Soon to be a new cult member rushed me with his sword! I tried to dodge to the side as he ran up, but he swung it like a bat! A bat! A SWORD IS NOT A BAT! Though it was effective…\n\nI was hit through the air at probably my new top speed, straight into the air. I flew up through the trees, until I hit a branch. And was squished. Completely and utterly squished. It all happened in an instant. I was whole, and then a pile of bug guts. There was a searing pain all over, as I felt my life winking out of existence. It… it was a good week. At least I got a chance at another life…\n\nBloodsucker+2 activated. -14xp, health healed to full.\n\nLevel -1. Attributes reduced by 10% until level restored.\n\nI could feel my body knit itself back together, sapping out the very essence of my being. As my eyes reformed, I saw Mr. Soon to be Cult Member walking away, very clearly thinking I was dead. So! I did the smart thing for once, and just sat there, waiting for him to disappear. As he walked away in silence, carrying his sword, I had a realization. What the hell did Bloodsucker just do? Hey System, can I see bloodsucker’s description?\n\nBloodsucker+2):\n\nGain experience from consuming the blood of creatures, and when enough blood of a single species has been consumed, gain a random skill from their species. Each subsequent skill gained from the species requires more blood.\n\nThe tale has been illicitly lifted; should you spot it on Amazon, report the violation.\n\n+1 Can store 10x more blood. Blood is digested 30x faster.\n\n+2 Consumed blood can be used to restore self upon taking damage, at the cost of experience.\n\nWait! When did it become +2? Huh? I don’t remember that! But that is awesome! I am immortal now!. Wait… Oh no! System! What’s my life expectancy?\n\nLife Expectancy: 7 days\n\nOh nevermind, I’m fine. I’ve got plenty of time. I just need four… Nope, I leveled down, make that 5 levels. That’s really easy though. I did that just fine before! Alright! I am on easy mode! As long as I don't get squashed again. I don’t really have any more experience I can convert to health… That’s fine! I can just drink more plants! Heh, living around a ton of blood may not be as bad as it seemed. As long as I have food, I am immortal! MWAHAHAHAHAH! Now! To restore my stock of food! Alright, there’s a… venus flytrap over there I can eat. A FUCKING FLY TRAP! I hope they all die! Wait, calm down, like a rock… LIKE A ROCK! I can get past this, I’m not racist. Just because one flytrap killed my friend… my only Friend. Doesn’t Mean They’re Bad! Nope I can’t do this. I will admit it! I want to exterminate those stupid plants! They deserve death in all of its forms! I WILL BURN THEM ALL TO THE GROUND WITH A FIRE HOTTER THAN THE MOON. OH ALMIGHTY MOSQUITO GOD, PLEASE HELP ME WITH THIS WISH OF MINE! I WILL PRAY TO YOU EVERY NIGHT UNTIL MY GOAL IS COMPLETE, JUST HELP ME OUT HERE!\n\nHead Cultist of The Mosquito God level up. All stats +2.\n\nYES! THAT IS PERMISSION WE SHALL BURN THE VENUS FLYTRAPS TO THE GROUND!",
            "comments": [
                {
                    "comment_id": "8304494",
                    "username": "Kermit_the_Frog",
                    "comment_text": "Hey, just found this story, enjoying the ride so far. Keep it up! 🐸",
                    "time": "2023-03-31T02:20:58.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8892272",
                    "username": "Dude88",
                    "comment_text": "Tftc",
                    "time": "2023-06-09T18:48:14.0000000+00:00",
                    "replies": []
                }
            ]
        },
        {
            "id": "1154128",
            "name": "24. Forest?",
            "url": "https://www.royalroad.com/fiction/64990/i-wanted-to-be-a-vampire-not-a-mosquito-monster/chapter/1154128/24-forest",
            "content": "Alright, how do I burn a venus flytrap with what I have…? Perhaps my new skill? System? What does Space do?\nSpace?:\n\nTravel through dimensions by following paths connected to the user. (Skill does not allow creation of paths).\n\nOh come on! You bring my hopes up by promising dimensional travel, but then crush them into a paste! What kind of skill lets you travel through dimensions, but only if the paths are already open? That makes no sense! This is so unfair! This is like if a spear skill only worked if you had a spear… Wait, no… uhhh. YES! A MAGIC SKILL ONLY WORKING IF YOU HAD MANA! No wait, that’s not it! I’ll figure it out! Just give me a bit! I can do it eventually. More importantly! To kill those flytraps!\n\nYes! They must be perished, it was practically a holy mission. They killed our first cult member, a crime that cannot go unpunished!\n\nSO! OPTIONS! Hmmmm… Drinking them did not work before… Can I even set things on fire with what I have? Alright! We will shelf this until we get more cultists with arms! First thing’s first though. TIME TO DRINK! At least I can get them back a little…\n\nBloodsucker+2 activated. Human(Lv MIXED) blood(old) consumed. + 4 exp. 0.01% progress to human skill.\n\nBloodsucker+2 activated. Human(Lv MIXED) blood(old) consumed. + 4 exp. 0.012% progress to human skill.\n\nLevel up! Attributes restored!\n\nBloodsucker+2 activated. Human(Lv MIXED) blood(old) consumed. + 4 exp. 0.014% progress to human skill.\n\nAlright! Well, I should probably get some cult members and finally finish my quest. I’d rather not have the threat of Illinois having my soul keep hanging over my head. But where can I find more members?\n\nLooking around, there was honestly a surprising lack of animals for a forest. I think I could see some kind of bird flying through the air every now and then, but I think I’d rather not mess with them… Birds are terrifying. Unless… can I convert their eggs? Hmmm… I mean, I don’t see why not. TIME TO FIND A BIRD NEST!\n\nThis book was originally published on Royal Road. Check it out there for the real experience.\n\nI flew up to the trees, searching for a bird nest? Wait? Would they be made of sticks? This place seems a bit weird. Now that I’m looking around, it makes no sense at all! The trees look like they’re just regular old oak or something (Except they’re red). But on the ground, there were tropical plants. I mean, those plants with huge leaves and some venus flytraps. How does that work? Whoever made this forest definitely messed up.\n\nWho puts such different types of plants together!?!?! I’m no… botanist? Are they just for flowers or plants in general? I think plants in general. Either way! I’m no plant biologist, but I think there’s a reason different plants grow in different places. Don’t they have different growing requirements?\n\nFantasy worlds make no sense.They can’t even grow plants right! Wait! No! Don’t get distracted! I was looking for bird nests! So! Let’s just assume they make their nests out of wood. If they don’t I’m never gonna find them anyways. Alright, what’s up here? I flew around for a bit, finding no signs of any nests. As I flew, looking around I not-\n\nI’M TRAPPED! HELP! I was struggling around trying to figure out what got me. I couldn’t see anything at all to keep me here. Nothing was holding me! Then all of a sudden, I started shaking. I upped my struggling even more. But it was futile. Nothing could get me out of my predicament. I was dead again, not a few hours after my second cultist decided to try and kill me.\n\nAs the shaking increased, I saw it. The cause of my certain doom. There were thousands of eyes all around me, slowly inching closer as they realized I was trapped. Attached to those eyes were hairy bodies that had eight dastardly legs coming out. THEY WERE SPIDERS! NOT SPIDERS! OH MY GOD! THEY ARE SO MUCH MORE TERRIFYING UP CLOSE AND GIANT!\n\nI increased my struggling as much as I could, but it was to no avail, I wasn’t getting out. Ideas! Ideas! There’s gotta be something else I can do! This can’t be how I go out! Not to spiders! With their hairy legs and soulless eyes, staring me down as they inject their poison into me.\n\nWAIT! I’VE GOT IT! I activated Protection of Blood, making it spread out all around me, then let it fall, praying this would work.\n\nForcefully Converted Spider*216 to Cult\n\nQuest “Expand the Cult” Completed\n\nReward(s):\n\n1 level in Head Cultist of the Mosquito God job.\n\nHead Cultist of The Mosquito God level up. All stats +2.\n\nHead Cultist of The Mosquito God level up. All stats +2.\n\nHead Cultist of The Mosquito God level up. All stats +2.\n\nHaaa!",
            "comments": [
                {
                    "comment_id": "8317661",
                    "username": "Vibipi",
                    "comment_text": "",
                    "time": "2023-04-01T18:53:17.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8892673",
                    "username": "Dude88",
                    "comment_text": "Tftc",
                    "time": "2023-06-09T19:34:44.0000000+00:00",
                    "replies": []
                }
            ]
        },
        {
            "id": "1157430",
            "name": "25. Spider Cultists",
            "url": "https://www.royalroad.com/fiction/64990/i-wanted-to-be-a-vampire-not-a-mosquito-monster/chapter/1157430/25-spider-cultists",
            "content": "Mosquito God 0.51% to birth.\n\nSo… spiders are absolutely terrifying. Especially when they are bigger than you are… GOD! I HATE THIS! SPIDERS! LET ME OUT OF HERE!\n\nAt that, the spiders resumed their advance towards me. Slowly getting closer, hopefully not to murder me. As they reached me, they started eating the air around me. When they finished, I gracefully plopped to the ground. Yes, graceful as a potato being launched out of a cannon. Mhmm. The literal perfect picture of grace.\n\nWell then, on the ground I wiggled a little, getting the last of what I assume was threads that were binding me off, and flew up to my… newest cultists.\n\nThere were hundreds of spiders just sitting on the webs, 216 to be exact. And they were just sitting there silently, staring at me. I could feel the bonds I held with each of the individual spiders, and they all shared the same desire. They were hungry, starving. There wasn’t enough food for them here, and eventually they would start turning on each other.\n\nSo, I guess I have two options. Leave these horrifying monstrosities to defend for themselves and hope everything goes well, or try to feed them. You know what? That first option seems mighty appetizing. Yes, survival of the fittest and all that, I think they’ll be fine. So! Off into the unknown!\n\nSkill Messenger of the Mosquito God Provides a new quest!!!\n\nProtect the Cult\n\nSuccess:\n\nKeep the Cult of The Mosquito God alive for at least 20 days.\n\nFailure:\n\nThe Cult of The Mosquito God shrinks to less than 5 members within 20 days.\n\nIf you come across this story on Amazon, it's taken without permission from the author. Report it.\n\nPenalty for failure:\n\nSoul will be given to the higher being with the most grudges against you.\n\nCurrent Target: Illinois, God of Insects(+)\n\nAccept Quest(Y/N)\n\nYOU’RE NOT EVEN OFFERING REWARDS THIS TIME! WHAT IS THIS? At least last time you promised a carrot with the stick! Now it’s just a stick! That is not how you are supposed to get people to do things!\n\nMessenger of the Mosquito God activated. Quest accepted.\n\nAnd of course no choice. You’re getting worse, Mosquito God, you know that? I bet it’s Elly’s influence, isn’t it? You know, you should probably distance yourself from her a bit, if this is what she’s teaching you. Try another god, one more charming! Like… Illi- nope nevermind. I guess Elly works for now. I’ll find you a better option eventually, though. Just you wait! I will find you a good mentor!\n\nNow then… how to feed 200 spiders? That, my friends, is a conundrum. Is there even a way to feed 200 spiders in this place? I think I’m the only bug around, and there isn’t much else.\n\nAlright spiders! What do you normally eat? At my question, my head was swarmed with pictures of… other spiders. Alright, yikes, this is gonna be a problem. Cannibalistic spiders, that’s great. Especially when I need them to stay alive. Ugh. Do you guys eat anything else?\n\nAt that, I only get images from a few of them. There are some images of various bugs that climb around on the trees. Alright, that’s a start! Let’s check on that!\n\nAt that thought, I flew a little higher up into the trees, and was met with a sight I never expected to see. There were some bugs on the branches higher up, and the higher I went, the more there were. A few branches above the spiders, they were sparse, just a bug here and there. A few branches above that, there were definitely more, I could see bugs every inch or so, way more than there should be on a tree. Then, as I flew up, it got worse. There were bugs everywhere. There was not an inch of free bench space on the tree, I can’t believe I didn’t see it earlier. All over were various kinds of bugs, beetles, worms, caterpillars, all fighting each other for food. There were beetles swarming over caterpillars and worms, ripping them apart as fast as they could. While the worms and caterpillars did their best to defend and eat the leaves.\n\nAnd some of them were doing oddly well. A few caterpillars were surrounded in bodies of beetles, instead of living ones. Looking closely, it appeared that whenever they touched those caterpillars, the beetles just dropped dead, no warning. It was war down there. And it looked like the perfect place to feed my new cult. Because what is better than a pile of dead bugs to feed all of those spiders? The answer? Pretty sure it’s nothing.",
            "comments": [
                {
                    "comment_id": "8336107",
                    "username": "RagTagSpy",
                    "comment_text": "How da hell the spiders not look up",
                    "time": "2023-04-04T05:38:54.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8892722",
                    "username": "Dude88",
                    "comment_text": "Tftc",
                    "time": "2023-06-09T19:40:06.0000000+00:00",
                    "replies": []
                }
            ]
        },
        {
            "id": "1158548",
            "name": "26. Hunting Methods",
            "url": "https://www.royalroad.com/fiction/64990/i-wanted-to-be-a-vampire-not-a-mosquito-monster/chapter/1158548/26-hunting-methods",
            "content": "Of the adventurers that live past their first week of monster encounters, the highest cause of death among them is people. When fighting criminals, most of you are going to freeze up. Fighting an intelligent person isn’t the same as fighting monsters. People just can’t handle going for the killing blows, especially when fighting people that are being controlled, such as some cultists. SOo,you need to decide before you take on a quest hunting people if you are ready to kill them. As once you start fighting, it’s either you or them.\n\n-The Bloody Axe, Day 15 of Adventurer Training\n\nI flew back down to the siders, ready to deliver my commands upon them, but they were gone. Nowhere to be seen! They disappeared! I flew around a little, searching for them. And I got caught again. I swear, these threads are actually invisible, I can’t see them! But, lo and behold! The spider cultists reappeared and let me out. At least they’re learning. Alright! Spiders! I have found food! It is time for us to climb!\n\nAt that statement, I felt massive resistance from every single spider there. Not a single one seemed like they were willing to climb higher, being afraid of something. Alright, c’mon what’s wrong with you stupid spiders? There’s food right above you! We just need to go get it! At that statement, the spiders started sending me new images. And they were not pretty.\n\nIt was a scene of hundreds of thousands of insects crawling all over a massive spider that spanned the length of the tree. They were biting and tearing it, opening tiny wounds they would then manage to crawl into. And then the spider collapsed, consumed by the hoard of ravenous insects.\n\nAh, I see. You know what? Maybe we can find another source of food. Yeah, let’s leave those bugs alone, they seem like good people, wouldn’t want to harm them for no reason. It wouldn’t make sense. Mhmm. So, where else can I get unlimited food for spiders? I wonder…\n\nThis story has been taken without authorization. Report any sightings.\n\nSpiders? Can you make spiders strong enough to catch… birds? At that question, I saw some ardent refusal. Gah, birds and their stupid spider eating abilities. I’ll get them eventually. Alright! Wait! Do I even need to feed the spiders…? I mean, I could just convert some insects instead… Hmmm… Yeah no. I can’t abandon these guys, can I? I mean, as terrifying as they are, if you look past their hairiness and way too many legs, their eyes are kinda cute. Kinda like puppy dog eyes. Yeah, let’s go with that. They’re cute! And you can’t just abandon cute things, it’s a crime against nature. Against the very forces of the universe itself!\n\nAlright, I’m going about this wrong, this is a fantasy world! I bet the fantasy spiders are weird too! So! Spiders! How would you normally get food? At that I was sent two very different images, each coming from a different half of the group. One half just showed normal spider things. Making webs and waiting for the insects to be caught in them.\n\nAnd the other half showed- WHAT THE HELL IS THAT!?!?!?! OH GOD THAT IS NOT RIGHT! I THOUGHT THESE WERE SPIDERS! DIDN’T THE SYSTEM SAY I CONVERTED SPIDERS?\n\nSystem notifications may be changed within the bounds of the user's perception.\n\nWhat? I have literally no idea what that means. But anyways. The other half. It started off weird, as I expected with them being fantasy spiders and all. So, it started with them swarming a boar, climbing all over it. The boar, of course, tried to get them off, shaking. And then they… Okay, so that place where the webs normally come out of a spider. It opened up, I mean, like opened up from three sections, each with pointy rows of teeth. And then they reformed into a stinger. A scorpion stinger. And they all stung the boar, all at once. The boar went from thrashing about to dissolving right at that instant. It went from a thriving boar to a puddle of goo within an instant. And the spiders just lapped up the mess.",
            "comments": [
                {
                    "comment_id": "8346821",
                    "username": "Vibipi",
                    "comment_text": "",
                    "time": "2023-04-05T13:37:08.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8411997",
                    "username": "SteakLord",
                    "comment_text": "thanks for the chapter",
                    "time": "2023-04-13T17:02:17.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8892769",
                    "username": "Dude88",
                    "comment_text": "Tftc",
                    "time": "2023-06-09T19:45:32.0000000+00:00",
                    "replies": []
                }
            ]
        },
        {
            "id": "1159922",
            "name": "27. Rocky Rock",
            "url": "https://www.royalroad.com/fiction/64990/i-wanted-to-be-a-vampire-not-a-mosquito-monster/chapter/1159922/27-rocky-rock",
            "content": "Alright. So. Scary, sorry, cute, spiders can hunt. Then why don’t they hunt? SPiders? Why don’t you hunt? At that question, I finally got no answer. Great. They didn’t think to hunt. Seriously, I can’t believe their first thought when they are hungry is cannibalism. Alright spiders! Let’s go hunt! Time to find some food! I started flying off into the distance, but they didn’t follow. Spiders? Instead of following, the spiders decided to expand their webs. Spiders? I said it’s time to hunt!\n\nSpiders? SPIDERS! C’MON! SPIDERS! LET’S GO HUNT! Aright, alright. This is not working. No matter what I say, they won’t stop expanding that stupid web. Ugh. It’s fine! I’ll calm down. Like a rock. Be a rock.\n\nLike a Rock level up. Constitution multiplier is now 3.24x.\n\nPlease choose level 5 specialization for Like a Rock.\n\nWait what!?!?! Why is my multiplier so high!?!? What happened here? System!?!? Can I have some help?\nProcessing request…\n\nRequest Granted!\n\nConstitution multiplier breakdown:\n\nBase: 1\n\nLike a Rock: 0.04\n\nSwarm Tactics: 2.17\n\nBloodsucker(+2): 0.03\n\nWait a minute… Are my cultists part of my swarm? Hahaha. HAHAHAHAHA! I AM INVINCIBLE! I thought Bloodsucker made me invincible, but with this. I am truly invincible. I’ve probably got so much health nobody can believe it. System, how much health do I have?\n\nHealth: 494/494\n\nOh yeah! Even if I die, I’ll come back with so much health you won’t be able to do anything! Two lives! Oh wait. More importantly! I have a specialization to choose! System! Let me see my options!\n\nLike a Rock(Lv5):\n\nThis narrative has been unlawfully taken from Royal Road. If you see it on Amazon, please report it.\n\nRocky Thinker:\n\nRequirements - Like a Rock(Lv5)\n\nThink like a rock.\n\nRocky Patience:\n\nRequirements - Like a Rock(Lv5)\n\nWait like a rock.\n\nRocky Acting:\n\nRequirements - Like a Rock(Lv5)\n\nPlay dead like a rock.\n\n…What the hell is that? Seriously? This makes no sense. Then again… so does the skill. Alright. So what do I want? Thinking like a rock sounds like a bad idea. I don’t know what that does but I think I’d rather not have to worry about my brain turning off. Rocky patience could be good. I’d say rocks are pretty patient, and patience doesn’t hurt anyone. Or I could play dead. Playing dead seems pretty good, right? Rocks aren’t alive so I’d imagine they can play dead pretty well. Alright! Let’s learn to play dead, in case Mr. Ex Cultist comes back. I’d rather he thinks I’m dead. Alright System, give me Rocky Acting!\n\nSpecialization Rocky Acting chosen.\n\nWoah. I just got some really weird information in my head. I think I can… turn my skin into stone? Can I be a statue? Wait, this is so cool. I gotta try this. So, I followed the instructions implanted in my head by this new specialization. I released some magic around the edges of my legs, wings, and abdomen before hardening it to be like stone. And then I… stood there? Wow, I’m… a rock. This… is actually kinda boring. Alright, how do I turn this off?\n\nWait seriously, how do I turn this off!?!?! IT DIDN’T COME WITH INSTRUCTIONS TO TURN IT OFF!?!?! Uhhh. Calm down! Like a rock! Wait no! Not like a rock! I DON’T WANT TO BE A ROCK ANYMORE! SOMEONE HELP ME! SPIDERS! PLEASE! I’M STUCK! GET ME OUT OF HERE! PLEASE! THIS ISN'T FAIR! I WANT TO BE FREE! LET ME MOVE! I DON’T WANT TO BE A ROCK ANYMORE! I’m… free? Huh? What just happened?\n\nIt just turned off. I don't think I did anything… Doesn’t matter! I am never using that skill again. Ugh. That is honestly terrifying. I don’t like being a rock. Moving is nice. Yeah, I should get a new calming method… What can I use instead of like a rock? Like a tree? Yeah! Let’s try that. Trees are at least alive. They are way better than rocks. I will be like a tree from now on! Nothing but a bad storm or a saw will bring me down! Like a tree!\n\nSkill Like a Tree obtained.\n\n…Alright system, I’ll hear you out. What does Like a Tree do?\n\nLike a Tree:\n\nTake on the properties of a tree.\n\nAlright. I give up.",
            "comments": [
                {
                    "comment_id": "8352319",
                    "username": "Quinn Voidheart",
                    "comment_text": "hahah funny thanks for the chapter!",
                    "time": "2023-04-06T02:50:18.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8352344",
                    "username": "Cantwrite",
                    "comment_text": "Should get into the mindset of everything for the easy skill. Like a Rock improves constitution, so Tree and other objects and creatures likely provide similar benefits. This could add/multiple quickly with enough skills.",
                    "time": "2023-04-06T02:53:33.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8515501",
                    "username": "Ubermacht",
                    "comment_text": "After he becomes “one with wind” or something the skills can combine and be “one with nature”",
                    "time": "2023-04-26T13:47:31.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8892806",
                    "username": "Dude88",
                    "comment_text": "Tftc",
                    "time": "2023-06-09T19:50:25.0000000+00:00",
                    "replies": []
                }
            ]
        },
        {
            "id": "1160939",
            "name": "28. Boar Hunting",
            "url": "https://www.royalroad.com/fiction/64990/i-wanted-to-be-a-vampire-not-a-mosquito-monster/chapter/1160939/28-boar-hunting",
            "content": "Alright, so. I should probably get back on task. We need food. And the spiders will not come. So, what if I bring the meal to the spiders? Yeah, that makes sense. Alright, let’s go boar hunting! No, wait. Boar herding. Because I am definitely not killing any boars. Wait. I gotta be honest. Even if I find any boars, how am I going to bring them back here with taunting? I don’t think a boar is going to just follow a mosquito because it bit them. I guess I could try screeching at it. Yeah, screeching seems like a good idea. Alright. Problem one solved. Now for the more serious problem number two. How to find my way back?\n\nNot that I am bad with directions, I just struggle to remember where I’ve been. Yes, it’s a memory problem, no problem with directions.\n\nHmmm… Hmmmm… Let’s see, what do I have? System, show me my status\n\nName: Mosquito Overlord, Mosquito of Death, or maybe just Tim\n\nGender: Male\n\nLevel: 1/5\n\nExperience: 2/10\n\nAge: 7 days\n\nExpected Lifespan: 7 days\n\nRace: Karen Mosquito(Tier 0)\n\nStats:\n\nHealth: 494/494\n\nMana: 64/77\n\nStrength: 18.01\n\nAgility: 23.0675\n\nDexterity: 18.71\n\nIntelligence: 128\n\nConstitution: 40.41\n\nCharisma: 18.8\n\nSkills(+)\n\nSpoiler\n\nFly(Lv 8)\n\n(Lv 5)Holy Flight\n\nLike a Rock(Lv 5)\n\n(Lv 5)Rocky Acting\n\nPray(Lv 6)\n\n(Lv 5)Only My God Matters!\n\nSpear Handling(Lv 1)\n\nAerial Combat(Lv 1)\n\nLike a Tree(Lv 1)\n\nStolen from its original source, this story is not meant to be on Amazon; report any sightings.\n\nSwarm Tactics(Lv 2)\n\nAura of Irritableness(Lv 1)\n\nPiercing Flight(Lv 1)\n\nTalk To the Manager(Lv 2)\n\nSpace?(Lv 1)\n\nBloodsucker+2(Lv 4)\n\nJobs(+)\n\nSpoiler\n\nHead Cultist Of the Mosquito God\n\nEMPTY\n\nLOCKED\n\nLOCKED\n\nJob Skills(+)\n\nSpoiler\n\nLead Prayer(Lv 1)\n\nBloody Ritual(Lv 1)\n\nMember Initiation\n\nProtection of Blood(Lv 1)\n\nTraits(+)\n\nSpoiler\n\nSuper Fertile\n\nHoly Crusader\n\nSelf-Named\n\nBlanket Of Enemies\n\nBlasphemy(Major)\n\nBlood Born\n\nGodly Caretaker\n\nMocked by The Gods\n\nMonster?(Legendary)\n\nSkill Researcher\n\nAlright, open up those skills. Let’s see what we’ve got… Hmmm, yeah, there is nothing good there, at all. What about my job skills? Let’s see…. What about Protection of Blood? I bet I could leave a blood trail. Yeah, and it’d be easy to follow if I use Blood Born. Alright, I think I can do this. If I just activate Protection of Blood for a second then let it fall…. Ah ha! A small amount of blood on the ground for me to follow. I’m totally a genius, aren’t I?\n\nNow! Off to find a boar!\n\n…An hour later and I did it. I found a boar. Though it seems a little bigger than the one I found with the mosquitoes… Whatever. Let’s do this! So, I initiated my genius plan. First, I used Piercing flight to just get its attention. And oh boy did it get its attention. When I got here, the boar was just peacefully laying down and chewing on some bones that seemed suspiciously boar shaped. It had not a care in the world.\n\nWhen I started my screeching, it stood up in an instant. I could swear I saw its eyes turn red for a moment before it turned around and looked at me. And for whatever reason, it seemed to think I looked tasty. Really tasty. I mean, it charged way quicker than I was expecting. It was right in front of me in an instant. So, I did the smart thing and flew as fast as mosquitoly (Hehe, see what I did there?) possible.\n\nI flew for a solid five minutes before I made a realization. I FORGOT TO FOLLOW THE TRAIL! GODDAMMIT! Of course, by now it was much too late to go back and find it, as I’D BEEN FLYING FOR FIVE MINUTES! So, clearly it was time to restart, and I- Wait a minute…. Is that what I think it is?\n\nAt the edge of my vision, I could see what looked like a white wall of webs. And… I think I could feel my cultists in there (Did I fly in circles for an hour…?)!\n\nI sped up a bit, wanting to get closer to hopefully a safe place. As I reached the wall of white, I.. uh. Kinda flew right into it. Again. But it wasn’t my fault! I could clearly see the webs like a foot in front of me, but where I was stuck there was nothing I tell you! NOTHING! Struggling in the webs, I could hear the hog approaching cautiously. It was clearly weary of whatever managed to just stick me in place. It got so close I could feel its breath on me. And ugh, That was not nice. Being as small as I was, its breath completely surrounded me, shaking the web a little as it came over me. Disgusting.\n\nAnd, being in a pretty deadly situation, I did what always seemed to work before. Asked for assistance from my favorite god. Oh almighty Mosquito God, please don’t actually give me to Illinois when I die, I really tried to help the cult survive. At that request, I suddenly felt the boar’s breathing stop, and fell from the web. Into a sticky pile of sizzling goo.",
            "comments": [
                {
                    "comment_id": "8892847",
                    "username": "Dude88",
                    "comment_text": "Tftc",
                    "time": "2023-06-09T19:55:53.0000000+00:00",
                    "replies": []
                }
            ]
        },
        {
            "id": "1162168",
            "name": "29. Spiders Suck",
            "url": "https://www.royalroad.com/fiction/64990/i-wanted-to-be-a-vampire-not-a-mosquito-monster/chapter/1162168/29-spiders-suck",
            "content": "When in the presence of evolved brethren, most monsters will choose between two paths. Some, will get much smarter, to help their evolved brethren lead, as a single monster can’t control an army on their own, while others will lose most of their mental capabilities. While the first path tends to make it much harder to deal with a group of monsters, as you can imagine it is much harder to fight an organized army than a mob, the second oath should not be discounted either. The monsters that lose their mental capabilities do tend to gain a decent bit of strength for it, and those mobs can do much more damage, as they tend to be much harder to predict.\n\n-The Bloody Axe, Day 5 of Adventurer Training\n\nI looked around, hoping to god I did not just fall into what I thought I did. Looking around, there was nothing else here but a few spiders sucking up the pool I was laying in. Oh god. OH GOD! I WAS IN A POOL OF BOAR! NO GROSS! GET IT OFF! GET IT OFF! GET IT OFF!\n\nAssisted Blood Seeking Boar(Lv 9) kill + 10 exp.\n\nLevel up!\n\n+5 stat points\n\nFly level up dexterity multiplier is now 1.08x.\n\nAerial Combat level up agility multiplier is now 1.01x.\n\nI flew up, away from the threads and into the trees, trying to shake off the melted guts I was drenched in.\n\nAfter five minutes and much less success than I was comfortable with, I came back to where my spiders had been lapping up the pool of dead boar. They were clearly done by now, as the lack of both a pool and spiders would suggest, so I was just left sitting in front of a massive wall of webs. I could feel my spider cultists in there, and they felt a lot less hungry than before. Clearly that had not been the only meal they found in my absence. I flew there, staring at the wall, wondering how exactly I could get into this safe? haven of my spider cultists. I flew there for a solid five minutes before making the decision that I most certainly could not. Those stupid spiders built themselves a home that looked pretty mosquito proof, and I could not help but wonder why they couldn’t just do this before.\n\nSupport the author by searching for the original publication of this novel.\n\nI swear these dumb animals. They never would have been worried about food to begin with if they had this. It’s like these spiders can’t even think for themselves. They clearly knew what they didn’t want to do. No, let’s not go up. But they can’t think, oh, let’s build a massive web to lure in probably thousands of insects to their doom. I swear, all I told them to do was go hunt. BUT NO! Instead of coming to hunt with me, they build a web fortress. WHICH THEY SHOULD HAVE DONE TO BEGIN WITH!\n\nI guess on the bright side, I probably wouldn’t have managed to convert them all if they had this beforehand… But still! Ugh!\n\nAlright, might as well ask just in case. SPIDERS! PLEASE TELL ME YOU LEFT ME AN ENTRANCE INTO YOUR HUMBLE ABODE! At that question, I got absolutely nothing but confusion from them. Apparently, they thought I could just climb on the web to get in. Clearly they forgot something. I’M NOT A FUCKING SPIDER!\n\nAlright! Wooo. I should calm down. I’m getting worked up at nothing. Be like a tree. Nothing can harm me but fire and a huge storm. Stupid spiders are a good thing, they keep my leaves clean of bugs that want to eat me.\n\nWhat? No! I’m not actually a tree!?!?! WHY WOULD YOU THINK THAT!?!?! AND HOW DID YOU EVEN HEAR THAT YOU STUPID SPIDERS!?!?! Oh wait, I think I’m still… messaging? them. Ahem. What was I doing? Doesn’t matter. Siders! Make me a way in please! NO I CAN’T JUST CLIMB ON THE WEBS! I GET STUCK TO THEM! MAKE ME A HOLE OR SOMETHING!... What do you mean you can’t? Oh, I see… The spiders sent me a picture of what would happen if they put a hole in the web. Let’s just say it was not structurally stable, and apparently spiders can suffocate. Hmm… I’m totally gonna have to live outside the web, aren’t I? Doesn’t matter, I think it’s time to go to bed anyways. I’m getting tired again. But before that. I think I made a promise to someone.\n\nOh almighty Mosquito God, thank you for letting me not die today, as that would have sucked. Goodnight.",
            "comments": [
                {
                    "comment_id": "8414740",
                    "username": "SteakLord",
                    "comment_text": "thanks for the chapter",
                    "time": "2023-04-13T22:41:36.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8512402",
                    "username": "VoidFiller",
                    "comment_text": "Typo: the second oath -> path\n\n🦟->🕸",
                    "time": "2023-04-26T03:20:14.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8892934",
                    "username": "Dude88",
                    "comment_text": "Tftc",
                    "time": "2023-06-09T20:02:41.0000000+00:00",
                    "replies": []
                }
            ]
        },
        {
            "id": "1165526",
            "name": "30. Grass",
            "url": "https://www.royalroad.com/fiction/64990/i-wanted-to-be-a-vampire-not-a-mosquito-monster/chapter/1165526/30-grass",
            "content": "When I woke up, I was surrounded. By webs. Webs. WEBS! Goddammit they totally expanded, didn’t they? Now what? I’m trapped in a giant spider web. Spider Cultist web to be specific… Wait, normally them being cultists would make it worse, but doesn’t it make it better? Because they’re my cultists. Heh. It’s fine. I’m sure they have a way out… What am I kidding? They probably still think I’m a tree. Alright, what way can I get out…? I’m sure there’s still something I can do… Oh yeah! I can teleport!\n\nTo my cultists… who are also in the web… Huh, maybe that won’t work… UNLESS I TELL THEM TO GET OUT OF THE WEB! HAHA! I AM A GENIUS!\n\nAlright spiders! I need you guys to leave the web for a bit! Yeah I know it’s not as safe outside the web, it’s just for a bit! JUST DO IT! I swear, why do the spiders lack so much common sense, but are so much less cooperative than my mosquito buddy was, bless his soul. Alright, I think they’re all outside of the web, now to pick a link and…\n\nOh, that is just as weird as the first time. Alright! Now you  can go back in the web you stupid spiders. Looking around, I realized… I was outside the forest… Oh god, how big did they make this web…? I refuse to believe they could expand it this much in a night. There were only, what, 200 of them? Looking around, instead of the barren landscape I had seen before, I was somewhere new… I’m sorry, did they encompass the whole forest…? Oh god. I might’ve caused a problem… Maybe a disaster… Oh well, Elly’s fault! It’s not like  there were any people in this forest anyways, hopefully. Other than my ex-cultist… AHEM! There was nobody in the forest. Nobody at all. Yup.\n\nSo, I was now inside a nice little plain biome, with purple grass… Whatever, it’s better than red. Yeah, I’ve had enough blood. It’s time for something new!\n\nIf you stumble upon this narrative on Amazon, it's taken without the author's consent. Report it.\n\nStatus Poisoned(Major) resisted.\n\n…What? I DIDN’T EVEN EAT ANYTHING THIS TIME! WHAT JUST TRIED TO POISON ME!?!?!? I looked around, but as you could guess. There was literally nothing but grass, grass, and more grass. Really tall grass… Actually, is it getting taller? I flew there in horror as I realized I could actually see the grass growing at a visible rate. I mean, it wasn’t too quick, only a few millimeters every second, but that was still definitely alarming. It would probably be taller than the trees within a day! I flew away quickly, definitely not wanting to be stuck in suspicious grass that should not be growing so quickly…\n\nBut as I flew, the grass kept getting taller around me. Only the grass around me… wait what? I turned around quickly to see, and the grass that I had passed was taller than the rest, if only by a little. The weirdest part was that the grass started actually… ungrowing? When I got away from it. Oh god. This grass totally wants to eat me, doesn’t it!?!??! Uh no! I don’t like this! THERE IS LITERALLY NOWHERE TO GO! I can’t go back to the forest, as it is literally just covered in webs, and there is evil, possibly hungry grass around me, which, as far as I can see, goes on for a very long time. And even if I could outrun it and find an end, then I kinda shirked my responsibilities and left all my spiders alone…\n\nThis is hopeless, isn’t it? It’s fine! It’s fine! I’ll just teleport back to the spiders again! They can’t all be somewhere so evil! SPIDERS! Spiders? What just happened!?!?! I CAN’T TALK TO MY SPIDERS ANYMORE! WHAT THE HELL!?!?!?!?\n\nIS IT THE GRASS!?!?! EVIL GRASS HAS MIND BRIDGE CANCELING POWERS!?!?!? NO NO NO! I’M GOING BACK TO THE WEB!\n\nI spun around in circles frantically, only to see no forest or giant web anywhere in sight. I was trapped, in the midst of a sea of grass. That was growing taller if I stayed near it and was probably poisonous. Oh god. I was actually dead this time. Nobody can defeat plants without fire, and I have no fire!",
            "comments": [
                {
                    "comment_id": "8394050",
                    "username": "Vibipi",
                    "comment_text": "Evil grass",
                    "time": "2023-04-11T12:23:53.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8893367",
                    "username": "Dude88",
                    "comment_text": "Tfc",
                    "time": "2023-06-09T20:53:20.0000000+00:00",
                    "replies": []
                }
            ]
        },
        {
            "id": "1166591",
            "name": "Interlude: Spider Infestation",
            "url": "https://www.royalroad.com/fiction/64990/i-wanted-to-be-a-vampire-not-a-mosquito-monster/chapter/1166591/interlude-spider-infestation",
            "content": "I kept walking after killing that damn mosquito. It dared to remove my connection from Illinois, and it paid the price. Everyone knows you never try to take a dog from its master, especially by force.  I walked for a few hours before resting for the night, I was close enough to the church to start a transmission tomorrow, and I could report a mission well done. Settling in for the night, I made a small camp, and got some fire going. The forest was much more eerie than before, and it seemed to be getting worse as time passed.\n\nIt was strange, it was like something was slowly disappearing from the forest but I had no idea what. That’s when it hit me. It was the sounds. The longer I stayed here, the quieter it got. The insects were slowly stopping their noises, and they were fading away into the distance. Getting worried, I started looking around. Insects slow down for almost nothing but disasters, and I did not want to be caught in one.\n\nI realized I was slowly losing visibility in my surroundings, as a wall of fog approached me from behind. It moved slowly, but I could feel malevolence and hunger wafting from it. And it was not slowing down. It was probably a hundred meters away, but would catch up to me before the night was over.\n\nThis story has been unlawfully obtained without the author's consent. Report any appearances on Amazon.\n\nI got up, preparing to leave and set up camp a little further before I realized something. There was something moving in the fog. The fog reacted weirdly to this, instead of seeing currents in it, it appeared that small lines in it were vibrating, forming a massive… The spiders. They were back.\n\nWhat happened!?!?! We killed their queen a few weeks ago, they can’t have gotten a new one so soon. It would take months at the least, and even that would be nearly impossible. That heretic, he must have messed with them.\n\nThis was going to be bad, we don’t have anyone left in the area to take care of them, and at this rate they’ll start overtaking the towns in just a few weeks. Nothing good ever comes from heretics, causing problems wherever they go. This was going to be rough.",
            "comments": [
                {
                    "comment_id": "8414758",
                    "username": "SteakLord",
                    "comment_text": "thanks for the chapter",
                    "time": "2023-04-13T22:45:37.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8512442",
                    "username": "VoidFiller",
                    "comment_text": "🕷❤️‍🔥!",
                    "time": "2023-04-26T03:29:04.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8893387",
                    "username": "Dude88",
                    "comment_text": "Tftc",
                    "time": "2023-06-09T20:56:32.0000000+00:00",
                    "replies": []
                }
            ]
        },
        {
            "id": "1167855",
            "name": "31. Suicide",
            "url": "https://www.royalroad.com/fiction/64990/i-wanted-to-be-a-vampire-not-a-mosquito-monster/chapter/1167855/31-suicide",
            "content": "I flew what I think was back towards where I came from, but there was no sign of anything there but more grass. The forest had completely disappeared, and I was abandoned in the sea of grass, with no cultists to help me. Alright it’s fine. Grass can’t hurt me, I’m a tree, with big roots that will steal all of their nutrients. Actually, can I steal their nutrients? It worked a little on the flytrap… right?\n\nI flew down a little, towards the possibly murder grass… Uhh, this is a good idea, right? Alright, don’t back down! I landed on the maybe murder grass and- OH GOD IT BURNS! WHY DOES THE GRASS BURN!?!?! I quickly flew back up, away from the definitely murder grass. Looking down, my legs were half the size they were before… That’s… oh God. I LOST MY LEGS! I NEEDED THOSE! I NEED THOSE TO LAND ON THINGS! MY POOR LEGS! WHAT KIND OF GRASS BURNS OFF YOUR LEGS!?!?!\n\nI hate this world! I wanna go back! Send me back! Evil grass was too far! Too far I say! I could forgive the scorpion spiders, but not grass that burns at the touch! Spiders are already evil, but grass has done literally nothing wrong! It’s just grass! HOW CAN IT BE EVIL!?!?!?! Actually… I’d probably be evil if millions of my kind were tortured on a weekly basis too… Maybe evil grass makes sense? NOPE! I can’t go down that route! I will not rationalize evil grass! Evil grass is too far I say! TOO FAR! I demand someone looks at this! Whose idea was it!?!?! Who thought evil grass was good!?!?!?\n\nNEW QUEST AVAILABLE!!\n\nFigure Out Who Made the Evil Grass!\n\nSuccess:\n\nDiscover the original creator of the mysterious grass that burns at the touch.\n\nFailure:\n\nDon’t.\n\nReward(s):\n\nThis narrative has been purloined without the author's approval. Report any appearances on Amazon.\n\nRare Skill Plant Communication\n\nAccept Quest(Y/N)?\n\n…Yes…? I’ll accept. Probably. Who even gives quests? Actually, seriously, who delivers quests? I know I got a few from Elly and Mosquito God, but what about the rest? The system? Other Gods I don’t know about? System? Can you answer this? Please, I need to know now!\n\nProcessing Request…\n\n…System? Hello? You there? Systeeeemmmm? Uh oh, I think I broke something. Uhhhh. I hope this isn’t that bad… Can I still see my status? System? Okay yup, that’s working just fine. I guess it just needs a bit of time. Hopefully… I don’t think that was a bad request…\n\nWait, this isn’t the time! I need to defeat the evil grass… Yeah no, I’m leaving this grass. I can’t defeat it! It’s the fly traps all over again… defeated by my lack of fire. Why Mosquito God, why!?!?! WHY CAN’T YOU GIVE ME FIRE!?!?!\n\nSkill Burst of Flame obtained.\n\nCould this be…? System! What does Burst of Flame do!?!?\n\nBurst of Flame:\n\nThis skill allows the user to obliterate their body and soul to create a powerful inferno that can burn anything.\n\n…Are you trying to tell me something, Mosquito God? I thought you liked me! WHY WOULD YOU GIVE ME A SUICIDE SKILL!?!?! WHAT IF I DIDN’T LOOK AT THE DESCRIPTION FIRST!?!?! ARE YOU TRYING TO KILL ME!?!?!?\n\nIt’s fine! It’s fine! I’ll just pretend it never happened! Yes! Mosquito God never gave me a suicide skill! It must have been Elly! Yeah! She probably hijacked my prayers! Yup, Mosquito God would never do that! Stupid Elly! I swear! I’ll get her back for this! I’ll… I’ll think of something later… I should probably deal with this grass first. As I was thinking, The grass had menacingly grown like ten centimeters. And was still coming up to get me. I bet it got a taste for mosquitoes after it stole half of my legs! It’s probably ravenous now!\n\nI flew off to an area of grass that hadn’t grown yet, to slow down my definitely not so inevitable death. And the grass started growing over where I moved. How does it even tell I’m above it!?!?! It has no eyes! GRASS CAN’T SEE! Whatever! Evil grass doesn’t need to make sense! The fact that it’s evil already makes it make no sense. It being able to see is just icing on the cake.",
            "comments": [
                {
                    "comment_id": "8414779",
                    "username": "SteakLord",
                    "comment_text": "thanks for the chapter",
                    "time": "2023-04-13T22:48:23.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8893450",
                    "username": "Dude88",
                    "comment_text": "Tfc",
                    "time": "2023-06-09T21:04:16.0000000+00:00",
                    "replies": []
                }
            ]
        },
        {
            "id": "1169134",
            "name": "32. Up?",
            "url": "https://www.royalroad.com/fiction/64990/i-wanted-to-be-a-vampire-not-a-mosquito-monster/chapter/1169134/32-up",
            "content": "Alright! What do I know? There was a forest next to me, but it disappeared, the grass can probably see me somehow, the grass is probably poisonous, the grass will grow when I’m under it, and it burns very well at the touch. Alright, I think that’s it… Now, we already decided I have no fire and I can’t drink its blood. I guess I should probably check.\n\nI flew up for a bit going as quickly as possible in case it somehow made a difference, but at a hundred meters something changed. I went from flying up to being upside down in an instant, with the grass getting closer and closer by the second. I tried to flip over as quickly as possible, and somehow managed to before my inevitable doom. I was only a few centimeters away from the grass when I righted myself, and the grass seemed to want to correct this. As if it could feel my presence, it sped up from a few millimeters a second to a few centimeters. It was chasing me as I flew away from it, and It was catching up. After my fall, everything about the grass’ growth had sped up, how quickly it went up, its area, but not its degrowth rate. As I left the grass behind, instead of getting shorter again the grass just kept growing, leaving towers of grass behind me. I started going up as I flew forward, trying to stay above my rising floor of death. As I kept flying, I almost bashed into a wall of grass. It appeared out of nowhere, one second I was flying away, possibly outrunning the evil grass, and the next there was just a wall of it in front of me. I turned around quickly, only to find that behind me was completely clear? What? Doesn’t matter! I started flying back the way I came, but as soon as I flew a few meters I could see that the grass in front of me was taller than the grass behind…\n\nOkay, something dastardly is going on here! I took a ninety degree turn to the right, and started flying that way instead. To my relief, this grass actually hadn’t started growing yet, and I probably had a few minutes of time to think before it caught up.\n\nThis text was taken from Royal Road. Help the author by reading the original version there.\n\nWhat the hell was happening!?!?! Was the grass… learning!?!?! NO! NO! If it was learning it would have started growing out this way too. Clearly it was doing something else. But what!?!?!?! Wait a second… Turning me upside down, grass just appearing, my mental bridges being cut off… Cold the grass… manipulate space!?!? IS THIS SPACE BREAKING GRASS!?!?! What the hell!?!?! GRASS CAN’T DO THAT! THIS GRASS IS MORE OP THAN I AM! THAT’S NOT FAIR! It’s grass! I am being outdone by a plant! A PLANT! NOT EVEN A GOOD PLANT! BUT GRASS! THE WEAKEST PLANT IN EXISTENCE!\n\nAlright! I need to deal with this quickly. If I don’t it’s going to wreck me. What are my options!?!?\n\n…No. I can’t. Not again. But… What else can I do!?!?! I don’t have a choice… I'm gonna have to go rock again. If I’m a rock it’ll probably ignore me, right? RIGHT!?!?! Seeing absolutely no other option, I flew down a little closer to the grass so I would smash into the ground and break, and I… Acted like a rock. I fell down into the grass, obscuring my view… Uh oh. Wait, how do I get out now…? I was more trapped than before. While I wasn’t being actively hunted by the grass anymore, there was nowhere I could fly. Rocks can’t fly, I was practically a statue, I couldn’t even move my wings. All of a sudden, the ground started shaking. It was an earthquake! All around me, the grass blades were shaking like mad men.\n\nThen, all of sudden, it happened. My cultist connections were back! Deciding it was a bad idea to stick around and find out what was going on, I teleported to a random spider, and started falling… through their web. I hit the ground with a thud, completely covered in webs.",
            "comments": [
                {
                    "comment_id": "8422733",
                    "username": "Mr.Penguin-The-Fifth",
                    "comment_text": "lol",
                    "time": "2023-04-14T20:58:32.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8894838",
                    "username": "Dude88",
                    "comment_text": "Tftc",
                    "time": "2023-06-10T00:14:41.0000000+00:00",
                    "replies": []
                }
            ]
        },
        {
            "id": "1170333",
            "name": "33. Strength",
            "url": "https://www.royalroad.com/fiction/64990/i-wanted-to-be-a-vampire-not-a-mosquito-monster/chapter/1170333/33-strength",
            "content": "Alright, that was something. I think I’m gonna avoid mysterious grass for now… It seems pretty dangerous.\n\nRequest Granted!\n\nWhat request?\n\nQuests can be granted from multiple sources. They can appear from specific actions being undertaken, predetermined by the system, a scribe, a higher being, or\n\nSpoiler\n\nREDACTED.\n\nOH! THAT REQUEST! Or what? System? Are you okay? System…? Alright! I’m just gonna ignore that for now. Yeah, that’s probably for the best. Now then, how do I get out of this stupid rock skill? I really don’t want to be a rock… Huh? It ended? That was quicker than last time. Whatever. I’ll figure it out later. Because I’m trapped in these webs now! Get them off of me!\n\nI tried wiggling around a bit, but my fall had completely wrapped me in webs. I was stuck in a trap, again. Goddammit. What am I supposed to do about this!?!?! Hey! Spiders? Can you get this off of me!?!?! NO I CAN’T JUST EAT IT!?!?! I TOLD YOU! I’M. NOT. A. SPIDER! Alright. I’ll figure this out myself. It can’t be that hard to escape from, it’s just webs. I’ve got a lot more strength than I did before, right? System, what’s my strength?\n\nStrength: 18.01\n\nAlright, yeah, there is no way I don’t have enough strength to escape from measly webs.Yeah, I can do this. I just did it wrong. Alright, instead of wiggling, I’m gonna try to spread my wings!\n\nInside my wings, I started struggling against the cocoon for real. I took all of my extremities, my wings, legs, and as much as I could of my head, and tried to move them to the best of my ability. The webs around me broke instantly, and I was free again, free to enact my will on the world. MWAHAHAHAHA!\n\nThe narrative has been stolen; if detected on Amazon, report the infringement.\n\nWait… didn’t I get trapped in these webs literally yesterday? I don’t think anything has changed since then, right? Oh… wait. I got three levels in Head Cultist of the Mosquito God… That was six points of strength… And had like what, twelve? Oh yeah, that definitely made a difference. You’d think twelve strength was good enough too, but whatever. I guess I don’t actually have a metric for how strong I am… I don’t even know how strong people are. Whatever, I’ll figure it out later.\n\nNow then… I'm still in a slight pickle.\n\nI’m in the middle of this stupid web. I did just break those webs though… I bet I can fly through them now! Hehehe. Who said being a mosquito meant I had to be as weak as a mosquito? I can level up! Mwahaha. MWAHAHAHA! Now! Through the web! I flew straight into the web, and… got stuck. Dammit. Why can’t I go through the webs!?!?! I LITERALLY JUST BROKE OUT OF ONE! I flapped my wings a few times and the webs around me broke… Seriously!?!? HOW CAN I BREAK THEM BUT NOT FLY THROUGH!?!?! Does that even make sense!?!?!\n\nI spent two hours. TWO HOURS GETTING THROUGH THE WEBS! I flew a few centimeters, and then I had to flap my wings to break it. I left a gaping hole through the web where I went, my path being pretty clear. Wait, what? I turned around and the path in the web I had made had completely disappeared. Alright, spider cultists are magical too. So, where did I exit from?\n\nLooking around, I was surrounded by… not grass thankfully. But something much worse. Something much. much worse. There were venus flytraps everywhere. Those darn monsters were mocking me. Staring at me from their field where they killed all kinds of insects, beetles, flys, mosquitoes. I will kill them. Somehow. I do have fire now… It might be worth it for this… NO! No, don’t think like this. I shouldn’t kill myself avenging my mosquito pal. He wouldn’t want that… probably. I wonder how mosquitoes feel about mind control… he never seemed angry. Or happy. Or actually anything at all. Huh. I guess mosquito pal couldn’t feel bad if he didn’t have emotions… Well, at least he probably wasn’t sad. That’s good enough, I guess. I’ll never forget you, mosquito friend.",
            "comments": [
                {
                    "comment_id": "8471688",
                    "username": "RagTagSpy",
                    "comment_text": "Mosquito friend need a name",
                    "time": "2023-04-21T00:08:27.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8894879",
                    "username": "Dude88",
                    "comment_text": "Tftc",
                    "time": "2023-06-10T00:20:39.0000000+00:00",
                    "replies": []
                }
            ]
        },
        {
            "id": "1183761",
            "name": "34. Mating",
            "url": "https://www.royalroad.com/fiction/64990/i-wanted-to-be-a-vampire-not-a-mosquito-monster/chapter/1183761/34-mating",
            "content": "So, what to do about the flytraps. I obviously can’t leave them there. It will be a massacre if I do! All those poor insects, dying day after day. I can’t stand that! That would be so wrong it’s not even funny. I’ll think of something, even if I need to sacrifice my entire day to do it!\n\nI flew on to a branch hanging out over the field, and thought for a solid hour to come up with a plan of attack. It really is hard to come up with an acceptable idea when you’re as small as a fly and don’t have hands. I had to throw out ninety percent of them for a lack of hands, and then another nine percent for them being suicidal. But! I did it! I came up with a plan! I could use the scorpion spiders! Considering that they had strong enough acid to turn a boar into a puddle in practically an instant, why couldn’t they do the same to a venus flytrap? I can’t believe that took me so long to think of. But, in my defense, it’s because I don’t want to think of scorpion spiders.\n\nThe thought still gives me shivers. So, I called my spiders to converge, and got one. After thirty minutes. This web was too big… I swear. It should not take more than thirty minutes to traverse a web! That is definitely unnatural. So are scorpion spiders though… AHEM! Whatever! Spider! I have a very important job for you. You know what you did to those boars? I need you to stab something and inject that acid into them, but it’s not a boar. It’s those plants over there!\n\n…What do you mean you can’t? I just need you to take out your stinger, and melt a plant! It’s not that hard! You don’t have a stinger…? What!?!?!? WHY NOT!?!?! Did it fall off or something!?!?! Oh, I see. I get it. Yes, that would be a problem. These stupid spiders.\n\nSo, not all of the spiders are female. Yes, that makes sense. I can get behind that. You probably need male and females in order to mate. Unless you’re something weird like a shark. They cheat though. Small things should be allowed to reproduce asexually. Whatever, I’m getting off track. Where was I? Oh yeah! I need the female spiders. Which are apparently busy giving birth. And dying… Wait a second. How many spiders are left!?!?!?! Uh, uh oh. No. NO NO NO!\n\nStolen story; please report.\n\nI quickly started searching through my connections to my spiders. Most of them were weak, and getting weaker. I quickly chose one that was dying and teleported to it. And the scene there was horrifying. Not that being stuck in a web after I teleported helped, but. There were almost two hundred spiders resting on the webs, half of them were slowly dying, and the other half were dead. They were ripped open, with puncture marks in their abdomens. And those wounds were overflowing with eggs. There were thousands of them, tens of thousands. It was a gruesome sight. My poor cultists… They slaughtered each other. After mating too! What kind of life is that!?!?! Mating once and then being killed to… I’m guessing feed the young. I am so glad I did not become a spider. That would have sucked.\n\nWait, the spiders, how are they doing!?!? I felt my connections to my spiders, and… Why were there more..? I felt my connections, and the weakest of them had been snuffed out, killed by whatever process happened during their mating cycle. But there were new, faint connections. And there were a lot of them. Thousands of them… THE EGGS!\n\nThe eggs… hahaha. HAHAHAHA. MWAHAHAHAHAHA! The cultists' babies were automatically initiated. Oh thank you oh Great Mosquito God, perhaps you don’t want to give my soul away quite yet. I knew you loved me!\n\nHead Cultist of The Mosquito God level up. All stats +2.\n\nSkill Born into It obtained.\n\nOooo! I got a new skill! System! What’s Born into It do?\n\nBorn into It:\nMakes children born of members of the cult much less likely to attempt a revolt. All boosts granted by skills from Head Cultist of The Mosquito God are 12562% (Number of cult members) more effective on members who were born into the cult and have never left.\n\nThat… is absolutely useless! I DON’T HAVE ANY SKILLS THAT BOOST MY MEMBERS! Wait! Yes I do! I just never used it! I have Lead Prayers! Yeah! I bet Mosquito God would like that! Okay, I got this. Even if it’s currently not useful to help in defense, it is still useful nonetheless. I bet Mosquito God is gonna help us once he’s been born. So I can’t wait to try this out!",
            "comments": [
                {
                    "comment_id": "8449546",
                    "username": "Quinn Voidheart",
                    "comment_text": "Thanks for the chapter keep up the good work!",
                    "time": "2023-04-18T08:36:00.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8894910",
                    "username": "Dude88",
                    "comment_text": "Tftc",
                    "time": "2023-06-10T00:26:24.0000000+00:00",
                    "replies": []
                }
            ]
        },
        {
            "id": "1184909",
            "name": "35. Web",
            "url": "https://www.royalroad.com/fiction/64990/i-wanted-to-be-a-vampire-not-a-mosquito-monster/chapter/1184909/35-web",
            "content": "Alright, first thing first. I need out of this web. I flapped my wings a little, freeing myself from the web and leaving a small hole behind in the process. Huh, I should work on that. I don’t want to make the web unstable… Whatever, the spiders can figure it out. Webs are their domain, not mine. Now then, how to protect all of these eggs… Wait, do I need to? They are surrounded by what I assume is kilometers of webs, I mean, I don’t think anything is getting in here anytime soon. And if there was really a problem I don’t think they would have all killed themselves so quickly. They probably would have left a few behind to defend their eggs. Yeah, I’ll trust my cultists knew what they were doing… Yeah no.\n\nThey didn’t even have the brain power to realize they could hunt. I totally need to protect these stupid eggs. But… I can’t even fly around in here! There’s absolutely no way I could do anything to help. GAH! There are no good solutions to my problems! Ever! You know what, I’ll just trust them to Mosquito God. I really can’t think of anything else. Alright, so, I guess I should try and lead a prayer… Wait, I’m having a bunch of eggs pray, will that even do anything? Eh, whatever. At least it will work for me.\n\nSo! Eggs, lone spider and possibly others that I haven’t seen yet. Let’s all close our eyes and pray for salvation. Oh great and powerful Mosquito God, please protect all of us here, any somehow living cultist and all of these defenseless eggs. Thanks for listening, Mosquito God, amen.\n\nAfter the prayer, something changed. Suddenly, the wind started picking up and storms clouds rolled in from out of nowhere. All around me the web was shaking from the wind, and possibly an earthquake, it’s a lot harder to tell from the air. There was a crack of lighting and a tree was charred black in an instant. No fire appeared from the strike, all that could be seen was a charred tree. Then, a red mist emanated from the tree. Slowly turning everything it touched to the color of blood. It spread out, slowly at first, but picking up speed the longer it was alive. In an instant, it surrounded me, the eggs, and everything I could see.\n\nThe tale has been stolen; if detected on Amazon, report the violation.\n\nThen, as quickly as it began, everything stopped. The storms rolled away, the wind died back down, and all of the shaking ended. I flew there, dazed. What the hell did the Mosquito God just do? Looking around, all the webs changed from their looking like normal webs. They were a nice white, like webs, before. But now, they were blood red with hints of black, and they were flowing. The individual lines themselves seemed to be just as stationary as before, but something was different, and not just the color. I looked closer, trying to figure out what it was…\n\nUh oh, wait a second. I flew up to one of the strands, and it wasn’t sticky anymore. I didn’t get stuck. But that wasn’t the worst part, I landed on the web, and it rippled. Like a liquid. My presence sent a small ripple throughout the whole of the web, pinpointing my location for all who could see. Because the strands were turned to blood.\n\nThe Mosquito God turned the web into blood!\n\nMosquito God 1% to birth.\n\nWhat the hell!?!?! Seriously!?!?! HOW IS THAT EVEN POSSIBLE!?!?! Besides the plain fact that he just figured out a way to transmute what I think is basically silk into blood, how the hell does it stay up!?!?! BLOOD DOESN’T FLOAT! Actually though, it doesn’t form shields around you either. Hmmmmm. Fuck! Magic makes no sense. A bloody web. I don’t think I can get behind that. At all. I’m just gonna go to sleep. Goodnight, Mosquito God, I hope you enjoy this new web of yours. Because I am not dealing with it right now. Way too much work. Way. Too. Much. Hopefully it will at least protect the eggs while I’m asleep. That was what we asked for.",
            "comments": [
                {
                    "comment_id": "8455948",
                    "username": "Quinn Voidheart",
                    "comment_text": "Thanks for the chapter keep up the good work!",
                    "time": "2023-04-19T02:56:20.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8894958",
                    "username": "Dude88",
                    "comment_text": "Tftc",
                    "time": "2023-06-10T00:31:26.0000000+00:00",
                    "replies": []
                }
            ]
        },
        {
            "id": "1185971",
            "name": "36. EGGS!",
            "url": "https://www.royalroad.com/fiction/64990/i-wanted-to-be-a-vampire-not-a-mosquito-monster/chapter/1185971/36-eggs",
            "content": "I woke up to a harrowing realization. I DIDN’T CHECK ON THE EGGS! What the hell is wrong with me!?!?! How did I forget them! I literally prayed for them! I was just too exhausted because of the praying, yeah, I bet Mosquito God took my power or something, and it exhausted me. I didn’t have a chance to. And it was not even slightly my fault! It was all Mosquito God! Wait, no assigning blame can wait, I need to check on the eggs! I looked where I left the eggs last night, and they were gone. GONE! Where do thousands of eggs and hundreds of spider bodies disappear off to!?!?! It’s not that easy! I searched around frantically, but to no avail, there were no signs of any eggs within a hundred meters of their original resting place. WAIT! I CAN TELEPORT TO THEM! Alright, quickly. I searched my links, surprised the first one wasn’t an egg, or the second, or the third… Wait a second. Did they… hatch!?!?! THEY WERE JUST LAYED! Alright, scorpion spiders are slightly scarier than I thought. But where did they go? I picked one at random, and teleported to it.\n\n…I got teleported like a meter to the right… WHERE ARE THEY HIDING!?!?! SPIDERS! COME OUT HERE!\n\nAt my command, the spiders unmerged from the webs. Not emerged, unmerged. All around me, bright red spiders’ bodies formed out of the web. They were like water elementals slowly being formed by a lousy golemancer. When they were done, I was surrounded by thousands of spiders.\n\nWas that because of Mosquito God or me…? I know I may have caused a problem with the mosquitoes’ births… I’m gonna assume no. It couldn’t have been me. Yup. Whatever impacted the webs must’ve done the same thing to the spider! The spider egg sacs are basically the same thing as the web, and Mosquito God is for mosquitoes, not spiders. You can’t blame him, it was an honest mistake. But kinda a cool one. I wish I could merge with blood… That is awesome.\n\nThis story has been unlawfully obtained without the author's consent. Report any appearances on Amazon.\n\nAlright, I guess you guys can go back to doing whatever you were doing. At that, the spiders remerged with the web, doing who knows what in there. I wonder… If I used Protection of Blood, what would it do to the spiders…? And would the web collapse…? You know what, I think I’ll wait until I’m clear of the web to use that skill now. Yeah, it seems like a bad idea…\n\nAlright, what can I do now? I think these spiders can protect themselves by now. They are literally everywhere. Alright, before I leave though, I need to do something. Are any of you spiders at that flytrap field? Oh cool. I teleported to the one who said yes. At the flytrap, I found the spider that was there last time. Cool. Alright, can any other spiders get here too?\n\nThis time, the spiders  arrived in an instant. They all just sprung up in an instance. Cool. Maybe being part of a blood web has its advantages too. Alright spiders! It is time!\n\nNow, I know you were all born today, or possibly yesterday, but it is time for war. Those venus flytraps are evil creatures. They have decimated your fellow cultists, and they need to be destroyed for the good of Mosquito God, so, ATTACK!\n\nAt that, my spiders stood there, on their webs. Doing nothing. God dammit. Alright spiders, do you have any way to attack? At that question, my new spiders sent me a rather harrowing image. These spiders, they weren’t scorpion spiders. They were… MOSQUITO SPIDERS! The spiders used some weird blood magic to squeeze a boar dry of blood. It turned into a wrinkly corpse in an instant. The blood in the boar flew out from its eyes, the wrinkling starting there, it spread along the rest of its body. By the time it was done, all of the meat somehow got removed too, leaving a really weird sight. There was nothing left but a loose skin suit around its bones.\n\nAlright… can you do that to the flytraps? I think they drink blood from the ground. Alright spiders, go drain the blood from those venus flytraps! Make them regret ever eating a mosquito!",
            "comments": [
                {
                    "comment_id": "8471735",
                    "username": "RagTagSpy",
                    "comment_text": "Mosquito god? More like blood god",
                    "time": "2023-04-21T00:15:17.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8895001",
                    "username": "Dude88",
                    "comment_text": "Tftc",
                    "time": "2023-06-10T00:37:31.0000000+00:00",
                    "replies": []
                }
            ]
        },
        {
            "id": "1187117",
            "name": "37. Flytrap Genocide",
            "url": "https://www.royalroad.com/fiction/64990/i-wanted-to-be-a-vampire-not-a-mosquito-monster/chapter/1187117/37-flytrap-genocide",
            "content": "Now, I’d like to say that the spiders rushed out in a wave from the web, and massacred the venus flytraps. Because that would have been awesome. Commanding a wave of blood spiders to do as I command, an army. But, instead they decided to be creepy, as my cute spiders tend to do.\n\nThe spiders started by fusing themselves back into the web. In an instant, they had disappeared again; I think they’re getting better at that. And then their own form of war started. It was slow at first, not very noticeable, but as time progressed it became clear. The venus flytraps were slowly withering, their red mouths losing color. They acted like leaves being heated near a fire, slowly curling in on themselves as they lost the blood sustaining them. Before long, all that remained of those dastardly flytraps were there dried out husks. With no evidence of what happened, other than the vibrant web nearby.\n\nHa. Hahaha. HAHAHAHAHA! YOU’VE BEEN AVENGED, MOSQUITO FRIEND! BUT DO NOT WORRY! FOR THIS IS NOT THE END! I will not stop until venus flytraps have been removed from this world, for our kinds cannot coexist!\n\nNow, where the hell did that blood go? I didn’t see it exit from anything like that boar. Spiders? I turned back to my spiders, to see a new sight. The web was flowing, like the rapids of a river. Starting from the ground, all the strands of the web looked to be rushing inwards, towards the center. Before I knew what happened, the web was gone. In its place was a wall of blood, rising like a tsunami as it picked up more strands of webs, becoming a natural disaster. After fifty meters, it was uprooting the trees as it went through, and after two hundred it was leaving deep pits in the ground where it passed.\n\nThe forest was quickly being consumed, and I may or may not have caused it. Uh… What the hell!?!?! I just had them eat some flytraps! What happened!?!?!?! As I watched the devastation caused by my spiders feeding, I felt a little bad for my ex-cultist. Because even if he did survive the forest turning to webs, I didn’t think he’d get through this. That was literally a natural disaster at this point, and… Wait, disaster? No, no, stop thinking about it. Definitely not. This was not me. This was Mosquito God, yup. He made evil spiders, not me. My disaster magnet had no bearing on this current predicament. So, I should probably see if this stops eventually.\n\nDid you know this text is from a different site? Read the official version to support the creator.\n\nBy now, the blood was fading from view, even with its enormous height, I was starting to lose sight of it as it disappeared into the distance. I started flying after it, but it just kept getting farther away until all I could see was a layer of rock with pieces of roots piercing through it. As it progressed, the blood had dug deeper and deeper until it hit solid rock just a few meters below what used to be ground level.\n\nYeah, this forest is never coming back. It was quite literally uprooted. That’s too bad, I liked the weird forest biome, it was starting to feel like home…\n\nI stopped chasing the wave, as I was obviously never going to catch, and flew in place for a bit. Thinking about what to do next. Sadly, that question got answered for me. An ear piercing roar emanated out from the direction that the blood had flown in, and I could see something starting to rise from the spot, even though it must have been many kilometers away.\n\nIt started as a red blob, as big as a mountain, it was only barely half the height of one, but it spread itself out over the area of at least eight. Slowly, the blob started shaping itself into something coherent. It started by taking huge blobs of itself, eight of them and spreading them out four on two different sides of itself. Then, it took its center mass and started to form two ovular pieces, connected at the center. Finally, great fangs grew from its front, as the blobs of blood elongated into eight legs. It was a giant blood spider. Fuck.",
            "comments": [
                {
                    "comment_id": "8895038",
                    "username": "Dude88",
                    "comment_text": "Tftc",
                    "time": "2023-06-10T00:42:31.0000000+00:00",
                    "replies": []
                }
            ]
        },
        {
            "id": "1188476",
            "name": "38. Giant Monsters",
            "url": "https://www.royalroad.com/fiction/64990/i-wanted-to-be-a-vampire-not-a-mosquito-monster/chapter/1188476/38-giant-monsters",
            "content": "So… A giant blood spider made out of a forest’s worth of blood. And thousands of other blood spiders. Wait, more than a forest’s worth of blood! Normally a forest’s worth of blood would just be the animals in it, but half these plants use blood instead of water. So, many forest’s worth of blood… Alright. I guess I should get over there. I perused my mental connections to the spiders, finding most of them were now almost exactly the same. Weird, must be some kind of hive mind. I teleported to one of them at random, as it didn’t seem like it really made a difference.\n\nThe teleportation sent me well above the clouds, right next to the spider's head. Oddly enough, it was much harder to tell how truly massive this spider was. All I could see was a wall of red that seemed to go on forever. Looking down, I could see the true devastation the birth of this sider caused. It looked like god decided to just scoop a circle out of the ground, leaving behind nothing but the rock underneath.\n\nThere were different places around the edge of the disaster that I could finally see without anything to block my sight. On one side, there was the barren waste land I came from, which was somehow more inviting than the one I was above. On another, I could see the field of evil grass that tried to devour me whole. There were different biomes all around too, bigger, more massive forests with what looked like jungle trees, a volcanic region, where the ground was darker than the rock I now knew was beneath it, and even an arctic area, where there was nothing but white for ages.\n\nThis world is so strange, yet so oddly beautiful sometimes. I couldn’t help but admire the view, and wonder what else this giant spider was blocking me from seeing.\n\nTrait Apocalypse Maker unlocked.\n\nThe story has been taken without consent; if you see it on Amazon, report the incident.\n\n…Alright. Whatever. I’ll deal with that later. Suddenly, the giant wall of red started to move, and it was quick. I know how you usually imagine giant monsters, as slow and easy to trip, but this thing was anything but. It moved faster than a train, and it did not want to stop. It was so huge it caused wind currents around it, sweeping me up and sending me barrelling with it as it ran.\n\nI managed to stabilize myself, barely and get a look at where we were going. The spider was rushing towards the plot of evil grass, and it was not slowing down. What the hell? There is literally nothing but space wielding acid grass over there, and it is not fun. But, not being one to question my new apocalypse engine, I just let it keep going. It seemed really determined right then, and I was not one to get in the way of something that could probably squish a skyscraper like a bug, let alone a measly bug.\n\nAs it neared the field, the grass started to react. It started growing uncontrollably, getting taller and taller until it also reached the mountainous height the spider was. The grass was much more intimidating like this, scarily so. And then, just like the spider had, it started to take a shape. The grass ripped itself from the ground, pulling dirt out as it went. Unlike the spider, the grass started shaping itself at the base. The grass came together to form a few giant stems, weaved together like someone would weave a basket, except it was pulled so tight it was impossible to tell it was made up of different pieces. Then, it moved on to making some leaves. Each leaf came as a pair, connected at their edge. The leaves were made with long, thin appendages on the edges, hundreds of them each. Wait a second… This looks familiar. Hmmm. I tried to think about where I had seen something like this, and soon it became clear. As I saw the leaves snap shut on themselves, I was filled with rage. That dirty grass. I can’t believe it! These plants have been in the way for as long as I can remember! IT WAS A GIANT VENUS FLYTRAP ALL ALONG!",
            "comments": [
                {
                    "comment_id": "8895260",
                    "username": "Dude88",
                    "comment_text": "Tftc",
                    "time": "2023-06-10T01:20:21.0000000+00:00",
                    "replies": []
                }
            ]
        },
        {
            "id": "1191858",
            "name": "39. Kaiju Battle!",
            "url": "https://www.royalroad.com/fiction/64990/i-wanted-to-be-a-vampire-not-a-mosquito-monster/chapter/1191858/39-kaiju-battle",
            "content": "The two giant monsters stared each other down from their massive heights, which I guess I was also at. The venus flytrap had ended up growing to be ten times taller than the already massive spider, and it did not look happy. The tension in the air was palpable, or maybe that was moisture from all the blood that's got to be coming off that spider. But either way, it was clear to all what was about to happen. A KAIJU BATTLE!\n\nI mean, this situation is extremely dangerous and will probably even further change the landscape from what the making of the spider did, but how can you not be excited!?!?! WHO DOESN’T WANT TO SEE A REAL LIFE KAIJU BATTLE!?!?!?! ESPECIALLY IF I OWN ONE! Wait, does that mean… KAIJUMON BATTLE!?!?! Yes! This should be a national sport! Wait, maybe it is! I hope it is somewhere. If there are no nations where kaiju battle is a sport, this world deserves the disasters that come with me being around.\n\nSuddenly, while I was mulling over how to make sure Kaiju Battles became a national sport, the flytrap attacked. Its stem extended over the distance between the kaijus, and one of its… mouths? Snapped shut on my spider's head. There were huge clouds of red steam coming off of it, and my spider screeched at this. Its inhuman cry piercing the air and spreading for miles. My spider’s, I’m gonna call it Mosquito God’s Baby from now on, head or what was left of it, merged back into its body then reappeared below the Venus Flytrap from Hell’s head. Its fangs closed around the stem, and Mosquito God’s Baby screeched in pain as it severed one of the Hell creature’s heads. At this, the venus flytrap repeats its first attack, aiming for the new head. Except, when it gets close, two giant portals appear in the air. They looked like black rips in the sky. No light that entered could escape, as if they were blackholes that pulled in nothing but the light. The flytrap stuck its mouth through one portal, and out the other. Its mouth came around two of the spider's legs, and snapped. It completely severed them, a lake’s worth of blood falling from the sky. Mosquito God’s Baby couldn’t stay standing at this, and fell to the ground onto its back. Its remaining six legs swinging in the air as it tried to right itself. The flytrap came in for the finishing blow, trying to bite Mosquito God’s Baby in half. But as it closed its mouth, Mosquito God’s Baby split in half. I regrew its legs and a head on each half, and there were two. There were two Mosquito God’s Babies. That is awesome. I love my Kaijumon. It is the best Kaijumon. It's as invincible as me! The flytrap, clearly seeing its inevitable divide, brought its mouth back to its body and made a defense. A wall of interwoven roots burst from the ground, growing taller and taller, until it reached the plant’s height. The roots then expanded into a dome, covering the whole of the plant until nothing but black, interwoven roots could be seen.\n\nIf you stumble upon this narrative on Amazon, be aware that it has been stolen from Royal Road. Please report it.\n\nAt this, Mosquito God’s Babies decided to start climbing the roots. They went in a single file line, presumably testing it before the second one came. As the first one started climbing on the roots, it was absorbed. The roots stuck out wherever the spider touched, and sucked the blood out of it. In just a few moments, the spider had been completely absorbed, no longer in sight. Seeing this, Mosquito God’s other baby decided to JOIN ITS BROTHER! WHAT THE HELL JUST HAPPENED!?!? WHY DID YOU DO THAT!?!?!\n\nAt my question, the entire dome started shaking. It was light at first, barely noticeable, but it slowly got stronger until it was unmistakable. It started shaking so hard it was causing earthquakes for kilometers around. And then it imploded. Blood and black roots collapsed in on themselves, causing a howling wind as air tried to escape from the giant dome of death trying to kill it. And then everything stopped. All that was left of that massive battle was a huge ball of red and black, the size of a mountain, just sitting in a wasteland.",
            "comments": [
                {
                    "comment_id": "8895327",
                    "username": "Dude88",
                    "comment_text": "Tftc",
                    "time": "2023-06-10T01:30:35.0000000+00:00",
                    "replies": []
                }
            ]
        },
        {
            "id": "1192948",
            "name": "40. Evolution",
            "url": "https://www.royalroad.com/fiction/64990/i-wanted-to-be-a-vampire-not-a-mosquito-monster/chapter/1192948/40-evolution",
            "content": "Well, that was something.\n\nAssisted Kaiju of Ohio(Lv 50) kill + 2000 exp.\n\nLevel up!\n\n+5 stat points\n\nLevel up!\n\n+5 stat points\n\nLevel up!\n\n+5 stat points\n\nMax Level obtained! Evolution is now possible!\n\n…What? First of all, who the hell is Ohio? I assume it’s another god, considering their naming sense so far… But what? I assisted!?!?! And who the hell names their kaiju Kaiju, that feels wrong. That’s like leaving your starters the name of their species, only monsters like speedrunners do that! What are you, Ohio, the God of Speedrunners!?!?! I swear, no creativity. Also, again, how did I assist!?!?!\n\nI can take away the levels if you want - Elly, Goddess of Chaos\n\nNo. no thank you, Elly. I’m good. I’ll stop complaining. Wow, what an assist that was, I helped so much, I should’ve probably gotten the bulk and them the assist, so unfair. Hahahaha. Alright, so, first things first. System, I want to level up!\n\nPlease select stats to put points into. (20 Available)\n\nStrength: 10\n\nAgility: 15\n\nDexterity: 10\n\nIntelligence: 100\n\nConstitution: 10\n\nCharisma: 10\n\nAlright, so, I think it might make sense to start investing in constitution again, considering my absolutely massive swarm boosting my constitution. I probably have a pretty good reason to start upping it again. So! Without further ado, System! Put them all in constitution!\n\nProcessing Request…\n\nConstitution: 30\n\nHeheheh, now… System, how much health do I have?\nHealth: 4220/4220\n\n…I wonder if you’ll answer me a question, Elly. How much health does a normal person have?\n\nSure, they have like 1000.\n\nHahahaha… HAHAHAHAHAH! I HAVE MORE HEALTH THAN A PERSON! FINALLY! I HAVE FINALLY DONE IT! Wait, will I still be so high without my constitution buff though…? Let’s not think about it, actually. Yeah, that seems like a bad idea. I’m harder to kill than a regular person, and that’s all that matters! Now then, System, let me see those juicy evolution options!\n\nAlright, I’ve still got all those options I had last time and what, one new one?\n\nOld:\n\nSpoiler\n\nPoison Mosquito(Tier 0):\n\nMosquitoes born in areas bathed in poisonous mana. Poison Mosquitoes are not very strong physically, but are mildly poisonous. Their poison gets stronger the longer they live, but it is generally considered only mild as their lifespan is not long.\n\nRequirements - Be a mosquito, Willingly ingest poison\n\nExpected Lifespan: 10 days\n\nMax Level: 5\n\nStats:\n\nStrength: 0.1\n\nAgility: 0.2\n\nDexterity: 0.1\n\nIntelligence: 0.05\n\nConstitution: 0.05\n\nCharisma: 1\n\nSkills:\n\nFly\n\nPoisonous Bite\n\nAged Poison\n\nTraits:\n\nSuper Fertile\n\nHoly Mosquito(Tier 0):\n\nA species of mosquito created by Illinois, God of Insects. Holy Mosquitoes are much longer lived than most other types, but relatively harmless. Their looks make people confuse them with fireflies, as they appear to consume darkness instead of blood, making them seem to glow.\n\nThe narrative has been stolen; if detected on Amazon, report the infringement.\n\nRequirements - Be a mosquito, Have a holy job\n\nExpected Lifespan: 1 year\n\nMax Level: 5\n\nStrength: 0.0001\n\nAgility: 1\n\nDexterity: 0.5\n\nIntelligence: 5\n\nConstitution: 10\n\nCharisma: 10\n\nSkills:\n\nFly\n\nHoly Flash\n\nTraits:\n\nConsumer of the Void\n\nDisaster Mosquito(Tier 0):\n\nMosquitoes born in areas where the fabric of the world is in chaos, or when a higher being wants to send a punishment. Disaster Mosquitoes are not that dangerous individually, being barely different from an ordinary mosquito. But as a group they are a force to be wary of. Disaster Mosquitoes can drink more blood when they are surrounded by others of their kind, and with a mere 10 they have the capacity to drain a full grown boar.\n\nRequirements - Be a mosquito, Survive at least 2 disasters as a mosquito,\n\nExpected Lifespan: 10 days\n\nMax Level: 5\n\nStats:\n\nStrength: 1\n\nAgility: 2\n\nDexterity: 1\n\nIntelligence: 0.5\n\nConstitution: 0.5\n\nCharisma: 10\n\nSkills:\n\nFly\n\nSwarm Tactics\n\nBloody Group\n\nAura of Fear\n\nTraits:\n\nSuper Fertile\n\nDemonic Insect\n\nNatural Disaster\n\nMosquito(Tier 8):\n\nThe evolution of a basic mosquito. A mosquito evolving is an event rarer than an eclipse, and when they do they are rewarded with power to match, causing short lived but disastrous consequences.\n\nRequirements - Reach evolution as a Mosquito(Tier 0).\n\nExpected Lifespan: 2 hours\n\nMax Level: 40\n\nStats:\n\nStrength: 50000\n\nAgility: 700000\n\nDexterity: 600000\n\nIntelligence: 1\n\nConstitution: 100000\n\nCharisma: 500\n\nSkills:\n\nFly\n\nAura of Blood\n\nCommand Species\n\nReplicate\n\nTraits:\n\nSuper Fertile\n\nDestroyer of Countries\n\nConsumer of Oceans\n\nSpecies Paragon\n\nSpider Mosquito(Tier 0):\n\nMosquitoes that miraculously managed to be born in the webs of a spider. They have become able to traverse their webs with ease, and help lure other insects into them, devouring all that get stuck, even other mosquitoes.\n\nRequirements - Be a mosquito, Live with spiders for at least 2 days\n\nExpected Lifespan: 10 days\n\nStats:\n\nStrength: 1\n\nAgility: 0.5\n\nDexterity: 0.3\n\nIntelligence: 0.05\n\nConstitution: 0.05\n\nCharisma: 20\n\nSkills:\n\nFly\n\nWeb Navigator\n\nSweet Aura\n\nTraits:\n\nSuper Fertile\n\nMaster of Deception\n\nAlright, that new one kinda sucks… Especially that last part of the description, I’d rather not be a cannibal. So, let’s just shelf that for a rainy day, yeah. And, I think it’s time to choose a cool one from my list. I don’t think Elly will be kind enough to give me another special evolution… There really is only one option, something I need to pick now so I can become OP in the future. The Poison Mosquito. I refuse to believe I am not going to live to my next evolution, and that Aged Poison skill is definitely becoming OP. I mean, it’s epic. The only reason Poison Mosquito isn’t is probably because they live like ten days. So, clearly, I should be a Poison Mosquito, I’m gonna wreck some mobs, poison them to death! Hehehehehe. I’ll finally have an attack! Nobody shall get in the way of the Mosquito Overlord! For they shall see while I might go by Tim, that I am Truly the Mosquito of Death!... I’m totally writing that down. That is definitely going to be my battle line. Heh, now System. I want to be a Poison Mosquito!",
            "comments": [
                {
                    "comment_id": "8895409",
                    "username": "Dude88",
                    "comment_text": "Tftc",
                    "time": "2023-06-10T01:40:44.0000000+00:00",
                    "replies": []
                }
            ]
        },
        {
            "id": "1195057",
            "name": "Interlude: The Holy Quest",
            "url": "https://www.royalroad.com/fiction/64990/i-wanted-to-be-a-vampire-not-a-mosquito-monster/chapter/1195057/interlude-the-holy-quest",
            "content": "Interlude: The Holy Quest\n\nI was heading to the guild when I got the notification. My party was going to be upset, but they’d understand, and it really didn’t matter if they didn’t. This was bigger than them, and it was bigger than me. It was bigger than any mortal on this plane. It was a holy quest.\n\nJob Elly’s Eyes Provides a new quest!!!\n\nWatch the Interesting\n\nSuccess:\n\nFind and watch the reincarnator known as Mosquito Overlord, Mosquito of Death, or maybe just Tim until Elly decides he is not a problem.\n\nFailure:\n\nLose track of Tim before Elly considers your job done, or fail to find him within 20 days.\n\nPenalty for failure:\n\nUnauthorized tale usage: if you spot this story on Amazon, report the violation.\n\nRevoke the job Elly's Eyes and death.\n\nAccept Quest(Y/N)\n\nThe Goddess of Chaos had called upon me, and it was time for me to deliver. Elly had given me my job, and it had gotten me through more situations than I could count. I could never reject her quest, if I refused I did not deserve to live, debts must be repaid. I got to the guild and left a letter with a receptionist. My party would get it when they dropped by later for our meeting; I had something more important to do.\n\nI went to the church, as they should have more information for me than what was given in the quest. The church was on the other side of town, but it wasn’t a very long walk. It only took thirty minutes to reach, and it was clear something was happening. The priests were rushing about, bringing mana gems of various sizes from storage into the inner sanctum. As I walked up to the entrance, a nun noticed my presence, and I saw her run inside, clearly looking for someone.\n\nI went into church, and saw what had happened. Elly’s statue had changed. Before, Elly’s statue was of a beautiful young woman, with blue crystals for eyes and a lovely toga that trailed down to the floor behind her. It was made of black quartz, carved by some of the best crafters in the kingdom. But it had changed, Elly’s statue had turned white, and her eyes were glowing red. She was angry, and that was never a good sign, for the priests, the kingdom, the world, and especially the one that caused it. There was going to be a disaster, and now was the time to prepare.",
            "comments": [
                {
                    "comment_id": "8532776",
                    "username": "RAD_snap",
                    "comment_text": "I hope Tim can one day one up Elly without the threat of death!\n\nP.s. First!",
                    "time": "2023-04-28T11:52:38.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8895424",
                    "username": "Dude88",
                    "comment_text": "Tftc",
                    "time": "2023-06-10T01:43:34.0000000+00:00",
                    "replies": []
                }
            ]
        },
        {
            "id": "1196303",
            "name": "Sorry",
            "url": "https://www.royalroad.com/fiction/64990/i-wanted-to-be-a-vampire-not-a-mosquito-monster/chapter/1196303/sorry",
            "content": "So, I've got a lot of exams coming up soon and I need to take a break so I can survive through them. Because Of that, I am sorry to announce that I'll need to take a two week break to get them all done. Hope you guys can find something else to do in the meantime. I'll see you soon\n\nUnauthorized content usage: if you discover this narrative on Amazon, report the violation.\n\nPs. I'll try to have something to make up for ny break when I get back, hopefully I have at least a little free time\n\nSpoiler\n\nI need 500 characters and don't know how to get them.",
            "comments": [
                {
                    "comment_id": "8538628",
                    "username": "Vibipi",
                    "comment_text": "good luck",
                    "time": "2023-04-29T01:27:11.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8538729",
                    "username": "VoidFiller",
                    "comment_text": "Good luck with exams, 🦟!",
                    "time": "2023-04-29T01:48:17.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8895432",
                    "username": "Dude88",
                    "comment_text": "Good luck",
                    "time": "2023-06-10T01:44:37.0000000+00:00",
                    "replies": []
                }
            ]
        },
        {
            "id": "1214408",
            "name": "41. The Pains of Evolving",
            "url": "https://www.royalroad.com/fiction/64990/i-wanted-to-be-a-vampire-not-a-mosquito-monster/chapter/1214408/41-the-pains-of-evolving",
            "content": "Just like last time, I felt my soul leave my body, probably my soul. Is my sense of self what my soul is? That’s too deep for me. I’m not gonna think about it. Well, my probably soul left my body, brought on a journey through the darkness. I was brought back to the battlefield I was at before, but it had changed. No longer were there insects eating or breaking eggs, the mosquitoes were defending them. The disaster mosquitoes were fighting back valiantly, but it was clear they would not last forever. They were slowly being killed off, as their enemies were numerous. There were millions of insects coming at them as quickly as they could. The mosquitoes were getting most of them, but as with all insect wars, numbers can beat all. Every now and then, some insect would get a lucky shot and kill one of the mosquitoes. Since the last time I saw them, their numbers had dwindled down to a mere few hundred, and they did not look like they would last long. Out of pure instinct, I did the same thing as last and used my piercing flight. It hatched thousands of eggs just like last time, but I could feel it. It would not be enough. This was nothing but a temporary solution, and it would lead to problems in the future. At this rate, their numbers would dwindle until all hope was lost, they needed to fight back instead. I flew there for a bit, before an idea came to me. To the insects, I radiated the idea that I wanted to talk to their manager. At that, they all turned around and scuttled away though the void, they’d be back, but this would help stave them off for even longer.\n\nAll of sudden, just like last time, I was back to my body, lying on the ground where I had started, though this time I appeared to have guards around me. The spiders appeared to have survived their assault on the flytraps, and a new web had been set up in the crater around me.\n\nMosquito God 1.5% to birth.\n\nFly level up. Dexterity multiplier is now 1.09x.\n\nPlease choose level 10 specialization for Fly.\n\nSkill Poisonous Bite obtained!\n\nSkill Aged Poison Obtained!\n\nERROR! As a sapient creature, intelligence cannot go below 100.\n\nCompensating…\n\nIntelligence + 63.95\n\nDue to being 100% compatible with body, Bloodsucker+2 has been upgraded.\n\nQuest “Expand the Cult” Completed\n\nReward(s):\n\nSkill Plant Communication obtained!\n\n…That’s a lot. Alright, it’s not that bad though. System! I wanna see my stats!\n\nName: Mosquito Overlord, Mosquito of Death, or maybe just Tim\n\nGender: Male\n\nLevel: 0/5\n\nExperience: 0/5\n\nAge: 9 days\n\nExpected Lifespan: 10 days\n\nRace: Poison Mosquito(Tier 0)\n\nDid you know this story is from Royal Road? Read the official version for free and support the author.\n\nStats:\n\nHealth: 192/ 192\n\nMana: 47\n\nStrength: 11\n\nAgility: 11\n\nDexterity: 11\n\nIntelligence: 100\n\nConstitution: 13\n\nCharisma: 13\n\nSkills:\n\nSpoiler\n\nFly(Lv 10)\n\n(Lv 5)Holy Flight\n\nLike a Rock(Lv 5)\n\n(Lv 5)Rocky Acting\n\nPray(Lv 6)\n\n(Lv 5)Only My God Matters!\n\nSpear Handling(Lv 1)\n\nAerial Combat(Lv 2)\n\nLike a Tree(Lv 1)\n\nPoisonous Bite(Lv 1)\n\nSwarm Tactics(Lv 2)\n\nBurst of Flame(Lv 1)\n\nPlant Communication(Lv 1)\n\nAura of Irritableness(Lv 1)\n\nPiercing Flight(Lv 1)\n\nTalk To the Manager(Lv 2)\n\nAged Poison(Lv 1)\n\nSpace?(Lv 1)\n\nBloodsucker+3(Lv 4)\n\nJobs:\n\nSpoiler\n\nHead Cultist Of the Mosquito God(Lv 6)\n\nEMPTY\n\nLOCKED\n\nLOCKED\n\nJob Skills:\n\nSpoiler\n\nLead Prayer(Lv 1)\n\nBloody Ritual(Lv 1)\n\nMember Initiation\n\nBorn into It(Lv 1)\n\nProtection of Blood(Lv 1)\n\nMessenger of the Mosquito God(Lv 2)\n\nTraits:\n\nSpoiler\n\nSuper Fertile\n\nHoly Crusader\n\nSelf-Named\n\nBlanket Of Enemies\n\nBlasphemy(Major)\n\nBlood Born\n\nApocalypse Maker\n\nGodly Caretaker\n\nMocked by The Gods\n\nMonster?(Legendary)\n\nSkill Researcher\n\nMy poor stats… they were so high before! MY HEALTH! MY beautiful health! Oh Mosquito God, this world is too cruel. The inhumanity… I hope someone pays for this. I will never forgive whoever made such sucky mosquito evolutions. They will feel the burning rage of my soul later! But more importantly, who made the evil plants? I figured it out?\n\nReward(s) for “Figure Out Who Made the Evil Grass!” revoked pending review of quest completion.\n\nWait, did I say I don’t know? I obviously know! It was, that god! What was his name…? Uhhh… Oregon? Yeah! Oregon! …No?",
            "comments": [
                {
                    "comment_id": "8676477",
                    "username": "Al Blaze",
                    "comment_text": "Hello and TFTC",
                    "time": "2023-05-16T00:51:22.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8895500",
                    "username": "Dude88",
                    "comment_text": "Tftc",
                    "time": "2023-06-10T01:55:51.0000000+00:00",
                    "replies": []
                }
            ]
        },
        {
            "id": "1215471",
            "name": "42. Truly a Flying Master",
            "url": "https://www.royalroad.com/fiction/64990/i-wanted-to-be-a-vampire-not-a-mosquito-monster/chapter/1215471/42-truly-a-flying-master",
            "content": "I want my rewards back, you stupid system! I am entitled to it! My brief having of Plant Communication was definitely very important to me! Can’t I at least be compensated for losing it? Pretty please…?\n\nProcessing Request…\n\nHmmm…. Maybe the gods will love me enough to give me that. We’ll see. So, where was I…? Oh yeah let’s check my new goodies! System, what does Aged Poison and Poisonous bite do?\n\nAged Poison:\nThe user can create a poison whose grade is based off of the age of the user. It slowly ferments in their body like a finely aged wine. Grade starts at Minor and increases by 1 for every 10 days the user was alive.\n\nCurrent Grade: Minor\n\nPoisonous Bite:\n\nWhen the user bites a creature, they can inject the poisons in their body into it.\n\n…What? Wait a second… I didn’t need to have this now!?!??! I COULD HAVE WAITED AND THE REWARDS WOULD HAVE BEEN THE SAME! I feel like I have been tricked. How does an aged poison be aged before I even have it…? I feel like this description definitely lied to me… Whatever, I’ll think about the implications of this later. Did I have anything else? Oh yeah, I got a new specialization for fly! I am getting so good at leveling that up! It’s like it’s the skill I use the most…\n\nSystem! Let me see my options!\n\nFly(Lv5):\n\nThrusters:\n\nRequirements - Fly(Lv5)\n\nIncreases the amount of thrust generated by wings.\n\nAcrobatics:\n\nRequirements - Fly(Lv5), Attempt to do mid-air tricks\n\nProvides knowledge of basic mid-air tricks when Fly levels up.\n\nSlicers:\n\nRequirements - Fly(Lv5), Have wings with thin edges\n\nA case of literary theft: this tale is not rightfully on Amazon; if you see it, report the violation.\n\nProvides knowledge on how to slice objects with the edge of wings when Fly levels up.\n\nCurrent Sensors:\nRequirements -  Fly(Lv5), Survive an ambush by a flying predator\n\nCan sense the currents caused by flying objects within fifteen feet of wings.\n\nFlying Combatant:\n\nRequirements -  Fly(Lv5), Aerial Combat Skill, Beat an opponent in aerial combat\n\nIncreases the ability to precisely maneuver in air. Aerial Combat provides more knowledge when leveled up(Does not Apply Retroactively).\n\nFly(Lv10):\n\nHolier Flight:\n\nRequirements- Fly(Lv10), A Holy Job, Holy Flight specialization\n\nWhen flying, a blurry form of the user’s God can be seen flying above them. Increases the effectiveness of Holy Flight specialization by 10x(multiplicative).\n\n…I only got one level 10 option. Was I that uneventful? Well, I mean, I might as well pick it. It’s probably better than picking another level 5 one. I bet it gets better as I travel anyways. Whatever, give me Holier Flight, System! I’m no loser, picking a level 5 specialization when I’m level 10. Hmph.\n\nNow then, do I have anything else I should do? I could check my other traits, but… I don’t really want to read those right now. (It’s not that the author doesn’t want to write descriptions, not at all.) Alright! So, I’ve checked my important things, I guess I could go, leaving the spiders now. I don’t think there’s anything around here that could kill them. Sheesh, Mosquito God created some true monsters.\n\nAlright, where to go…? Alright, my options are, edge of crater, edge of crater, edge of crater or… edge of crater. Goddammit. They ruined the environment! How am I going to figure out where to go? I guess I’ll just go towards the sun…\n\nAnd so, I set off on another journey! Off into the unknown! …I didn’t make it out of the crater before I needed to go to bed. And so, I set off on a… a journey. I STILL DIDN’T MAKE IT TO THE EDGE! How wide is this crater?!?!?! This time when I woke up though, I got a really… nice? Surprise.\n\nTrait Elder unlocked.\n\nElder:\n\nWhen learning new skills, it is 50% harder, but improving skills you already have is 100% easier.\n\nBe older than the expected lifespan of your base species (Mosquito(Tier 0)).\n\nSo, is that a good thing? I mean, yay I can level up my skills, but is it really worth being so hard to learn new skills? Ugh, I hate this. Why can’t it give me something with nothing but benefits? This stupid system, making me think! I DO NOT WANT TO THINK RIGHT NOW!",
            "comments": [
                {
                    "comment_id": "8685937",
                    "username": "dopplegerber",
                    "comment_text": "thanks :)",
                    "time": "2023-05-17T02:53:24.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8895543",
                    "username": "Dude88",
                    "comment_text": "Tftc",
                    "time": "2023-06-10T02:01:30.0000000+00:00",
                    "replies": []
                }
            ]
        },
        {
            "id": "1216580",
            "name": "43. Lava",
            "url": "https://www.royalroad.com/fiction/64990/i-wanted-to-be-a-vampire-not-a-mosquito-monster/chapter/1216580/43-lava",
            "content": "Alright, I’ll just take it as a benefit for now. It's no use thinking on it for this long. More importantly, I think I'm almost at the end of this stupid crater. I can't believe I(Mosquito God I mean) made such a monster. That's terrifying. As I started to reach the edge of the crater, I noticed something. The wall was… shimmering? And shaking? Uh oh. As I got closer, the shaking continued to get worse and worse, and I noticed something orange peaking above and dripping over the edge. Yeah, that’s always a good sign. Maybe I shouldn't… Eh, whatever. Let’s go! I’m invincible… wait no I’m not… I evolved. Uhhhhh.\n\nAt that thought, the wall collapsed down into the crater. A wave of orange collapsed into the crater, moving… oddly slow. After it passed the steep edge, it got slow real quickly.\n\nThe… lava? went from a possible wave of water to a nice stroll. I mean, the only way you'd be caught in it is if it managed to surround you somehow. And people say lava is dangerous. Clearly they’ve never seen it. So, I continued my flight , going over the lava to see my newest expedition. It was… not a place very conducive to a blood sucking mosquito. It was, for a lack of a better term, a hot barren wasteland. It was honestly probably worse than the wasteland I found past the lake in the first place. There were pools of lava all around. With nothing but ash in between. It would be nice if I could drink lava, but I’m pretty sure I’d burn before even getting close to there. So, I decided to turn around. And… I think the lava sped up when I wasn’t looking. The slow little lava pool that was barely faster than walking distance had covered a huge swath of land behind me.\n\nLove what you're reading? Discover and support the author on the platform they originally published on.\n\nIt was everywhere I could see… WAIT A MINUTE! THIS BETTER NOT BE ANOTHER EVIL GRASS PROBLEM! I quickly felt for my connection to my cultists, and they were all there, safe! Alright, it’s just deceptively quick lava. So, where was I? Oh yeah, the way back is gone. I might as well go forward… Despite what anyone else tells you, flying over lava is irritating. It’s so hot that you can feel it all around you. Or maybe that’s just because it’s a fantasy world. Eh, whatever. So, I decided to fly around the pools of lava and continue on my journey.\n\nOverall, it was rather lackluster, until I felt something in the back of my mind. It was a light probing feeling, like something was trying to get in. Yeah I’m out. I think I’d rather not be mind controlled by a random creature that I can’t see. So, I turned around… I turned around. I SAID I TURNED AROUND! I was trying to turn, but my body wasn’t listening to me anymore. I kept going forward, toward a rather large pool of lava, that was rippling. And it was really weird. Have you ever seen water ripple when you drop something in it? It was like that in slow motion. But it was quickly speeding up. Soon, there wasn’t a single piece of stationary lava, and it was moving so fast I couldn’t track a ripple. Then, it started rising. Out of the ground came a… slime? Alright, that is definitely a slime. I got my first view of an actual normal fantasy monster, except it was the size of a trailer, and made of lava. I guess lava slimes aren’t that unusual… WAIT! Not the time for this! I was quickly approaching my death, being brought closer to the giant slime that wanted to envelop me. I was a few meters away, then half, and finally a few centimeters, when I stopped. I couldn’t even see the top of the slime at this point, as I was waaay too close, but I realized something. The probing feeling in my mind had changed. Where before it felt like it was trying to break in, now it was… wrapping around me? And I think amused? What? What the hell did I just come across?",
            "comments": [
                {
                    "comment_id": "8716967",
                    "username": "Vibipi",
                    "comment_text": "",
                    "time": "2023-05-20T19:16:53.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8777831",
                    "username": "Ari Maor",
                    "comment_text": "Thanks for the chapter!\n\nSadly, i caught up... But i can only wait for more!",
                    "time": "2023-05-27T19:59:56.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8895580",
                    "username": "Dude88",
                    "comment_text": "Tftc",
                    "time": "2023-06-10T02:05:59.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8920255",
                    "username": "ZhaneSilverman",
                    "comment_text": "Such a fun and amusing story! :D",
                    "time": "2023-06-13T02:04:00.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "8979333",
                    "username": "Cielineri",
                    "comment_text": "Funny, hope the hiatus ends soon",
                    "time": "2023-06-20T02:44:47.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "9399915",
                    "username": "znaeb",
                    "comment_text": "Thanks for the chapter",
                    "time": "2023-08-08T02:24:27.0000000+00:00",
                    "replies": []
                },
                {
                    "comment_id": "13311425",
                    "username": "MrSarcasm",
                    "comment_text": "Hell yeah can't wait for more",
                    "time": "2024-09-18T12:27:23.0000000+00:00",
                    "replies": [
                        {
                            "comment_id": "16536072",
                            "username": "Daniel the chalabaia",
                            "comment_text": "Sorry brother, thy emperor wasn't in our side.",
                            "time": "2025-06-28T10:41:30.0000000+00:00",
                            "replies": []
                        }
                    ]
                }
            ]
        }
    ]
}