{
    "id": "64990",
    "name": "I wanted to be a Vampire! Not a Mosquito! [Monster Evolution LitRPG]",
    "url": "https://www.royalroad.com/fiction/64990/i-wanted-to-be-a-vampire-not-a-mosquito-monster",
    "cover_image": "data\\images\\64990_cover.jpg",
    "category": "Original",
    "status": "DROPPED",
    "tags": [
        "LitRPG",
        "Non-Human Lead",
        "Adventure",
        "Fantasy",
        "High Fantasy"
    ],
    "description": "Steven lived a nice life. He had a job, a one room apartment, and even a cat. It was all going so well. So why did he die from a heart attack? But it's not all bad, he gets to reincarnate, and can even choose a special skill for himself! He'll be a vampire, and gain powers from drinking blood! Wait, why is everything so big? He's a mosquito?",
    "total_views": "79,410",
    "average_views": "1,654",
    "followers": "114",
    "favorites": "36",
    "ratings": "29",
    "page_views": "126",
    "overall_score": "",
    "style_score": "",
    "story_score": "",
    "grammar_score": "",
    "character_score": "",
    "reviews": [
        {
            "review_id": "1625143",
            "title": "Mostly the MC yelling at his system.",
            "time": "13:14 8/4/2023",
            "content": "Mostly the MC yelling at his system.\nREVIEWED AT: 29. Spiders Suck\nBY fredthebadger\n13:14 8/4/2023\n\nThe main content of this story is the MC complaining about his system-granted abilities and quests, TO his system, and having his system and/or various gods operating through his system screw with him in response.\n\n \n\nThere's a lot of skill reading, but instead of sitting there thinking about how to min-max he complains and then has to deal with the consequences of his complaints being heard.  Once you're past the first few chapters the character is mostly established and you'll start getting an idea how all future conflicts will be handled, which means you'll know whether you want to keep reading.\n\n Report",
            "user_id": "30656",
            "chapter_id": "1162168",
            "story_id": "64990",
            "score_id": "1625143_score",
            "_id": 